{
   "name": "CHRGR",
   "url": "https://republic.co/chrgr",
   "dealTerms": [
      {
         "Valuation cap": "$8,000,000"
      },
      {
         "Discount": "10%"
      },
      {
         "Minimum investment": "$100"
      },
      {
         "Type of security": "Crowd SAFE · Learn more"
      },
      {
         "Funding goal": "$25,000 – $535,000"
      },
      {
         "Deadline": "January 1, 2020 at 2:59 AM (EST)"
      }
   ],
   "discussion": [
      {
         "commenter": "Long Wonng",
         "message": "On waitlist",
         "replyList": []
      },
      {
         "commenter": "Richard Tappert",
         "message": "I am on a wait list as well, what is the time frame that they will accept. I am new to this.",
         "replyList": []
      },
      {
         "commenter": "Neelofer Khan",
         "message": "I am on the wait list.",
         "replyList": []
      },
      {
         "commenter": "Neelofer Khan",
         "message": "Hi John M\nPlease tell the latest date till which we can increase our investment? Campaign ends Jan 1, 2020.",
         "replyList": []
      },
      {
         "commenter": "Hayk Harutyunyan",
         "message": "your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
         "replyList": []
      },
      {
         "commenter": "William Evans",
         "message": "It invested the minimum $100.00 , is it possible to increase my investment at this time?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@william-evans-1 trhanks and simply go to your committed funds (investment) on the profile, tap \"edit\" and you can increase your investment. it's that easy - and thanks again! JM\nLike · Reply ·\nMark as helpful\n· Founder of CHRGR · About 1 month ago",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "carmen skrine",
         "message": "Eventhough I saw the light early.",
         "replyList": []
      },
      {
         "commenter": "Debbie Gragg",
         "message": "Can we say Unicorn boys and girls, sure we can. I believe this company has the great potential to become an up and coming Unicorn. I was very disappointed to miss out on the first fundraising round, as it closed just before I joined Republic and my Husband and I joined Angels and Entrepreneurs. However I joined the wait list with an investment, so waiting to see what happens.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@debbie-gragg Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Alan Goldberg",
         "message": "This deal closed some time ago. Why is it still listed? It takes attention from ongoing offerings.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@alan-goldberg Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Cynthia Glintz",
         "message": "Has anyone gone on the waitlist and added their account information to get in on CHRGR if they open up to more investors?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@cynthia-glintz Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            },
            {
               "commenter": "Russell Smith",
               "message": "@cynthia-glintz It closed so fast that I missed it. I did get on the whitelist so I am hoping to get in. I will be looking for it to re open with a higher cap....I hope... good luck and I hope you get in. This could be big.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "roland ruth",
         "message": "I am also awaiting for 2nd round!",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@roland-ruth Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jeff Dillon",
         "message": "Will there be another round I missed investing in it and I’m on the waiting list",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@jeff-dillon Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Neelofer Khan",
         "message": "Where on form c would I find whether Chrgr accepts international investors? Attn John and Lucas please tell if Canadian citizens can invest in Chrgr. Where does it say that clearly on form c? Unable to locate. I did invest in Chrgr",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@neelofer-khan Republic's platform accepts investments from all jurisdictions other than a few that are covered by economic sanctions, but each investor should consult local rules and regulations to confirm their eligibility to invest.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Frederic El Khazen",
         "message": "open a second round",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@frederic-el-khazen Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Neil Fraser",
         "message": "It is great to see another festival added in September. Festivals seem to be good revenue sources. From I remember seeing somewhere the main use of this round of $535K crowd funding was to enable you to fund heads down revenue generation. Including launching the transition to battery chargers being \"borrowed\" like Lime Scooter model. With advertising in the app instead of physically printed on the battery charger.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@neil-fraser yes indeed! and we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "This would make a great business card substitute or even a CV.",
         "replyList": []
      },
      {
         "commenter": "Chris Williams",
         "message": "Do you have a patent on this? How much competition would you have from similar products?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@chris-williams patent pending on RFID and NFC capabilities. and think of us a platform, and SaaS play and less as a hardware company. the tech and power banks will always change, evolve and we'll then update as needed.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Robert Martin",
         "message": "Has DFM and DFMA been completed to lowers costs and make corrections prior to launch?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@robert-martin-2 thanks robert - and just clarify for us what you need to go. also we're post launch, post revenue and been working w/ clients and partners since 2016.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Margaret Hale-Gray",
         "message": "Told my banker about CHRGR. She is interested in buying some to put in new residents \"Welcome Baskets\" to advertise the bank and also as a reward for customers opening new accounts. She wants to know how much they cost and who to contact.",
         "replyList": [
            {
               "commenter": "Neil Fraser",
               "message": "@margaret-hale-gray At CHRGR.com at the bottom of the home page is an action button with \"Get in Touch\" right below the text \"Let's Work Together\".",
               "replyList": null
            },
            {
               "commenter": "Neil Fraser",
               "message": "@margaret-hale-gray or the person can get the same results as clicking on that button by just entering \"chrgr.com/contact\".",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@margaret-hale-gray please email us sales@chrgr.co",
               "replyList": null
            },
            {
               "commenter": "Debbie Gragg",
               "message": "@neil-fraser I saw a post over at A&E where someone mentioned that She and her Husband participated in their local metro crafts fair every year that had an attendance of around 1,000,000 show attendees. She mentioned crafts. shows, and fairs would be a great place to have these chrgr's. This made me think of the well known companies who are represented there by network marketing consultants, who are trying to sell their products like candles, personal care, and home decor and kitchen stuff, along with individuals and small businesses. Also the local trade shows, home shows, and auto and boat shows would be receptive to Chrgr big time, in my opinion.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@debbie-gragg thanks and email us at sales@chrgr.co to share more info. and maybe you can even earn a commission w/ us for the revenue referral ;)",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "Will you be able to extend your goal?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@baron-huntington Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Greg Corral",
         "message": "Do you have the option of Sweat Equity? Is there anything that you might need assistance with such as Advertising or something like that?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@greg-corral thanks greg and email us info@chrgr.co - happy to chat w/ you about our future team and staff needs.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Karim Elkholy",
         "message": "Human behavior is that if you get something for free you will just take it and not think about environmental impact. How do you ensure that the user will recharge or return the battery and therefore save the planet from more disposable batteries not getting recycled?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@karim-elkholy all batteries checked out via app - profile set up via our SaaS platform, and we'll notify you to return or we'll process a purchase w/ the direct customer. please look at e-scooter service behavior and citi-bike for models that operate this way (successfully)",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Scott Becker",
         "message": "Sorry, found it. Apparently the answer for CHRGR is NO to international investors",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@scott-becker thanks scott are you an international investor? also please review deal terms here republic.co/learn/investors/crowdsafe",
               "replyList": null
            },
            {
               "commenter": "Scott Becker",
               "message": "@john-mullin Yes, I am from Canada. Looked at your link and could not find an answer. Save me some time, can Canadians invest under the crowdsafe terms or not?",
               "replyList": null
            },
            {
               "commenter": "Urvesh Devani",
               "message": "@scott-becker @john-mullin In the FAQ of republic, it is mentioned that company has to decide whether or not it is accepting investments from international investors. Could not find any mention in the Form C of CHRGR regarding the international investment. Now , I'm confused.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@urvesh-devani @scott-becker Republic's platform accepts investments from all jurisdictions other than a few that are covered by economic sanctions, but each investor should consult local rules and regulations to confirm their eligibility to invest.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Scott Becker",
         "message": "I'm new here, and trying to find Form C to see if you allow International Investors (Cdn).\nAny help? Getting only vague answers from Republic.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@scott-becker Republic's platform accepts investments from all jurisdictions other than a few that are covered by economic sanctions, but each investor should consult local rules and regulations to confirm their eligibility to invest.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "raul rodriguez",
         "message": "Another venue that would be a big push for these are sports venues NFL,MLB, NHL, NBA,FIFA!",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@raul-rodriguez-3 thanks and let us know if you have connects or ideas!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Howard Hadley",
         "message": "Hi. Interesting business.\n\n1) What do you see as your total addressable market and is the investment proposition a) the market is growing or b) there is a huge whitespace opportunity in a stable market?\n2) Earlier you stated that CHRGR is “tapping into user behavior that already exists across the billion dollar e-scooter and bike share market.” What exactly does this mean and how are these markets at all related?\n3) Do you have any meaningful customer concentration? What % of revenue is your largest customer?\n4) Given the unique business model, who do you see as the natural buyers in a potential exit? Advertising agencies?\n5) Are you raising institutional $ alongside this crowd round?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@howard-hadley @howard-hadley 1) What do you see as your total addressable market? and is the investment proposition a) the market is growing?\n-- In 2019 the number of mobile phone users is forecast to reach 4.68 billion and expected to pass 5 billion by 2020. And then up to 12 billion in 2022\n2) Earlier you stated that CHRGR is “tapping into user behavior that already exists across the billion dollar e-scooter and bike share market.” What exactly does this mean and how are these markets at all related? -- shared economy and rental models (work) - we have a giant 10K+ venue network and we will use that network to provide our services. Customers could check out batteries at one venue and then visit another distribution venues to drop-off batteries via using an app. When customers check out a CHRGR device (using our app - which runs in the background) brands can gather customer data.\n3) Do you have any meaningful customer concentration? What % of revenue is your largest customer? -- CPG and service based brands, like Nike, Unilver, and Lyft\n4) Given the unique business model, who do you see as the natural buyers in a potential exit? Advertising agencies? -- Media agencies, entertainment companies, technology companies, private equity\n5) Are you raising institutional $ alongside this crowd round? --- our focus right now is on this CF round and subsequently earning as much revenue via sales instead of more fundraising - CHRGR makes money and we'll continue to do so.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Mike Le Blanc",
         "message": "I think this is a great idea as long as the charger units are available in multi locations. Everyone these days has a phone and everyone needs to have their battery charged. I can't see this being anything but a success. \"Fingers crossed\".",
         "replyList": []
      },
      {
         "commenter": "Carl Maietto",
         "message": "How do I invest additional funds?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@carl-maietto thanks and simply go to your committed funds (investment) on the profile, tap \"edit\" and you can increase your investment. it's that easy - and thanks again! JM",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@carl-maietto Republic's platform accepts investments from all jurisdictions other than a few that are covered by economic sanctions, but each investor should consult local rules and regulations to confirm their eligibility to invest.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Debbra Roum",
         "message": "Are the batteries rechargeable, or one time use... if one time use, what is the plan to dispose of them once they run out?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@debbra-roum rechargeable for 100+ cycles, and 6-12 months. we dispose of depleted customer batteries using FCC compliant partners and resources.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Dohan Ventures Corp.",
         "message": "Hi, will it be your goal to pay your investors dividends?\n- Jeremy",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@dohan-ventures-corp thanks and please review deal terms here republic.co/learn/investors/crowdsafe",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@dohan-ventures-corp Republic's platform accepts investments from all jurisdictions other than a few that are covered by economic sanctions, but each investor should consult local rules and regulations to confirm their eligibility to invest.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@dohan-ventures-corp Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@dohan-ventures-corp thanks and we look forward to seeing another investment from dohan, simply go to your committed funds (investment) on the profile, tap \"edit\" and you can increase your investment. it's that easy - and thanks again! JM",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Hamed Eshraghian",
         "message": "Could you please elaborate on the statement above, \"We also generate tracking data, including real-time campaign analytics, user information and geo targeting, to measure campaign effectiveness and targeting?\" What are you exactly tracking and what user information are we talking about? Thanks.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@hamed-eshraghian via proprietary software and via campaign CTAs like QR, NFC, and SMS we generate tracking data, including real-time campaign analytics, user information and geo targeting, to measure campaign effectiveness and targeting.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "harold tolchinsky",
         "message": "what is 2019 revenue to date and what is projection for 2019?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@harold-tolchinsky 2019 projections are listed on our profile at $2.5MM",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@harold-tolchinsky Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Victor Oliveras",
         "message": "Are there plans to develop a battery that lasts longer that what is in the market today?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@victor-oliveras thanks we're working on super capacitors (so yes)",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Nilson Souza",
         "message": "@john-mullin ,Hi, I am interested in investing in your company. A few days ago I emailed chrgr inquiring how my gym could be a partner (I own a small gym on the UES) but have not received any answers to my email. Would love to stop by for a visit as well since we are both located in NYC. any way we could arrange it?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@nilson-souza please email as .co not .com - info@chrgr.co and we look forward to hearing from you.",
               "replyList": null
            },
            {
               "commenter": "Dohan Ventures Corp.",
               "message": "Perhaps you guys can add .com to your email servers to avoid this confusion. Plus, why use .co if you already have your company's exact matching .com? @john-mullin",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@dohan-ventures-corp thanks and .com works as well.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "BRIAN ORNSTEDT",
         "message": "I want to invest in this company and do like it more so for the advertising revenue aspect and the overall marketing plan but the product itself is no different then many low cost chargers already on the market from oem manufacturers home and abroad. I own 3 similar chargers. They are bulky and require multiple connectors, etc. I could literally order 1000 similar chargers with custom branding right now on Alibaba for under $3 each. There is zero barrier to competition besides the branding and good marketing plan. If successful, there will be 100+ ad specialty manufacturers that will compete within a few years and already have the existing relationships with large corporations and ad budgets (I've licensed to this market). Ad specialty products need to be under $2 for any significant volume and under $1 for mass market adoption. This product needs to be more novel and have intellectual property protection and new ergo design. I recommend a environmental friendly, flat disposable paper based capacitor wireless charger based on the Qi standard that just gives a quick 25-50% boost over 3-5 minutes. Lower cost, better print area and resolution for logo. Size of a 2\"-3\" round coaster and just hold against back of your phone for 3-5 min. This company will do well to capture early market share but I cant invest at this time for a fairly standard electronic product in highly competitive market.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@brian-ornstedt i appreciate the time you spent to write this. and so what i'll say is this - CHRGR is not a battery company. all of the hardware and method of charging will ALWAYS change and evolve. (QI, super capacitor, and lithium ion, we use them all - and we'll continue to move w/ the market and follow what's leading in adoption, and provides CHRGR the best ROI) to be clear we are 100% focused on accessing customers for ourselves and our brand partners - where and when those (end user) customers are most active (in their favorite venue, ride share, hospitality location or event) - and by providing a service, instead of bombarding them w/ advertising they don't want or need. So again i'll stress this point - you are not investing in hardware - especially off the shelf hardware - but instead you are investing in customer acquisition software, a customer platform (that uses utility versus typical ads), a data provider, and tapping into user behavior (TAM) that already exists across the billion dollar e-scooter and bike share market.",
               "replyList": null
            },
            {
               "commenter": "BRIAN ORNSTEDT",
               "message": "@john-mullin Thanks for response John. I spent few days trying to come up with a way to disrupt your business model prior to investing which I have done both. I would like to share my product design with you under an NDA. This would give you a novel product with intellectual property and also an idea for a companion app that would appeal to your ad partners/end users. I was already preparing a patent application as this is one of my best product ideas in 20 years...lol. Would rather hand off for you to pursue the IP. Let me know...",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@brian-ornstedt very interesting and thanks for the investment. email us at info@chrgr.co and we can talk on this further. JM",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Michael Kim",
         "message": "Are there any plans to distribute on airlines. Units could be sponsored by individual air carriers. If you take a step further, they can pick up or drop off at airports and collect data on peoples travel patterns.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@michael-kim-4 we certainly agree, however we also have be mindful of air travel sensitivity - as many airlines still require some unboarding on the safety of powerbank (cabin) travel. more dialogue is coming in that use case and we'll certainly update you soon. thanks and we look forward to your investment!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Alan Serikawa",
         "message": "Do you have any plans to introduce the batteries to the various amusement parks? Specifically, ever since Disneyland introduced MaxPass App for fastpasses, the main complaint for many park goers is of phones dying because they have to constantly check the app for new fastpass availability....",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@alan-serikawa thanks alan, and yes it's a significant use case. feel free to connect w/ us if you have any connects w/ those types of partners. and in the interim we're also having discussions.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "WILLARD LOVELL",
         "message": "Two words power & free. We all deal with ads to play free games, now this is just the next step in a connected world to engage this next generation of users. I will be investing this week! I see big things for your idjohn-mullinllin",
         "replyList": []
      },
      {
         "commenter": "yoga sp",
         "message": "whoa very nice product",
         "replyList": []
      },
      {
         "commenter": "Oladipupo Akintoye",
         "message": "I've got some questions which I'd like addressed before I invest:\n1. How did you arrive at your current Valuation cap ? Seems rather high for a company raising Reg CF.\n2. Do you plan to go into future financing rounds (Reg A+) within 2 years at least?\n3. What exit strategy are you envisaging, if at all, and how soon would that exit be effected?\n4. How would my investment(s) be used to add value to the company?\n\nWishing you massive success!",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@john-akintoye Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!\n\nValuation cap is fair based on a previous $6M premoney in 2017 w/ CF and our revenue since then at 3x in 2018. Thus that supports our $8M current premoney.\nPotential future financing rounds (Series A+) within 2 years.\nExit will be acquisition by another SaaS, tech, services, or entertainment co.\nPlease check use of funds section for how your investment(s) will be used to add value.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Urvesh Devani",
         "message": "As a utility driven advertisement company, how would branding look like in the future with/without charger devices? What changes do you see in the way advertising is done right now and the way would be done in and after the next 5 years?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@urvesh-devani everything is moving towards software - therefore the branding and sponsorship will be ultimately integrated into the actual software (and sold as digital media) - these branded apps and platforms will be used to either access new charging tech, wireless charging tech, or whatever new innovation is adopted next. the hardware is secondary and is agnostic - CHRGR already has the network (still expanding daily) that can support and distribute to all of those new users - no matter what the form factor or barrier of entry will inevitably be. that being said I hope to now see an investment from you Urvesh! - and thanks for your question.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Nelson Martins",
         "message": "from reading all of this, im still very confused about the business model.\n-do you charge customers to use your batteries or no?\n-if yes, how much?\n- do the batteries have to be returned to you guys at the end of a festival? if so, how do you enforce it?\n- what is your total cost to make a battery (at 100k units)?\n- what is your battery size in mAh?\n-how much to charge brands to advertise on your batteries?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@nelson-martins the batteries are made avail and distributed via our venue, and rideshare networks to (end user) customers for free - paid and sponsored by brands so that (end user) customers do not have to pay for them. brands pay between $9 and $13 per battery based on level of customization (including packaging), battery type, and quantity. the festival is a different model than the aforementioned and continues to succeed for us as well, - and in that model we sell a battery to a festival attendee (end user) customer for $30. - it is then up to the customer to return to our distribution locations (booths) at Bonnaroo, or Outsidelands and exchange a depleted battery for a fresh one- the customer also shows a digital receipt (proof of purchase) w/ the depleted battery to further prove that they paid for our exchange service. battery resale margins are typically 60% - 80% from production - depending on quantity and we've exceeded 100K units. battery mAh range from 2500mAH up to 14000 mAH and we have full access to a range of capacity and form factors.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@nelson-martins thanks again nelson - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@nelson-martins time to invest! as we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Sherman Tan",
         "message": "Great idea, I have 3 questions if you don't mind,\n1. Are the chargers manufactured for a 1-time use for the event only?\n2. Have you considered the environmental aspects of the power banks when you're making bulk quantities of it across the distribution channels across the country?\n3. Do you have any interest in doing an IPO, if so when will you initiate it? Doesn't have to be a definite date but at what progress will you do an IPO?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "thanks @sherman-tan for your questions. the units work repeatedly and are not just 1 time use. we actually will be helping the environment by providing an exchange service that will keep a certain amount of units in circulation versus introducing more via sales. ipo is certainly a potential goal down the road but we’re focused on our growth and this current raise right now ATM.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@sherman-tan thanks again sherman - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Peter Cafaro",
         "message": "How do the costs improve if more phones have wireless charging and may not have to provide cables?",
         "replyList": [
            {
               "commenter": "Stanislav Nikolaev",
               "message": "This is a cool question, man! This directly threatens your business model. Do you have options?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "thanks @peter-cafaro for your question. we also produce wireless batteries for such clients as nike. therefore we have no issue w/ competing wireless products because we also already feature them for our campaigns.",
               "replyList": null
            },
            {
               "commenter": "Stanislav Nikolaev",
               "message": "I did not know this, thank you very much! Now I am sure that you have alternative solutions and this is wonderful.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Eli Alter",
         "message": "1) Does the CHRGR comes with a cable for charging for other uses once I keep the device?\n2) Whats the minimum order for an event and how much in advance should one place the order?\n3) I didn't found much information on having CHRGR devices in restaurants for example, and just use i while i'm there, similar to the Chargello model?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@eli-alter thanks for your questions. CHRGR comes with a cable to support iPhone, Android, USB C - and to recharge the CHRGR.\nMOQ depends on client opportunity and production timing is 2-3 wks\nCHRGR is in 10,000+ hospitality venues (and counting) to get a CHRGR and go.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@eli-alter we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Turan Cengiz",
         "message": "Any international expansion plans?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@turan-cengiz yes indeed.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Turan Cengiz",
         "message": "Great product",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@turan-cengiz thanks again turan- hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@john-mullin Now, we know that many of you were disappointed to see that CHRGR's raise filled up so quickly. As we've seen plenty of comments on a roster of deal forums and the Republic discussion board asking if and when CHRGR will start accepting new investors, so again all we can say is that you'll want to keep an eye on your inbox in the next 2+ weeks as CHRGR is now undergoing an audit to keep SEC compliant and expects to raise the cap as soon as that's complete!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "juliano fernandes",
         "message": "Love the product and the innovation",
         "replyList": []
      },
      {
         "commenter": "Patrick Smith",
         "message": "Nice revenues year over year! What do you estimate for 2019 revenues? Any new debt for 2019 to finance your operation?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@patrick-smith-1 thanks. estimated revenue for 2019 should exceed $1.25MM and our current debt is a crowd note from a successful 2017 CF raise - (feel free to review more in our Form C) and we have revolving (cash flow support) debt now w/ Kabbage at $16,457.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "James-Anthony Giorlando",
         "message": "Swap exchange batteries, brilliant idea. So many use cases. So many people running out of juice at the wrong time. I'm still trying to work out the pricing structure and long term viability. You mentioned in another comment that is $30. How often are you able to swap? What happens when technology improves? Do customers need to pay again for the new technology? How often will you be developing batteries? What's the plan for obsolete batteries and recycling? Are there plans for returning batteries or incentives for returning batteries and upgrading?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@james-anthony-giorlando Thanks for your interest and questions. In the B2C / Festival environment specifically (bonnaroo and outsidelands only) we offer unlimited swaps via digital tokens during the 3-4 days of the festival after customers initially onboard and then pay $30 at the end of the festival customers keep their last \"swap\" and take it home. As far as technology - you need to really think of CHRGR more as an advertising company and a (utility) service. We evolve w/ tech, hardware, form factor and capacity - and have already done so several times; including QI and USB C updates etc. RE our other non B2C / Festival business our plan is to continue w/ our B2B2C brand sponsored units - paid for by advertising and distributed to customers where and when they need power; and futurevision alluded to at the end of our profile is CHRGR operating like a Lime, Bird or CitiBike for battery power across our nationwide network of venues and rideshares.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@james-anthony-giorlando thanks again james - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jeffery Ryan",
         "message": "Thought this article on battery density might be helpful to answer the question; What might be true in the next 5-10 years? quora.com/Is-it-true-that-battery-energy-density-improves-5-8-per-year-Does-this-represent-an-average-or-is-it-a-consistent-trend-each-year-Do-these-improvements-increase-the-cost-What-has-been-the-trend-if-any-regarding-energy-to-weight-ratio",
         "replyList": []
      },
      {
         "commenter": "Jeffery Ryan",
         "message": "Hey CHRGR team, thanks for being on Republic. @john-mullin can you give me the TLDR on your revenue model? I am still not clear on how exactly you are charging your customers, both B2C and B2B. Thanks.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@jeffery-ryan the quick story is that 100+ clients pay CHRGR to buy batteries, brand them w/ a creative CTA, and distribute them throughout our distribution channels like Uber, Lyft, Aspen and a roster of hospitality venues that help the client acquire more customers - that's our B2B2C model. Additional business that keeps the lights on is our specific B2C festival business at Bonnaroo - our 4th year (starting in 2 weeks) and Outsidelands (4th year also) where customers pay Pay $30 and buy a CHRGR unit for our exchange service to power up all weekend - once depleted during the festival - return that unit and swap (exchange) for a freshly charged unit - rinse and repeat and ultimately leave the festival w/ a battery . Additionally you can also buy limited edition CHRGR units at the ACE Hotel in NYC and you can purchase the Mack Weldon Ion Weekender (overnight bag) that features our CHRGR as an accessory to the luggage (),",
               "replyList": null
            },
            {
               "commenter": "Ph Kn",
               "message": "@john-mullin In your B2B2C model, how much do the brands pay to purchase the unit from you? And how much do they cost for you to manufacture?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@phil-knittel and thanks for your question. we make at least 63% margin for 10k unit orders and 72% margin at 100K unit orders.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@jeffery-ryan thanks again jeffrey - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Tiffany Briggs",
         "message": "I like the free ones🦄",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@tiffany-briggs we do too ;)",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@tiffany-briggs thanks again tiffany - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Ross Rice",
         "message": "are the chrgrs available to the general public without having to get one from a sponsor? if yes, where can we get one and what is the cost?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@ross-rice thanks and starting June 12th we'll be at the Bonnaroo Music Festival for our 4th year. We sell our CHRGR devices as a B2C exchange service. Pay $30 and buy a CHRGR unit - once depleted during the festival - return that unit and swap (exchange) for a freshly charged unit - rinse and repeat and ultimately leave the festival w/ a battery . Starting August 9th we'll do the same B2C play again at the Outsidelands Music Festival in San Francisco. Additionally you can also buy limited edition CHRGR units at the ACE Hotel in NYC and you can purchase the Mack Weldon Ion Weekender (overnight bag) that features our CHRGR as an accessory to the luggage (mackweldon.com/products/ion-weekender), besides that our business is B2B so the best place to get a CHRGR is via our brand partners when they distribute across venues, events, resorts, hotels and ride-shares.",
               "replyList": null
            },
            {
               "commenter": "Ross Rice",
               "message": "so these arent main stream in smaller markets yet? what if i am Fresno Calif and am not near any of these advertisers? where can we recharge our chrgr?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@ross-rice this is a one way street. if you get a chrgr unit either via purchase or via a brand sponsor through our distribution channels you also get a 2&1 cable to charge your mobile device and to recharge the CHRGR any where you want that has a usb power source. thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Patrick Smith",
         "message": "What are your intentions going forward with this company? To be acquired, list on an exchange or remain private?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@patrick-smith-1 acquisition by either a media conglomerate, hospitality holding company, or a technology / data business.",
               "replyList": null
            },
            {
               "commenter": "Patrick Smith",
               "message": "@john-mullin nice! I believe you are on to something great with this low overhead, high margin product/service! What kind of timeframe are you looking to be acquired? 1,3, 5 years down the road or more?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "thanks @patrick-smith-1 and the quicker we raise some capital from forward thinking investors such as yourself to scale the business the more exciting potentials we’ll have down the road.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Krishna Mohan",
         "message": "Thanks for sharing the investment opportunity. I like the overall premise having dabbled a bit in the media and marketing space.\n\nAppreciate if you can share your thoughts on the below questions.\n\n1. In 2016, you had revenues of 275k+, in 2017, the revenues dipped to 240k. You had mentioned that you were looking to generate 1.4m in 2017 at the Launch Festival. Looking to understand the reason why especially since you had raised crowdfunding in 2017.\n2. Any reason you are looking to raise funds through Crowdfunding that Angels/ VCs who might be able to provide guidance, networks and partnerships on top of money invested that can help in scaling better.\n3. How much of your revenue comes outside from your top 3 clients?\n4. What is the current cash runway and burn rate?\n5. If you are able to raise the current round the same amount as the last raise, say ~500k, , how much runway are you expecting from the time of closing the raise.\n6. This is a market where I see the only barrier to entry being education of the client to trust that this marketing medium works. You have done some of that work in the past 3-4 years. Have you figured out a way by which someone else with a lot of funding or a media giant with a lot of existing partner networks can takeover the market you have built?\n7. You have put 20% spend towards product development / R&D. Would you be able to explain what are some of the activities that will contribute towards a spend here based on previous experience.\n8. Can you also share how much of the raise would be going under salary\n9. Have you done any dipstick that can help in your expansion outside the US?\n\nLook forward to hearing from you.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@kris-mohan\n-successful crowdfunding raise in 2017 helped us 3x earn revenue in 2018 w/ expanded reach - cash to float orders - team build - added networks and further client outreach (biz dev)\n-CF works for us and we appreciate community interest that helps legitimize our business and service model.\n-revenue outside of our top 3 clients is 80%+ of total as we have a lot of clients and revenue streams.\n-current burn about 10K - 15K\n-runway expected from the time of closing this raise about 18-24 months\n-we're first to market and generate revenue daily - as we expand CHRGR 2.0 we'll continue to earn w/ the current business via repeat clients - and those same clients who trust us will now support CHRGR 2.0 w/ a further means to acquire customers.\n-media giants you mention will be ideal partners and down the road exit strategy for us.\n-20% spend towards product development / R&D is for CHRGR 2.0 - building software and refining hardware prototypes we currently have\n-total raise under salary appox 20% - 25%.\n-expansion outside the US includes dialogue w/ the UK, Berlin, CDMX, Paris, Sao Paulo, and Dubai - more on that to come too",
               "replyList": null
            },
            {
               "commenter": "Krishna Mohan",
               "message": "@john-mullin Thanks for the answers. I read the basic description on the page for version 2.0 Would you be able to elaborate a bit more on that?\n\nI am going back to point 1 - any particular reason why the revenues dipped in 2017. And any step you have taken to avoid similar circumstances in the future.\n\nThanks for your time.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@kris-mohan thanks again and just to be clear our revenue did NOT dip in 2017 from 2016. we've earned every year (up) w/ 2018 almost 3x from 2017.\n\nCHRGR 2.0: Our goal is to create a DEEPER connection between brands and customers, by developing smart batteries that activate end users devices with engaging and free, custom content\nFor customers that prefer an “ad free” model we charge them\nCONNECTION + COMMUNITY = COMMERCE\n6 month strategy to on-premise deployment with CHRGR 2.0 battery that will automatically connect. brands to customers\nSupercapacitor upgrades will allow for 8 minute recharging.",
               "replyList": null
            },
            {
               "commenter": "Zachary McIlvoy",
               "message": "@john-mullin few follow-ups here:\n-what about the dip in numbers that Krishna noted above then? How do you explain that?\n-how would a customer pay for the charger if they didn't want the ads?\n-what research is there so far to show that super-capacitors are close to being effective and cheap enough for your use?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@zachary-mcilvoy as mentioned to Krisha there has been no dip in revenue numbers. Non Ad and B2C examples include our festival operations. Starting June 12th we'll be at the Bonnaroo Music Festival for our 4th year. We sell our CHRGR devices as a B2C exchange service. Pay $30 and buy a CHRGR unit - once depleted during the festival - return that unit and swap (exchange) for a freshly charged unit - rinse and repeat and ultimately leave the festival w/ a battery . Starting August 9th we'll do the same B2C play again at the Outsidelands Music Festival in San Francisco. Additionally you can also buy limited edition CHRGR units at the ACE Hotel in NYC and you can purchase the Mack Weldon Ion Weekender (overnight bag) that features our CHRGR as an accessory to the luggage (mackweldon.com/products/ion-weekender), besides that our business is B2B so the best place to get a CHRGR is via our brand partners when they distribute across venues, events, resorts, hotels and ride-shares. - as far as super capacitors we have our own factory resources to keep the costs efficient and cheap for evolving services.",
               "replyList": null
            },
            {
               "commenter": "Jeffery Ryan",
               "message": "@kris-mohan Revenues did NOT dip make sure to refer to these when looking at companies or before asking questions (just a tip) sec.gov/Archives/edgar/data/1702784/000170278419000003/xslC_X01/primary_doc.xml Also note that the gross margins have more than doubled over the previous year.",
               "replyList": null
            },
            {
               "commenter": "Krishna Mohan",
               "message": "@jeffery-ryan It will be good to read the statement properly before making a comment (just a tip) :) I have mentioned 2016 revenue to be 275k and 2017 revenue to be 240k. You can check the details at sec.gov/Archives/edgar/data/1702784/000170278418000002/formcarfiling.pdf .\n\nsec.gov/Archives/edgar/data/1702784/000170278419000003/xslC_X01/primary_doc.xml shows details for 2018 and 2017 revenues which I am not disputing. Please refer to my statement at the beginning of the thread.\n\nMaybe I am missing something here but I have moved on to other interesting opportunities.",
               "replyList": null
            },
            {
               "commenter": "Jeffery Ryan",
               "message": "@kris-mohan Touche my friend. Best of luck to the other opportunities.",
               "replyList": null
            },
            {
               "commenter": "PETER JUNOT",
               "message": "ChargeItSpot 4.8 Million revenue in 2018. How are you planning to compete with them?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@peter-junot our business is very different. thanks for your question.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@peter-junot thanks again peter - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Michelle Edwards",
         "message": "Is it possible for CHRGR to have malware added that will compromise users privacy?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@michelle-edwards no we don't have malware",
               "replyList": null
            },
            {
               "commenter": "Zachary McIlvoy",
               "message": "@john-mullin I think it's assumed you don't intent to have malware. Could you please address the concern that your devices (en mass, or individually) could get compromised and pose a risk to your customers?",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@zachary-mcilvoy we currently use SMS and QR for customer acquisition. Malware would require software - and we don't use front end - customer facing software currently for our advertising services.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@michelle-edwards thanks again michelle - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@zachary-mcilvoy thanks again zachary - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Mohammad ElAssi",
         "message": "Hi! What is the difference between CHRGR and power bank except the advertising.",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@mohammad-almeer the primary CHRGR service is our customer acquisition model through via our network as we partner w/ ride services, resorts, venues, and hospitality nationally.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@mohammad-almeer thanks again mohammad - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Lina Sa",
         "message": "What kind of user information do you track? And does using CHRGR increase vulnerability to cyber attacks/access to users' confidential data?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@lina-sa thanks and customers only self acquire at this time via QR and SMS - and as these are common and safe systems - there are no cyber security issues",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@lina-sa thanks again lina- hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Syed Usama Zia",
         "message": "Any plans relating expanding the business to other countries?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@syed-usama-zia yes absolutely and initially looking at Brasil, CDMX, Germany and the UK",
               "replyList": null
            },
            {
               "commenter": "Mohammad ElAssi",
               "message": "Do you need any body in GCC middleast,.@john-mullin",
               "replyList": null
            },
            {
               "commenter": "Stanislav Nikolaev",
               "message": "Are you considering the possibility of expansion to other countries through the franchise?If so, it will be very interesting to represent any brands not limited to the United States.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@syed-usama-zia thanks again syed - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@stanislav-nikolaev thanks again stanislav - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "nataraj sindam",
         "message": "Great Idea and good execution!\n\nSome questions:\n1. How much capital is raised already?\n2. How much does it cost to produce one charger currently?\n3. Who is responsible for sending the used charger back? What if the customer takes the charger home?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@nataraj-sindam $543K raised thus far, our COG is low and we always earn margin between 50% and 70% depending on client order quantity and timing. the whole point of our model is that customers DO take the CHRGR home. our service is a one way street w/ putting \"brands in the hands\" of new potential customers via our distribution networks.",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@nataraj-sindam thanks again nataraj - hope those answers helped and we're now ready to see an investment of $100 or more from you - it's time for you to join us!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Kenneth Brock",
         "message": "Who are your major competitors, and what are the key differentiating aspects of your business model and/or product that distinguish you from others?\n\nThanks!",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@kenneth-brock no one doing it out there like us - everyone else supporting rental model only (via customer payment) - we're the only successful and sustainable ad driven model - again the primary CHRGR service is our customer acquisition model through via our network as we partner w/ ride services, resorts, venues, and hospitality nationally.",
               "replyList": null
            },
            {
               "commenter": "Kenneth Brock",
               "message": "@john-mullin thanks John. Helpful. It’s a simple and great idea. Two other questions I had included:\n\n1) To the extent that you can, how are you using proprietary technology/intellectual property to further get ahead of competing business models?\n\n2) I didn’t see total addressable market distinctly mentioned unless I missed it. But what is your estimated TAM and the rationale for said estimate?",
               "replyList": null
            },
            {
               "commenter": "Kenneth Brock",
               "message": "*to the extent that you can discuss",
               "replyList": null
            },
            {
               "commenter": "John Mullin",
               "message": "@kenneth-brock 1) using proprietary technology/intellectual property for NFC and RFID enabled units. also building a SaaS platform next.\n\nTAM is 5B+ mobile devices in need of a charge.",
               "replyList": null
            },
            {
               "commenter": "Zachary McIlvoy",
               "message": "@john-mullin could you expand upon the TAM? More interested in how many batteries are purchased currently, rented, etc. How many mobile devices in the world doesn't feel accurate for your model.",
               "replyList": null
            },
            {
               "commenter": "Kenneth Brock",
               "message": "@zachary-mcilvoy +1",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "Any plans for a solar charger, qi or larger battery?",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@baron-huntington we do make all (3) types already",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Dohan Ventures Corp.",
         "message": "Great initiative! Although your website URL doesn't show here, I located it and it's a great thing that you have the CHRGR.COM domain for your brand! Not a bad thing to show! - Jeremy",
         "replyList": [
            {
               "commenter": "John Mullin",
               "message": "@dohan-ventures-corp thanks jeremy and we'll add some more links",
               "replyList": null
            }
         ]
      }
   ],
   "updates": [
      {
         "title": "Exciting News from CHRGR & NEW Milestones",
         "description": "Thanks to everyone who supported us thus far and check out these CHRGR updates!\nWe know that many of you were disappointed to see that CHRGR's raise filled up so quickly. We’re excited to announce that CHRGR is now undergoing an audit, which when complete will allow us to raise the cap on our Republic campaign to $1.07M! Keep an eye on your inbox in the next 2+ weeks for news on that front!\nUnreal continued support from Neil Patel and his fantastic organization, Angels and Entrepreneurs. https://angelsandentrepreneurs.com/deals/\nAccepted into the New Chip Seed Accelerator Program, a 12-week curriculum that helps entrepreneurs succeed.\nBehind the scenes, CHRGR continues to prototype new devices for faster and more efficient charging.\nCHRGR's raise paused when it hit its maximum fundraising goal on July 25th. Since then, CHRGR did what it does best - provide sponsored batteries to thousands of people - at several large events, including the Outside Lands music festival two weeks ago, which was CHRGR's most successful festival activation ever.\nThis month, CHRGR executed projects with clients including Nike, Horizon Bank, Audi, and many others.\nTHANKS A MILLION! and follow and tag us @CHRGR_CO @CHRGRFESTIVAL",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "CHRGR Updates This Week & Milestones",
         "description": "Thanks to everyone who supported us thus far and check out these CHRGR updates!\n1148% of minimum now raised on Republic - THANK YOU!\nUnreal support from Neil Patel and his fantastic organization angels and entrepreneurs. https://angelsandentrepreneurs.com/deals/\nFollow us on Instagram to see our satisfied customers and ongoing social strategy @CHRGRFestival\nSocial strategy kick off this week for Outsidelands Festival  2019  |  August 9th - 11th\nNew festival added to our roster. Life Is Beautiful Festival 2019  |  September 20th - 23rd\nNew projects executing this week w/ Nike,  MKTG, Mandarin Oriental Hotel Group, Thrive Farming.\nPrototyping for new CHRGR devices continue as we evolve our hardware and technology\nCHRGR appearance on Bold TV August 2. Bold TV is a digital news network committed to bipartisan dialogue & innovation for people, business, & communities. Bold TV airs live Friday mornings 10-11 a.m. ET. Bold TV is produced in partnerships with Al Roker Entertainment.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 400% 😱",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Increasing Our Minimum Investment Amount",
         "description": "Thank you to everyone who has been a part of this journey! Since we've already oversubscribed and raised $53K thus far, we want to keep the momentum going even stronger and faster! That's why we're raising our minimum to $100 so that now you too can be a part of a company that's changing the game with our unique service that powers brands and customers all over the world! \nIf you haven't already, please consider investing in CHRGR - the first utility driven advertising network! \nAnd follow CHRGR Festival on Instagram, DM us for a special gift and stay tuned for more updates + exciting announcements on our campaign page soon!",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 200% 🔥",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "CHRGR Updates This Week & Milestones",
         "description": "Thanks to everyone who supported us thus far and check out these CHRGR updates!\n160% of minimum now raised on Republic - THANK YOU!\nThis past weekend at Bonnaroo 2019 - our most successful festival activation yet! - had 2x more revenue than 2018. Our new software debut connected us w/ customers via mobile login as we supported thousands of festival attendees this year w/ our B2C charging service. Partnership w/ Live Nation, C3, Superfly and AC Entertainment. \nFollow us on Instagram to see our happy customers and social strategy @CHRGRFestival\nNew projects executing this week w/ Cannes Lions,  Horizon Bank, CAA, Audi\nSocial strategy kick off this week for Outsidelands Festival  2019  |  August 9th - 11th\nPrototyping for new CHRGR devices continue as we evolve our hardware and technology\nCHRGR product placement with our network distribution partner Cargo (over 20,000 Uber rides and counting) and as featured product on the Fuse TV Production T-Pain's School of Business",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 100% 💥",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 90% 🏁",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "CHRGR Updates This Week & Milestones",
         "description": "Thanks to everyone who supported us thus far and check out these CHRGR updates!\nBonnaroo 2019 begins June 12 and we'll debut new software this year for our B2C charging services that provides valuable customer data in addition to boosting revenue at the largest US festival of the year!\nNew projects this week w/ Instagram (Facebook), CAA, CBS Interactive, Blade Helicopters, Mandarin Oriental Hotel Group, AARP, DAZN Streaming, Analog Devices, MKTG Media, Bai Beverages (DPSG)\nCHRGR product placement with our network distribution partner Cargo (over 20,000 Uber rides and counting) and as featured product on the Fuse TV Production T-Pain's School of Business\n58% of Republic minimum raised - THANK YOU!",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 50% 🍹",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 30% 🎂",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Launched on Republic 🚀",
         "description": null,
         "comments": null,
         "updateDate": null
      }
   ],
   "reviews": [
      {
         "commenter": "Arwed Kubisch",
         "message": "Since the beginning of humanity, there has been a drive and pursuit of more and more energy. Earlier than as firewood and coal, today more than ever as electricity. CHRGR - An amazing idea, implementation + advertising - for an important human need. $55",
         "replyList": null
      },
      {
         "commenter": "Kenneth Brock",
         "message": "The intersection between hardware innovation, digital innovation, and advertising placement has become increasingly important in this day and age, in what’s already a saturated field. Sometimes the simplest ideas succeed, and CHRGR has a good one. $300",
         "replyList": null
      },
      {
         "commenter": "Akash Sureka",
         "message": "Very Innovative Advertisement and Customer Acquisition Solution for Brands, for very common battery power requirements by end consumers!! Loved it. $150",
         "replyList": null
      },
      {
         "commenter": "Stanislav Nikolaev",
         "message": "Huge amounts of money are spent on advertising campaigns. This team makes the content more accessible + helps us to get rid of a headache. $50",
         "replyList": null
      },
      {
         "commenter": "Nicolas Arguello",
         "message": "I think this is a great idea for public events. My phone keeps running out of battery at the important events I attend and I'm pretty sure I'm not the only one with this problem. A simple solution that people can enjoy. $50",
         "replyList": null
      },
      {
         "commenter": "Anthony Diaz",
         "message": "The product sounds like something we all need from time to time. It solves a problem. The product is free to the consumer, everyone loves free stuff they can use. This translates to brand recognition for possibly both parties. Win win win. Thumbs up! $100",
         "replyList": null
      },
      {
         "commenter": "Victoria Filipowski",
         "message": "I just think it sounds like a really cool way to advertise on a product that is actually useful & won't just get chucked in the trash like so many other freebies. $100",
         "replyList": null
      },
      {
         "commenter": "Urvesh Devani",
         "message": "1. Innovative business model: utility-driven advertisement, where advertisements can be adhesive. 2. Better conversion rates for client brands 3. Strong distribution network $500",
         "replyList": null
      },
      {
         "commenter": "Patti Biondi",
         "message": "Technology is always going to be upgraded and needed commodity in our World and lives today - everything needs batteries and charging, etc. Good stable background on Company and Neil Patel recommended it. $100",
         "replyList": null
      },
      {
         "commenter": "R. Ali Tirmizi",
         "message": "I invested because there is a huge need for a company like Charger to succeed as Battery life is very short lived and one is constantly charging to review important messages via Iphone and other devices. $750",
         "replyList": null
      },
      {
         "commenter": "Isjoel Picon",
         "message": "CHRGR is doing an amazing job solving a big problem in a revolutionary way. I believe it will be disrupting the industry in the near future and delivering great returns for its investors. $100",
         "replyList": null
      },
      {
         "commenter": "Bridget Schlattner",
         "message": "I love their product. My phone died more than once when on the go and having a battery to charge it is priceless with the advertising of major companies. I think this product will be a staple for every cellphone user. $100",
         "replyList": null
      },
      {
         "commenter": "Marc Rosamilia",
         "message": "I believe that their idea will benefit the masses. I think their technology and influential partnerships will help this company continue to grow. $100",
         "replyList": null
      },
      {
         "commenter": "Edward Roop",
         "message": "I invested because I see the need for this service. My wife and I heavily depend on our phones. I use my phone to monitor/manage my blood sugar transmitted from my Dexcom G6 continuous glucose monitor. $100",
         "replyList": null
      },
      {
         "commenter": "John Stinson",
         "message": "this product has so many potential profit points and is so universally needed by consumers that with enough capital to expand as a first entry provider the USA the market is gigantic... $200",
         "replyList": null
      },
      {
         "commenter": "Larry Walker",
         "message": "I invested because I believe there is a need for mobile chargers so that consumers are able to charge their devices on demand wherever they may be. Also, I like the idea of it not taking a long period of time to recharge. $100",
         "replyList": null
      },
      {
         "commenter": "Doug Wenner",
         "message": "I invested because CHRGR is a great product that will change the way phones and other devices can be charged at lightning speed and may also provide advertisement in local geographical areas. $100",
         "replyList": null
      },
      {
         "commenter": "Alexander Bannister",
         "message": "I invested because this company has the potential to change the world of dying batteries as we know it. I love investing in people that I believe are working to make a difference! $150",
         "replyList": null
      },
      {
         "commenter": "Isaiah Robinson Jr.",
         "message": "Lol my phone died I need a charger portable super fast on the go CHRGR great for road trips and family get togethers also CHRGR is a need in society today more people are suffering from slow chargers.Yes CHRGR will expands during special events,Jobs $110",
         "replyList": null
      },
      {
         "commenter": "John McEwan",
         "message": "This is a product that will be very well received, so often my phone dies when I'm out and receiving a free battery charger from a sponsor is a real win-win $500",
         "replyList": null
      },
      {
         "commenter": "John Hunter",
         "message": "I invested in CHRGR because I believe in their product and marketing strategy. Given the founders' backgrounds, I am confident in their ability to execute. $500",
         "replyList": null
      },
      {
         "commenter": "Ned Zoller",
         "message": "I own a phone what's the battery constantly goes out and I believe the advertising on the charger will bring a lot of people in I also do Uber and Lyft and I believe if you can saturate that market that would really help $100",
         "replyList": null
      },
      {
         "commenter": "Joel Watts",
         "message": "I invested because of the continued growing usage of cell phones around the globe. Individuals are on their phones more and more these days and this product will be of great value in areas where charging capabilities may be limited. $100",
         "replyList": null
      },
      {
         "commenter": "cameron brown",
         "message": "I chose to invest in CHRGR because this is an innovative idea there's nothing or no one else doing this, this is going to be big and i want to be on the ground floor. $100",
         "replyList": null
      },
      {
         "commenter": "Jeff Wasco",
         "message": "In today's world, my 2 teenagers and their friends are always looking to recharge their phones. Great idea, solves a huge problem, and we see people wired up to outlets from airports to homes and cars. Go get em CHRGR!!! $200",
         "replyList": null
      },
      {
         "commenter": "Vicki Zenier",
         "message": "Every time I go to a concert, it never fails, my battery dies! I don’t take a lot of pictures or videos at concerts, but of course that ONE perfect moment happens and my phone is dead. This would be ideal in so many situations! $100",
         "replyList": null
      },
      {
         "commenter": "Aaron Young",
         "message": "Batteries have a huge impact on this world. There's a lot of potential for growth with is company. Major brands are already dealing with CHRGR which means they can grow considerably and maintain growth. $100",
         "replyList": null
      },
      {
         "commenter": "ANDRES OSPINA",
         "message": "I truly believe that this product has potential and will help the community and those who invented the product. This is a win/win and I support it. Let's move forward and continue winning and helping! $200",
         "replyList": null
      },
      {
         "commenter": "Linda Walker",
         "message": "I believe this is a good product and there is a market for this product. We/I am always forgetting my charger and this is a perfect solution! $100",
         "replyList": null
      },
      {
         "commenter": "Kyle Tomkalski",
         "message": "I have done a lot of research on CHRGR. First, the founder is proven and has been associated with some well known companies. I also like the idea. Personally, my phone's battery dies all the time, and I am always looking for somewhere to plug it in. $100",
         "replyList": null
      },
      {
         "commenter": "Jeremy Schacht",
         "message": "I invested in this because I had this idea for years about kiosk that people can charge there phone at a low charge in public formats but didn’t know how to go about turning my ideas into reality and I did not have the funding so good luck $100",
         "replyList": null
      },
      {
         "commenter": "Mike Le Blanc",
         "message": "I invested because I have a phone that dies and needs to be charged. If I can't locate a charging location, I have a CHRGR with me at all times and I am never left with a dead device. Everyone has a mobile device that needs to be charged so CHRGR it. $525",
         "replyList": null
      },
      {
         "commenter": "CJ Sunshine Howard",
         "message": "We all have mobile devices and struggle with the batteries running dead. I think it's a great idea looking forward to seeing what your company will do. $500",
         "replyList": null
      },
      {
         "commenter": "Cynthia McCloud",
         "message": "I invested in CHRGR because of the vision, the team and the strong branding. I am hopeful for continued flexibility towards increased efforts focused on the innovative technology, while maintaining relations with the accounts already acquired. $125",
         "replyList": null
      },
      {
         "commenter": "Bryan Cook",
         "message": "I believe in this product and the direction the company is headed for! Work hard everyone and stay after it, good luck! My family and I are all in, we support ya $1,000",
         "replyList": null
      },
      {
         "commenter": "Yvette Guillory",
         "message": "I invested $100 because I've done some research & I like the path that you seem to be taking. I do feel that the company should focus on the battery technology. I would invest more if I could because I believe that the company will be a success. $100",
         "replyList": null
      },
      {
         "commenter": "Francisco Cruz",
         "message": "NFL Analytics show that if its 4th down & you're on your own 1-yard line, U should go for it. Odds are if U punt the ball the receiving team will get the ball back inside the 50-yard line--can lead to @least 3 points via a FG. So why not go for it. $100",
         "replyList": null
      },
      {
         "commenter": "Bryce Cain",
         "message": "Seems like a very promising company. Great work thus far! Have you considered potentially partnering with large colleges and universities? Universities are always handing out \"freebies\" to current and prospective students. Good luck! $100",
         "replyList": null
      },
      {
         "commenter": "Sara Bradstream",
         "message": "You are offering a much needed service, we all find ourselves in need of a charger and with as busy as life is a charger is easily forgotten. I am impressed by your company. $100",
         "replyList": null
      },
      {
         "commenter": "Jose Carlos Amaya",
         "message": "This is a simple equation - everyone who is a part of it, wins! I have been there - a situation where my phone or other devices ran out of power and I had to scrambled to look for a place to \"recharge.\" $100",
         "replyList": null
      },
      {
         "commenter": "Russ Clark",
         "message": "This service/product solves a major problem, one in which I struggle with daily during my profession. It not only solves a major problem for consumers but the quantity of consumers to be reached is almost everyone, leading to exponential demand. $1,000",
         "replyList": null
      },
      {
         "commenter": "Ruth Laudan",
         "message": "I invested because I have an I phone and find myself out with a low battery too often. I am anxious to see these cards show up in Texas, and am interested in being able to purchase them, if I can't find them through a vendor. I have invested $100. $100",
         "replyList": null
      },
      {
         "commenter": "RICHARD HALPRIN",
         "message": "I believe people will require portable chargers as they continue to use more and more portable devices. Either by recharging or longer battery life. $350",
         "replyList": null
      },
      {
         "commenter": "jorge parra",
         "message": "It is appears that has a big potential to be a successful company . Since I cannot predict the future I am putting only $ 200 as a initial investment. $200",
         "replyList": null
      },
      {
         "commenter": "Jerry Chao",
         "message": "Battery related technology will push us forward with more and more products that relies on battery to operate it is crucial that we keep innovating. $200",
         "replyList": null
      },
      {
         "commenter": "Michael Williamson",
         "message": "I believe the CHRGR system will provide a very needed service to many now as more and more of the population are singularly using only a smartphone device for many of their internet needs. $50",
         "replyList": null
      },
      {
         "commenter": "Theresa Hurtado",
         "message": "I invested because I believe this company is able to meet a real demand. Not only that, but it's a creative way to advertise, and I like the energy that has been brought to this effort so far. Best of luck! Amount is private",
         "replyList": null
      },
      {
         "commenter": "Dohan Ventures Corp.",
         "message": "A clever solution to a far too common problem, and the best solution to date. $500",
         "replyList": null
      },
      {
         "commenter": "Louis Mannarino",
         "message": "Innovation is the key in our times. $50",
         "replyList": null
      },
      {
         "commenter": "David Galway",
         "message": "It helps people whilst getting the brand across $70",
         "replyList": null
      },
      {
         "commenter": "Mario Johnson",
         "message": "I have a previous investment with them from their Seedinvest campaign. $200",
         "replyList": null
      },
      {
         "commenter": "Robert Morris",
         "message": "To build wealth.. $50",
         "replyList": null
      },
      {
         "commenter": "Nathan Montez",
         "message": "Because I saw what the company is trying to do and trying to help others and I would love to be part of that. $50",
         "replyList": null
      },
      {
         "commenter": "Mana Waqatairewa",
         "message": "I invested because i feel the younger generations are so attached to devices that this will be a need, sad but true $60",
         "replyList": null
      },
      {
         "commenter": "Kim Thomas",
         "message": "This is indeed THE give away for today's mobile generation! Why not charge your sales while your prospects charge their device! $250",
         "replyList": null
      },
      {
         "commenter": "Benjamin Doe",
         "message": "Because I love the concept of a portable charger to have at your disposable at any social media event space $50",
         "replyList": null
      },
      {
         "commenter": "Benjamin Letsu",
         "message": "Hate when my phone is running low when using it as GPS when I don't know where am i. $100",
         "replyList": null
      },
      {
         "commenter": "Zarylbek Tilebaldiev",
         "message": "The new technology is our future $100",
         "replyList": null
      },
      {
         "commenter": "Josh Thill",
         "message": "Love the idea. I think it’s great marriage of need and opportunity $150",
         "replyList": null
      },
      {
         "commenter": "Jordan Givens",
         "message": "It’s a good investment. $200",
         "replyList": null
      },
      {
         "commenter": "Kirkpatrick Ellison",
         "message": "I could really see this tanking off $200",
         "replyList": null
      },
      {
         "commenter": "Pradeep Mishra",
         "message": "I liked the novelty in the idea of reaching out to customers. This idea will succeed. $100",
         "replyList": null
      },
      {
         "commenter": "Dorian Russell",
         "message": "It was a recommended purchase by other Angel Investors and looks like an exciting new adventure! $150",
         "replyList": null
      },
      {
         "commenter": "Loren Roseth",
         "message": "Great idea and a very good team. You will go far I`m sure! Great margins and YOY growth. To much continued success! Loren R. $500",
         "replyList": null
      },
      {
         "commenter": "Jesus Carrillo",
         "message": "I feel that they are solving a issue that has been around for a while and no one has to leave Pakistani I hope that they succeed $100",
         "replyList": null
      },
      {
         "commenter": "Tavaris Williams",
         "message": "I believe in this company business model and also believe that many innovative creative ideas can be born out of CHRGR. $100",
         "replyList": null
      },
      {
         "commenter": "Kurt Renz",
         "message": "I believe in your business goals and prospective market $1,000",
         "replyList": null
      },
      {
         "commenter": "Bolanle Ige",
         "message": "I invested because we are at the cusp of Electric Vehicle technology in which mobile battery chargers would be inevitable. $100",
         "replyList": null
      },
      {
         "commenter": "Edward Stosal",
         "message": "I have a great feeling this will be big, and is something needed. Plus beginners luck sometimes ;) $100",
         "replyList": null
      },
      {
         "commenter": "carol pang",
         "message": "I invested because I want to get involved in an ICO and this one looks promising. $250",
         "replyList": null
      },
      {
         "commenter": "Kenneth Peden",
         "message": "I believe the company will succeed $100",
         "replyList": null
      },
      {
         "commenter": "Tavon Jones",
         "message": "I believe that this is the future of batteries. $100",
         "replyList": null
      },
      {
         "commenter": "William Wise",
         "message": "I invested because the cellphone has become our most important tool . $100",
         "replyList": null
      },
      {
         "commenter": "Patrick Carroll",
         "message": "It’s free battery is a good deal. It’s something I could use $300",
         "replyList": null
      },
      {
         "commenter": "Kevin Whalen",
         "message": "I believe that this company has legs knowing the use of cell phones in every ones lives $100",
         "replyList": null
      },
      {
         "commenter": "Mamadou Sow",
         "message": "$200.00 For my FAMILY. $200",
         "replyList": null
      },
      {
         "commenter": "Robert Marshall",
         "message": "Impressive history of growth $500",
         "replyList": null
      },
      {
         "commenter": "Tommy Bowdre",
         "message": "Great service idea, solid revenue, big brand relationships, experienced leadership. $500",
         "replyList": null
      },
      {
         "commenter": "Gary French",
         "message": "Can relate to problem they are committed to solve $100",
         "replyList": null
      },
      {
         "commenter": "Ibrahim Alqasim",
         "message": "I believe that there will be a higher demand for energy sources for individual consumers with the expand of the digitization $400",
         "replyList": null
      },
      {
         "commenter": "Bernard Golden",
         "message": "Having done research, I believe in the entrepreneurs, their product and the broad appeal of the product. I invested $200. $200",
         "replyList": null
      },
      {
         "commenter": "shahriar farah",
         "message": "I believe CHRGR has the potential to be a key player in new age advertising market. $100",
         "replyList": null
      },
      {
         "commenter": "Kenneth McMilleon",
         "message": "I have used similar technology at a casino venue and was a life saver. $200",
         "replyList": null
      },
      {
         "commenter": "Clarence Grout",
         "message": "Because I think it's a growing company if they invest in battery life. $100",
         "replyList": null
      },
      {
         "commenter": "Jimmy Grover",
         "message": "CHRGR is doing great things, and is solving a big problem that people have needing to power their devices $100",
         "replyList": null
      },
      {
         "commenter": "Jane Liller",
         "message": "There are so many uses for this product. And, the future should only bring more opportunities for growth and profits. $100",
         "replyList": null
      },
      {
         "commenter": "Yvan Muldrow",
         "message": "I invested into this product because I believe it will do great and it meets every customer needs $200",
         "replyList": null
      },
      {
         "commenter": "Leejohn Holmes",
         "message": "Better quick charge ability $100",
         "replyList": null
      },
      {
         "commenter": "michelle mcgibbon",
         "message": "We all need this item. $500",
         "replyList": null
      },
      {
         "commenter": "Denise McDonough",
         "message": "Great idea!! Make it work! I believe in you! $200",
         "replyList": null
      },
      {
         "commenter": "Lisa Dodson",
         "message": "Its a consumer product that brings value and with the growing number of wireless devices, I think that it will succeed. $100",
         "replyList": null
      },
      {
         "commenter": "Eliyahu Ben-Tsadoq",
         "message": "I think this could help other startups, and as such, help our economy. $200",
         "replyList": null
      },
      {
         "commenter": "Dawn Bostick",
         "message": "I am new to this but thought this was an excellent investment for me to take a chance on. $150",
         "replyList": null
      },
      {
         "commenter": "Donald Holsapple",
         "message": "I see great promise in this company. The demand for the product is high and has widespread application. $250",
         "replyList": null
      },
      {
         "commenter": "Maureen Lint",
         "message": "I feel this is something that we all need from time to time as for the younger people they need it all the time I invested $100",
         "replyList": null
      },
      {
         "commenter": "Dhanraj P Mangru",
         "message": "I believe Charger has tremendous potential to make life easier for smartphone users. $100",
         "replyList": null
      },
      {
         "commenter": "Rick Faler",
         "message": "I believe CHRGER is on the right track to improving not only cell phone batteries but in other areas involving batteries $200",
         "replyList": null
      },
      {
         "commenter": "Russell Grady",
         "message": "I believe this company will go global and that batteries are the next big thing along with solar, water and wind power $100",
         "replyList": null
      },
      {
         "commenter": "nicole woodrum",
         "message": "I can see myself using this and many I know, it solves a problem I see everyday. $100",
         "replyList": null
      },
      {
         "commenter": "Erwin Lazaro",
         "message": "Battery tech is the wave of the future! CHRGR is upping the standards for all who use technology. It's that simple. $500",
         "replyList": null
      },
      {
         "commenter": "Dan Miller",
         "message": "Excited to see what comes. $200",
         "replyList": null
      },
      {
         "commenter": "Anderson Alahre",
         "message": "Charging is a necessity and the more companies that have access the easier it will be to retain customers $100",
         "replyList": null
      },
      {
         "commenter": "Susan Williams",
         "message": "I like the continuous growth of the company. I think they have a much needed product and believe they will do very well. $100",
         "replyList": null
      },
      {
         "commenter": "Thomas Hughes",
         "message": "I like the concept and the business model. Their success in raising capital was also a factor. $200",
         "replyList": null
      },
      {
         "commenter": "Michael Yarbrough",
         "message": "It looks like something I would use if I lived in that area $100",
         "replyList": null
      },
      {
         "commenter": "kenneth fermil",
         "message": "after research and education , I think this will explode in the US. I want to be a part of that! $100",
         "replyList": null
      },
      {
         "commenter": "Cals Carports",
         "message": "I see great potential. $100",
         "replyList": null
      },
      {
         "commenter": "Jeff Kanov",
         "message": "Sounds to me like an interesting space to invest and can see possible large income potential $500",
         "replyList": null
      },
      {
         "commenter": "Edward English",
         "message": "Recommended by Neil Patel $100",
         "replyList": null
      },
      {
         "commenter": "Robert Bandfield",
         "message": "I believe this company's business model will catch on in big cities all over the world and address a solution to an ever increasing problem. $150",
         "replyList": null
      },
      {
         "commenter": "Anthony Akeman",
         "message": "I like the idea of the company and I like the potential it has. $100",
         "replyList": null
      },
      {
         "commenter": "Kevin Knopik",
         "message": "I invested because they are filling a gap that has been unaddressed to this point $100",
         "replyList": null
      },
      {
         "commenter": "Bruce Johann",
         "message": "I think that this is a great concept and would love to see it take off $200",
         "replyList": null
      },
      {
         "commenter": "Mudit Jain",
         "message": "I think this is a good business idea and I would like to see some returns for sure. $100",
         "replyList": null
      },
      {
         "commenter": "Jami Hutchins",
         "message": "Think it is a great idea. Everywhere you look somebody is charging a phone. $100",
         "replyList": null
      },
      {
         "commenter": "marc smith",
         "message": "I have had the same issues with my smart phone no power ... $100",
         "replyList": null
      },
      {
         "commenter": "Emanuel Culbertson",
         "message": "I like what they’re doing $100",
         "replyList": null
      },
      {
         "commenter": "Sarwar Kazi",
         "message": "My Grand Daughter $100",
         "replyList": null
      },
      {
         "commenter": "Kristine Halida",
         "message": "I invested $ 100.00 I have never done this before $100.00 is a lot of money to me. I joined the Angels & Entrepreneur. I hope this works. $100",
         "replyList": null
      },
      {
         "commenter": "Anthony Newbill",
         "message": "The repeat business from fortune 500 companies means something ! $500",
         "replyList": null
      },
      {
         "commenter": "Samer Alsourani",
         "message": "Like how ubiquitous the solution it provides. $500",
         "replyList": null
      },
      {
         "commenter": "Spencer Jones",
         "message": "I was attracted to their quick success, repeat clients and the technology behind the battery. Very exciting! $500",
         "replyList": null
      },
      {
         "commenter": "Dr Martin Zizi",
         "message": "I like the idea and I'm still investigating and may invest more.I like the plan and the vision $500",
         "replyList": null
      },
      {
         "commenter": "Eric Wood",
         "message": "I need to invest in my future $100",
         "replyList": null
      },
      {
         "commenter": "Judy Derr",
         "message": "Make money $100",
         "replyList": null
      },
      {
         "commenter": "Carl Maietto",
         "message": "Product is a Winner. $500",
         "replyList": null
      },
      {
         "commenter": "Barbara Giannantonio",
         "message": "I invested because I feel this company has potential and resources to make it grow. $100",
         "replyList": null
      },
      {
         "commenter": "Albert Roderiguez",
         "message": "I see a incresed need for this technoligy $200",
         "replyList": null
      },
      {
         "commenter": "Valerie Lyons",
         "message": "My phone is always dying and it's frustrating. Hoping this is the next best solution to a BIG problem. $250",
         "replyList": null
      },
      {
         "commenter": "Rob Andrews",
         "message": "I feel confidence in the business model and there's the potential for additional income streams. $250",
         "replyList": null
      },
      {
         "commenter": "Elizabeth Waite",
         "message": "I feel this company provides a necessary product in a fun unique way $100",
         "replyList": null
      },
      {
         "commenter": "Robert A. Vento, Sr.",
         "message": "I believe this is a smart company that solves a problem worldwide. It's the right formula for me to invest a little. $100",
         "replyList": null
      },
      {
         "commenter": "Derek Talley",
         "message": "I hate a dying phone $100",
         "replyList": null
      },
      {
         "commenter": "James Taff",
         "message": "CHRGR has a solid business model solving a problem experienced by nearly everyone. $200",
         "replyList": null
      },
      {
         "commenter": "Kiran Shah",
         "message": "I'm interested in startups and like your project - $100 $100",
         "replyList": null
      },
      {
         "commenter": "Sareeta Shah",
         "message": "I'm really impressed by your project - $100 $100",
         "replyList": null
      },
      {
         "commenter": "Kinar Shah",
         "message": "Really interested in your startup project - $100 $100",
         "replyList": null
      },
      {
         "commenter": "Jeff Klein",
         "message": "Great ideas and innovation is how this world becomes better. CHRGR will help change the way things are done....for the better! $2,200",
         "replyList": null
      },
      {
         "commenter": "Jarratt Walker",
         "message": "I feel the phone charging battery business has no where to go but up and up. $100",
         "replyList": null
      },
      {
         "commenter": "Diantha Weber",
         "message": "CHRGR has done well thus far and based on company data, I view this as a good investment. $100",
         "replyList": null
      },
      {
         "commenter": "Paul Jackson",
         "message": "Company is doing well and is getting better. $100",
         "replyList": null
      },
      {
         "commenter": "Darlett Lucy-Gulley",
         "message": "I believe that this company can and will do well. $100",
         "replyList": null
      },
      {
         "commenter": "Wendy Palmer",
         "message": "Angels and Enterpreneurs website $100",
         "replyList": null
      },
      {
         "commenter": "Frank Latko",
         "message": "I believe having battery chargers accessible wherever you go is a fantastic idea. $100",
         "replyList": null
      },
      {
         "commenter": "Dustin Patterson",
         "message": "To raise my standards $200",
         "replyList": null
      },
      {
         "commenter": "Mojgan Skelton",
         "message": "I believe in the company and the product it’s offering. $100",
         "replyList": null
      },
      {
         "commenter": "Donivan Sampson",
         "message": "I think the company's business plan is sound and has gr8 potential to become a successful giant. $100",
         "replyList": null
      },
      {
         "commenter": "BRADLEY JOHNSON",
         "message": "We are looking to provide for the next generation through promising new and innovative start ups! $1,000",
         "replyList": null
      },
      {
         "commenter": "Randall McCurdy",
         "message": "This is something a big dog will buy some day. $500",
         "replyList": null
      },
      {
         "commenter": "Mason Mannning",
         "message": "I think it’s got an idea that just makes sense in the world we live in. So I am excited to see where the journey goes! $100",
         "replyList": null
      },
      {
         "commenter": "Joe Garcia",
         "message": "I have invested in CHRGR because people have been wanting a phone that will stay charged though out the day. $250",
         "replyList": null
      },
      {
         "commenter": "Deirdre Morgan",
         "message": "I believe this product is a brilliant idea. It's very much needed in our battery dependent social media world! $500",
         "replyList": null
      },
      {
         "commenter": "Elizabeth Gonzalez",
         "message": "I believe this company will be very successful. High demand in this business idea and a great problem solver $100",
         "replyList": null
      },
      {
         "commenter": "Clyde Wilcox",
         "message": "Neil Patel recommended you $200",
         "replyList": null
      },
      {
         "commenter": "Barbara Breedlove",
         "message": "I invested because I feel that is something that could be life-changing. I BELIEVE!!! $100",
         "replyList": null
      },
      {
         "commenter": "Peter Chrustowski",
         "message": "Sounds Promising $200",
         "replyList": null
      },
      {
         "commenter": "alicia brooks",
         "message": "IS A GOOD PRODUCT , BECAUSE MUST OF THE CONSUMERS IS NEEDED $100",
         "replyList": null
      },
      {
         "commenter": "Fobert Alexandre",
         "message": "For a better life $100",
         "replyList": null
      },
      {
         "commenter": "Bryan Amenta",
         "message": "Great product glad to support this startup. $200",
         "replyList": null
      },
      {
         "commenter": "Maria Davidson",
         "message": "Look like a great start up. $200",
         "replyList": null
      },
      {
         "commenter": "Kong James",
         "message": "There are many events the whole year. Many brands can sponsor the charger. It is a promotional product. And who doesn't want a charger. $500",
         "replyList": null
      },
      {
         "commenter": "Mike Stewart",
         "message": "This is a great idea and I know it will explode. And I'm looking to make some money in the future $100",
         "replyList": null
      },
      {
         "commenter": "Shirley Berard",
         "message": "I invested because I believe in this company. It's a great Idea, I know it's going to take off. $100",
         "replyList": null
      },
      {
         "commenter": "Maynard Wellman",
         "message": "Who doesn't need a phone or device charge at times? Great service paired with effective advertising. $100",
         "replyList": null
      },
      {
         "commenter": "Johnny Pedroza",
         "message": "I believe in innovation and progress and might as well ride the train. $500",
         "replyList": null
      },
      {
         "commenter": "Saud Alkwayleet",
         "message": "I believe in the leader of this startup $5,000",
         "replyList": null
      },
      {
         "commenter": "Joshua Kastner",
         "message": "I believe it will be quickly and widely accepted $100",
         "replyList": null
      },
      {
         "commenter": "murad nensey",
         "message": "Its the future $100",
         "replyList": null
      },
      {
         "commenter": "Samir Patel",
         "message": "Very unique personalized way to promote and advertise while helping end user to charge devices. $100",
         "replyList": null
      },
      {
         "commenter": "Larry Anderson",
         "message": "Everyone has a Phone, Tab-let's, Ear-Tab, they need to Charge Them. $100.00 $100",
         "replyList": null
      },
      {
         "commenter": "George Crown",
         "message": "The idea of this product is great as I use chargers for different devices all of the time. Rock on. $200",
         "replyList": null
      },
      {
         "commenter": "James Eastman",
         "message": "Everyone needs to charge items in the 21st Century. $120",
         "replyList": null
      },
      {
         "commenter": "Eric Reed",
         "message": "I invested because it is a great idea $100",
         "replyList": null
      },
      {
         "commenter": "mary edwards",
         "message": "I believe in this!! $100",
         "replyList": null
      },
      {
         "commenter": "Janna Valencia",
         "message": "I believe this idea is a great marketing tool and a fantastic aid for consumers $100",
         "replyList": null
      },
      {
         "commenter": "Guilherme Porto Alves",
         "message": "Because CHRGR os the future. $100",
         "replyList": null
      },
      {
         "commenter": "Carl Teston",
         "message": "Sounds like it fills a need. $100",
         "replyList": null
      },
      {
         "commenter": "Ross Rice",
         "message": "love the concept $150",
         "replyList": null
      },
      {
         "commenter": "Amy Johnson",
         "message": "I feel great things coming to CHRGR and want to involved! $100",
         "replyList": null
      },
      {
         "commenter": "Cynthia Luth",
         "message": "Looks promising. $200",
         "replyList": null
      },
      {
         "commenter": "Howard D Hartman",
         "message": "Reconfirming my investment. $500",
         "replyList": null
      },
      {
         "commenter": "Darko Radelja",
         "message": "Marketing plus creativity, very smart idea! $100",
         "replyList": null
      },
      {
         "commenter": "Joel Mendoza",
         "message": "I believe it’s a amazing idea and business plan. $100",
         "replyList": null
      },
      {
         "commenter": "Aydin Baltaci",
         "message": "Product has a chance to grow world wide. $100",
         "replyList": null
      },
      {
         "commenter": "Tamanna Patel",
         "message": "I have invested because it’s a good concept $500",
         "replyList": null
      },
      {
         "commenter": "steve berman",
         "message": "I believe in the company and I believe in its leadership $100",
         "replyList": null
      },
      {
         "commenter": "Santiago Santos",
         "message": "I belive the company has potential to grow big because of the demand they are supplying for need of charging phones on the go. $100",
         "replyList": null
      },
      {
         "commenter": "JULIAN SAENZ",
         "message": "I think your solid company.$100 $100",
         "replyList": null
      },
      {
         "commenter": "Milagros Nilo",
         "message": "I find CHRGR innovation, concept... interesting that encourages me to invest on. Kudo! $200",
         "replyList": null
      },
      {
         "commenter": "Bill Johnson",
         "message": "I believe your product has great potential to grow and expand in ways we can't see yet... and it will. $200",
         "replyList": null
      },
      {
         "commenter": "Perry Vincent",
         "message": "I see potential in this company to make a lot of money $100",
         "replyList": null
      },
      {
         "commenter": "Daniel Zimmerman",
         "message": "Great Idea and very use when out or Traveling $1,000",
         "replyList": null
      },
      {
         "commenter": "Brigitte Belton",
         "message": "Thought it was a good product. 100 at a time is how I am starting my angle investing $100",
         "replyList": null
      },
      {
         "commenter": "Sam Slay",
         "message": "Charging our devices will continue to be a concern and the more access to charging ability will help...not to mention the ability to market. $500",
         "replyList": null
      },
      {
         "commenter": "stephen stanfill",
         "message": "I see the potential for the technology to go big $100",
         "replyList": null
      },
      {
         "commenter": "Michael Heath",
         "message": "I invested because I believe in Chargers capability to supply the world with it's Technology $100",
         "replyList": null
      },
      {
         "commenter": "Ranjit Roy",
         "message": "I'm impressed with the potential utility it brings to the users. $1,000",
         "replyList": null
      },
      {
         "commenter": "Jim LaRock",
         "message": "I believe this company will be profitable $500",
         "replyList": null
      },
      {
         "commenter": "Oliver W. Perry",
         "message": "I invested in CHRGR because this company's business model serves a basic need everyone has: never having enough battery life for their phones, to do the things they enjoy without interruption. Fantastic! Oliver W. Perry $1,000",
         "replyList": null
      },
      {
         "commenter": "John Cooper",
         "message": "Excellent idea to use OPM to provide free charge to devices when and where needed most by those who use their devices most. Great expectations! $500",
         "replyList": null
      },
      {
         "commenter": "David Robinson",
         "message": "As someone who travels a lot and in many cases in need of a charge, having a more secure method versus the charging stations in airports is huge and an idea I can support. $50",
         "replyList": null
      },
      {
         "commenter": "Nick Shabanoff",
         "message": "I understand the product, its need and believe it will be used by most people that repeatedly have their phones running out of battery power day after day. Good Luck! $150",
         "replyList": null
      },
      {
         "commenter": "Chris Von Hoffmann",
         "message": "I believe this company has a creative solution to the problem of cell phones losing charge plus with millions of cell phones in the world could grow to be a large global player. $500",
         "replyList": null
      },
      {
         "commenter": "James Dundon",
         "message": "Everyone has a phone and none of them hold charge. Seems like a no brainer. I do believe there is already a product out that will charge by placing a phone on top of it. $200",
         "replyList": null
      },
      {
         "commenter": "Paul Ng Wai",
         "message": "1. Product-market fit: doubling sales while increasing profit margin 2. Ubiquitous cell and smart device usage in general. 3. Increasing need and desire for mobility 4. Global expansion potential 5. Unique innovation 6. Digital marketing footprint $100",
         "replyList": null
      },
      {
         "commenter": "Kelley Newman",
         "message": "If I understand the service correctly, this can meet a big need by allowing companies, restaurants, other platforms to offer their customers \"wireless\" chargers while eating dinner at their restaurant or while getting a Lyft ride, for example. $100",
         "replyList": null
      },
      {
         "commenter": "Elias D. Salazar",
         "message": "I invested into charger because, I believe \"CHRGR\" is a technology and innovation that will not only fix dying batteries in cell phones but, in other battery operating devices as well. That's a billion dollar industry! $100",
         "replyList": null
      },
      {
         "commenter": "Charlotte Railey",
         "message": "I invested because I feel as the batteries will help solve alot of problems. It's always good to have a fulled charged spare for different reasons. I have invested $100.00 at this time. I'm hoping to be able to invest more soon. $100",
         "replyList": null
      },
      {
         "commenter": "Deborah Johnson",
         "message": "I feel that CHRGR is the way of the future and I believe in its success. This is an awesome product that is a huge help to the technology of today. Brilliant! $100",
         "replyList": null
      },
      {
         "commenter": "Gabriel Bustos",
         "message": "I invested because CHRGR in my way of thinking could apply there technology to other application. Smoke detect, Carbon monitors, kids toy, big kid toys,portable drills ects.. $100",
         "replyList": null
      },
      {
         "commenter": "Bruce Deese",
         "message": "This is my first time to invest personally in any thing. I feel like your company is on the right track as for as the future goes. If so I wanted to be in it a little for the ride. $500",
         "replyList": null
      },
      {
         "commenter": "Craig Desnoyers",
         "message": "I believe they found a niche market and have the ability to help people charge their phones on the go anywhere they travel efficiently. By removing the need to carry a power cord and finding a location to charge will be huge. $500",
         "replyList": null
      },
      {
         "commenter": "Rasheeda Collins",
         "message": "With the growing innovations in technology and green initiatives I see the possibilities of energy consumption changing the world ahead. I simply believe in CHRGRs potential in expanding it's footprint/brand. $100",
         "replyList": null
      },
      {
         "commenter": "Leonard Edwards",
         "message": "I believe that this device can be used for more than what's mentioned, like for safety when someone is stranded or lost. This device will maintain the battery in their phone longer. Earthquake survival kit and much more. $100",
         "replyList": null
      },
      {
         "commenter": "Shawn Pettus",
         "message": "i think it is a good idea since every one uses a cell phone and understand the problem of having to charge your device having to look for a place to plug it in, been there before. $100",
         "replyList": null
      },
      {
         "commenter": "Gurnam Singh",
         "message": "I simply believe they help solve a very common problem. The team behind this campaign is talented and strong. I feel confidant about my investment. $1,000",
         "replyList": null
      },
      {
         "commenter": "Beverly Taubenfeld",
         "message": "I like the idea of what CHRGR is doing. I think their TAM is good within the U.S. and worldwide would be even better. If they succeed with their new battery, it would be great across several markets, not just the cell phone market. $200",
         "replyList": null
      },
      {
         "commenter": "Richard Araujo",
         "message": "I like the business model and the future potential of Chrgr. It is serving a very large market (mobile phones), and solving a very important problem with Cell phone charging. The risk/reward is very manageable considering the investment amount. $100",
         "replyList": null
      },
      {
         "commenter": "Kaleb Parker",
         "message": "This a helpful solution to a major problem in the market, especially with the younger generations. Purses are out, and chargeable batteries are in, and I am excited to see this company grow in the future. $100",
         "replyList": null
      },
      {
         "commenter": "Bryce Weber",
         "message": "After many hours researching and poking as many holes as I could find I firmly believe in the teams commitment to succeed and more importantly satisfy their consumers. $100",
         "replyList": null
      },
      {
         "commenter": "Peter Baruk",
         "message": "I believe the concept is spot on.....this will be a step change in how mobile phones get charged while allowing for incredible marketing exposure for companies to reach their targeted audiences. Very smart! $2,500",
         "replyList": null
      },
      {
         "commenter": "Elby Tineo",
         "message": "I believe it is an excellent idea as it is something that is needed as phone are dying continuously. The overall business concept looks great. $100",
         "replyList": null
      },
      {
         "commenter": "Nathan Joya",
         "message": "I invested because i believe the supercapacitor battery can be the next technology to change the battery world. Companies can take this technology and apply it within their own personal product and CHRGR can reap all the profit from it $500",
         "replyList": null
      },
      {
         "commenter": "Laura Cornish",
         "message": "I believe this business solves a problem everyone faces fairly often. It's a very smart way to include business advertising to gain clients. I love it. $100",
         "replyList": null
      },
      {
         "commenter": "Vincent Rizzo",
         "message": "I believe that the amount of time needed to charge batteries is too long. The amount of time must be reduced and CHGGR is working toward that goal $100",
         "replyList": null
      },
      {
         "commenter": "Jordan Madewell",
         "message": "I invested because the Mobil and battery industries have only just begun. Market share is only in North America and parts of Asia and leaves the rest of the world to go after. $100",
         "replyList": null
      },
      {
         "commenter": "David Boardman",
         "message": "I was recently at The Chicago Art Institute, a location I have been longing to visit. I took lots of photos but my phone battery died. I would have loved to have had this option available to continue taking photos at the venue!! $200",
         "replyList": null
      },
      {
         "commenter": "Ken Ma",
         "message": "I invested because I believe the combination of advertising while solving a need is like killing two birds with one stone, especially since both are combined in the entertainment industry! $2,500",
         "replyList": null
      },
      {
         "commenter": "Victor Tan",
         "message": "Future opportunity with great concept to solve cell phone limited battery capacity. Will like to see expansion into our area like airport, car rental, university, travel agents, etc... $200",
         "replyList": null
      },
      {
         "commenter": "Darryl EGNOR",
         "message": "I invested 100.00 because business are soon going to realize that the soda being drank while a charger in the receptacle causing a \"oops\"\" hazard. The delivery of this product would provide the capability via various delivery services. $100",
         "replyList": null
      },
      {
         "commenter": "John Johnston",
         "message": "Solves big problem for large groups of people on the go...excellent added value proposition for the Brands that leverage its simple and convenient utility! $500",
         "replyList": null
      },
      {
         "commenter": "Manuel R Gonzalez",
         "message": "I always have battery problems with my phone and I am sure a large population also has the same issues. good solution for large problem in a large market. $100",
         "replyList": null
      },
      {
         "commenter": "Ronald Rutledge",
         "message": "Did my due diligence and liked the avenue they went with outdoor large concert venues. That seemed to be a success. With so many of those in the world, that market alone will be huge, not to mention bars, restaurants, etc. $500",
         "replyList": null
      },
      {
         "commenter": "janet caliendo",
         "message": "I invested because this is an idea that will help a lot of people in keeping there phones safe and not having to find a plug and be tied to one spot until there phone charges. $100",
         "replyList": null
      },
      {
         "commenter": "Scott Fortney",
         "message": "The team seems to know their clients well. They also seem like a group with their successful backgrounds that tell me, they wouldn't waste their time for peanuts!! $250",
         "replyList": null
      },
      {
         "commenter": "DeNeil Brown",
         "message": "Who doesn’t have a cell phone or similar device and so often you’re caught out with a low battery. We’ve all grown so attached to or devices and wouldn’t know what to do without them ready at our side. $100",
         "replyList": null
      },
      {
         "commenter": "Judy Walters",
         "message": "As a small business owner I am always looking for new & innovative marketing ideas. Although I’m sure this is not within my advertising budget I can see the benefits. $200",
         "replyList": null
      },
      {
         "commenter": "Dale Merritt",
         "message": "I am a member of the Angels and Entrepreneur Network and I believe you have a vision that is exceptional and the value proposition is compelling well thought out and expressed. Glad to be along for the ride $100",
         "replyList": null
      },
      {
         "commenter": "Bradford Liedel",
         "message": "I invested in CHRGR because I travel for a lot and I'm always being asked at bars, restaurants, airports and trade shows if I have a charger they can borrow or know where they can plug into an outlet. This is a great product and think it succeed. $200",
         "replyList": null
      },
      {
         "commenter": "Kenneth Buel",
         "message": "I think this is a awesome idea, with so many people on there phones now days for different reason you can’t get through a day without hearing (my phone’s dying) simple solution to an everyday problem $150",
         "replyList": null
      },
      {
         "commenter": "Teresa Turner",
         "message": "Almost everyone has a phone. Emergencies come up with dead battery or expecting an important call and battery finally shuts down. Could be difference in a new job $300",
         "replyList": null
      },
      {
         "commenter": "Kathy Steckly",
         "message": "Most people live on there phone whether for communication or work and batteries only last so long. So having a fast charger at venues is an awesome idea. That's one less object a person has to carry around.Technology is the wave of the future. $100",
         "replyList": null
      },
      {
         "commenter": "Michael Nussbaumer",
         "message": "I love the fact that there are repeaters... The need for chargers is great But I hope they steer towards battery technology too!! Good luck to us all!!! $500",
         "replyList": null
      },
      {
         "commenter": "Angela Aiumu",
         "message": "The popularity of electronic bikes has grown over the past few months and CHRGR can become a primary resource for the electronic bike companies. $200",
         "replyList": null
      },
      {
         "commenter": "Arturo Aguirre",
         "message": "It was a recommendation by Neil Patel. I like having the ability to be an investor in a company in its infancy. I look forward to seeing some of my investments in companies to grow into incredible life-changing companies. $100",
         "replyList": null
      },
      {
         "commenter": "Vicki Zyznik",
         "message": "As mentioned there is no similar products out there at the moment. There are two areas the business can expand into. 1. marketing ( advertising) 2. Super capacitor. Founders are experienced people. $200",
         "replyList": null
      },
      {
         "commenter": "Jamil Hussein",
         "message": "The company CHRGR has a great concept, being convenient and accessible is key and moving forward I would think that they see the potantial in moving forward as a leader is recharging and developing battery systems. im just a rookie for the north $500",
         "replyList": null
      },
      {
         "commenter": "Robert Fendler",
         "message": "I invested because of the due diligence I performed on this company, its owners and the potential for profit and growth over the next few years. The service they perform is effective and appears to be quite profitable. $150",
         "replyList": null
      },
      {
         "commenter": "Robin McGrew",
         "message": "So... doing the same thing over and over and expecting different results is insane! This is my step out of the insane asylum. Treat me well. Go To Charlotte NC airport... no charging stations. People beg for batteries. $250",
         "replyList": null
      },
      {
         "commenter": "Maureen Larsen",
         "message": "It is clear that just about every person owns a device that needs to be kept charged. It is part of our very fabric and part of everyday life. The needs must be met $100",
         "replyList": null
      },
      {
         "commenter": "Judy Wilson",
         "message": "I love the concept and love the passion that John has for this project to succeed. I feel there is Great opportunity for this to become very profitable. $300",
         "replyList": null
      },
      {
         "commenter": "Jose Corleto",
         "message": "Practical solution to a common problem among a huge population of battery operated mobile devices. The battery technology also has potential to target many other applications with a huge market as well. $1,000",
         "replyList": null
      },
      {
         "commenter": "Gary Moyer",
         "message": "Fulfills a daily need, addresses a daily problem. Everyone's battery dies and it can, at times be difficult to charge your phone. CHRGR has a remedy. I do think their supercapacitor technology should be developed further. This seems a game changer. $100",
         "replyList": null
      },
      {
         "commenter": "Shane Fuller",
         "message": "I invested because it seems the company CHRGR is on track to do big things and their pitch and business plan really pumped me up and I really believe this will grow drastically! $100",
         "replyList": null
      },
      {
         "commenter": "Kimm Moreno",
         "message": "96% of people own a cell phone and every one of them requires charging. This is not going to change any time soon so I believe CHRGR will be successful. $100",
         "replyList": null
      },
      {
         "commenter": "Odane Daley",
         "message": "No one carry’s around an extra battery for their phones, lap top or electrical device much less a charger and cable in their pockets or bags. This can be life changing as this generation is all about technology. $100",
         "replyList": null
      },
      {
         "commenter": "Mary Lynn",
         "message": "I believe this is a great idea to solve the issue of battery-run devices while away from a place where you can plug in your device to recharge. $100",
         "replyList": null
      },
      {
         "commenter": "Warren Hughes",
         "message": "I like this product because it is very convenient and does advertising at the same time. Being able to charge your phone and not being hooked to an outlet is great. For companies to advertise on it is another plus. Two wins in one shot. $100",
         "replyList": null
      },
      {
         "commenter": "A. R. Johar",
         "message": "I like their business partnerships and they have an interesting business plan that seems to be working. The TAM is huge so they have plenty of growth opportunity. $500",
         "replyList": null
      },
      {
         "commenter": "Vikram Anumula",
         "message": "Marketing is where the biggest dollars are made these days.. by the likes of Google, Facebook, other brands. If the conversion ratio is high and proven then this has great potential. $500",
         "replyList": null
      },
      {
         "commenter": "Robert Maschenik",
         "message": "It seems to address an apparent and ever increasing need to the public and private business sectors offering convenience to the user as well. $100",
         "replyList": null
      },
      {
         "commenter": "Ronald Thames",
         "message": "I invested because I like the concept of solving the problem of dying mobile devices but more so the longer lasting batteries with quick recharge ability and the room for growth in that area. $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Mottice",
         "message": "When I first read what CHRGR was about my jaw just hit the floor. This could be revolutionary of how we charge electronics on a day to day basis. $100",
         "replyList": null
      },
      {
         "commenter": "Darwin Davis",
         "message": "I think you are fulfilling a need. As the world grows smaller, businesses travel farther. The chargers are great for international and domestic travel. Advertising is a perk. $200",
         "replyList": null
      },
      {
         "commenter": "Mohamed Eltahir",
         "message": "My professional career, IT pulled me to this project more than any other investment. The leading team impressed me and I feel confident of their success. $1,000",
         "replyList": null
      },
      {
         "commenter": "Kevin Mulligan",
         "message": "I invested because this idea definitely meets a need Two ways..1 st the cell phone consumer who needs help when the Chrg is gone 2nd, a business who needs some effective hands-on advertising. Brilliant $500",
         "replyList": null
      },
      {
         "commenter": "Millac Chung",
         "message": "This is a tool that can solve a real issue. I was at Disney World this June and was at one of the theme park for 5 hrs when I needed to charge my phone to take more pictures. My back out charger was also out of juice, a friend’s IPAD saved the day. $100",
         "replyList": null
      },
      {
         "commenter": "Grey Clark",
         "message": "Chrgr solves a problem(low cell phone battery) which covers a massive population(cell-phone users) which opens the door for advertisement on massive scale $100",
         "replyList": null
      },
      {
         "commenter": "Jim Agold",
         "message": "I see a lot of opportunity for this concept to grow under its current plan, but also areas of expansion into other markets as they evolve over time. $500",
         "replyList": null
      },
      {
         "commenter": "Jonathan Vaca Cruz",
         "message": "I believe every person with an aspiring dream should have the resources necessary to create that dream , i always wanted to see the growth of an idea up close and now i can $100",
         "replyList": null
      },
      {
         "commenter": "Michael Brown",
         "message": "I use products just like this one almost everyday to charge my phone. So I believe it will be around for a very long time and will be used by millions. $100",
         "replyList": null
      },
      {
         "commenter": "Keith Robnett",
         "message": "I think that this is a great product and has a lot of potential. There are so many phones out there today that need charging and people will love it. $100",
         "replyList": null
      },
      {
         "commenter": "jose alvarez",
         "message": "I am always looking to charge my phone, hate lugging chargers, great idea to be at a venue charge and return no worries. this would be awesome at Disney World, the hardest place to charge a phone $1,000",
         "replyList": null
      },
      {
         "commenter": "barry holliday",
         "message": "I believe that chrgr has smart idea to satisfy a big problem. also I believe that chrgr will start to produce the super capacity battery to take over the lithium battery $100",
         "replyList": null
      },
      {
         "commenter": "Jeffrey Roth",
         "message": "Company mgmt team has strong growth vision, creating innovative revenue streams, an excellent customer retention %, a good number of current investors that like what this company is going. $200",
         "replyList": null
      },
      {
         "commenter": "Sandy Pouliot",
         "message": "We believe this is a great concept of marketing and advertising. We are looking forward to being a part of your continued growth...we are with you all the way! $250",
         "replyList": null
      },
      {
         "commenter": "George Cook",
         "message": "Came looking to invest in InnaMed but it was sold out. Wanted to give the thing a go fancied the idea of CHRGR checked them out and threw in my first $100 with Republic. This needs to go world wide fast so looking forward to the IPO. $100",
         "replyList": null
      },
      {
         "commenter": "Gregory Ott",
         "message": "I invested in CHRGR because I believe everything is going to run on batteries and everything will need a \"charger.\" Great forward thinking. Thank you! $100",
         "replyList": null
      },
      {
         "commenter": "anthony nicolas",
         "message": "I invested because I believe there is a need for this service badly, the CEO John Mullin I think is more than capable in taking this company to where it need to go. $200",
         "replyList": null
      },
      {
         "commenter": "Jeffrey Griggs",
         "message": "It appears to be a progressive company and the product is very much needed in our public places so we can charge our phones on the fly while when were out. Great Idea!!! $100",
         "replyList": null
      },
      {
         "commenter": "Sheela Gonsalves",
         "message": "Many of us have found ourselves at the end of our battery life and so dependent on our phone. I think this solves a simple everyday problem, creates a new ad vehicle, and is scalable! $250",
         "replyList": null
      },
      {
         "commenter": "John Moreland",
         "message": "I invested in CHRGR because I believe in the product and phenomenal growth it will achieve. Great idea that will revolutionize the world one CHRGR at a time and keep us connected. $100",
         "replyList": null
      },
      {
         "commenter": "Benjamin Elliott",
         "message": "The company has a vision and is already being marketed through known venues. There is money being made in the development stages that is very key to start up investments. $100",
         "replyList": null
      },
      {
         "commenter": "Cheah Choo Phaik Chee",
         "message": "I invested because Charger is giving everyone what we want when our phones run out of battery. And doing it in less than 10 minutes, it’s a godsend !! $500",
         "replyList": null
      },
      {
         "commenter": "Laura Shannon",
         "message": "I beleive this company will sell many chargers to people who are tired of having to worry about not having enough battery life life when they need it. Peace of mind is worth Million. $500",
         "replyList": null
      },
      {
         "commenter": "Kyle Hammack",
         "message": "I think we need better options for batteries since our phones die all the time. I think you have a a great idea as far as helping keep people charged. I also think you have a lot of room to grow with opportunities for better battery options. $1,000",
         "replyList": null
      },
      {
         "commenter": "Jason Dunn",
         "message": "I wanted to invest in Ghrgr because the way of cell phones is that they die easily. The way chrgr has been built to keep everyones phone charged is a great concept. $100",
         "replyList": null
      },
      {
         "commenter": "Nina Runion",
         "message": "CHRGR is on track to explode and become a must have product. They are marketing to the entire population and solving a problem with a simple fix. $100",
         "replyList": null
      },
      {
         "commenter": "Ronald Brown",
         "message": "I once drove for Uber and a lot of passengers would always ask if they could plug into my car in order to charge their phones; especially those passengers over the weekends and holidays. $100",
         "replyList": null
      },
      {
         "commenter": "Brian Eckert",
         "message": "I really liked what they are doing now. Also the industry has a lot of potential growth. Also I have been looking to invest in a startup where there is a good chance for a profit. I may invest more knowing what the direction on CHRGR is going. $100",
         "replyList": null
      },
      {
         "commenter": "Anthony Griglik",
         "message": "Everyone uses a cell phone no matter what. So lets just say half of the cell phone user use CHRGR products. That is roughly 4 billion potential customers worldwide. I like to think higher so that is why I invested! $100",
         "replyList": null
      },
      {
         "commenter": "Cameus Guillaume",
         "message": "I invested for the future , and for better environment . Invest makes jobs for the people . My investment will be a secure for my life. $100",
         "replyList": null
      },
      {
         "commenter": "Alexandra Gastaris",
         "message": "Owning a business myself I though the batteries are a great way of advertising. People will hang on to them longer than any other type of advertising item. $100",
         "replyList": null
      },
      {
         "commenter": "Albert Anokwah-Donkoh",
         "message": "I believe in the project. Lives of mankind ought to be easy, so we can all fulfill the measure of our creation. This project enables that singular goal. $100",
         "replyList": null
      },
      {
         "commenter": "Roberta Sackstein",
         "message": "I invested because I thought this would be great for people like me who forget to charge their devices. Hate when you are at a special event and you have no power. $100",
         "replyList": null
      },
      {
         "commenter": "Chandra Halma",
         "message": "I invested because people need access to power constantly yet a gap exists in this access. Outlets and power banks in terms of convenience have limits. $100",
         "replyList": null
      },
      {
         "commenter": "Walter Balderach",
         "message": "I believe in new and innovative ways for technology.to enhance and/or alleviate problems facing todays people “on the go!”: i.e., dead batteries on smart phones (a persons most useful and dependent device!) $100",
         "replyList": null
      },
      {
         "commenter": "Tammy Carr",
         "message": "I invested because we all need a charge. Especially when we have been out and about all day and still have hours to go before our day is finished. $100",
         "replyList": null
      },
      {
         "commenter": "Brad Weber",
         "message": "I was not originally planning to invest because I didn't think customers would pay to buy this product. When I learned about the marketing aspect of it which in fact has the sponsoring business pay the cost of the product I immediately saw the value $500",
         "replyList": null
      },
      {
         "commenter": "brenda anderson",
         "message": "i believe in this company. also anything that has to do with battery charging industry can't help but soar and do extremely well which is why i'm invested. Amount is private",
         "replyList": null
      },
      {
         "commenter": "Marc-Land Chrispin",
         "message": "Because I believe in this company and there is a demand for this type of service that they are providing. $50",
         "replyList": null
      },
      {
         "commenter": "Henry Lisowski",
         "message": "I like the concept and applicability going forward. $100",
         "replyList": null
      },
      {
         "commenter": "Nicholas Knowles",
         "message": "I agree that there is definitely a need for portable battery units and like that you are first to market with the advertising revenue model. $100",
         "replyList": null
      },
      {
         "commenter": "Patrick Smith",
         "message": "Love the concept! Awesome ground floor opportunity! Top notch founders and team! Two thumbs up!! $100",
         "replyList": null
      },
      {
         "commenter": "Tom Murray",
         "message": "I have a CHRGR, and I like the advertising approach behind it as well - very scalable. $500",
         "replyList": null
      },
      {
         "commenter": "Mike Gajra",
         "message": "I like the concept of this company. We are always struggling for batteries when we are working on important tasks. $100",
         "replyList": null
      },
      {
         "commenter": "Danny Solorzano Ayala",
         "message": "The idea of having chargers at a bar public events things like that is amazing to me and you could have it with you that is cool lol $100",
         "replyList": null
      },
      {
         "commenter": "Manoj Kurapati",
         "message": "Brilliant Team and Promising Idea $50",
         "replyList": null
      },
      {
         "commenter": "Steven Bocchinfuso",
         "message": "Smart team, simple concept, proven success. Great relationships with POS venues and brands/advertisers who are already on board. $7,850",
         "replyList": null
      },
      {
         "commenter": "Jeffery Wolfe",
         "message": "My phone is always dying and I’m sick of it. $105",
         "replyList": null
      },
      {
         "commenter": "Doyan Vassell",
         "message": "I believe in new ideas and new company's growth so chrgr seems like an good risk investment $50",
         "replyList": null
      },
      {
         "commenter": "Elizabeth Collins",
         "message": "I invested $100 because it looks like this is a product that will be hot in the future. I hope they have great success. $150",
         "replyList": null
      },
      {
         "commenter": "Paul Bennett",
         "message": "Battery life is key $500",
         "replyList": null
      },
      {
         "commenter": "Joe Ysidron",
         "message": "Recommended on the Angels + Entrepreneurs network. $50",
         "replyList": null
      },
      {
         "commenter": "David Zamikoff",
         "message": "I would buy this so obviously more people will too! $100",
         "replyList": null
      },
      {
         "commenter": "Kevin Young",
         "message": "The future applications for this product are astounding. $300",
         "replyList": null
      },
      {
         "commenter": "Steven Bettelli",
         "message": "Great work on solving a problem that exists for the masses. $200",
         "replyList": null
      },
      {
         "commenter": "Ricardo Carlo",
         "message": "I want to have the opportunity to capitalize big $100",
         "replyList": null
      },
      {
         "commenter": "John Filiatreau",
         "message": "Scale ability is progressive enough, solves problems,Big market with extensive roads, Geo friendly, is real, in existence $50",
         "replyList": null
      },
      {
         "commenter": "Kenneth McMullen",
         "message": "I believe almost everyone has had their devise’s battery go dead and would love to have a backup battery: solving a big problem. $75",
         "replyList": null
      },
      {
         "commenter": "Jerry Marcozzi",
         "message": "Who hasn't run out of battery life and always at the wrong time $100",
         "replyList": null
      },
      {
         "commenter": "Carmen Alik",
         "message": "to make money $100",
         "replyList": null
      },
      {
         "commenter": "Junise Regpala",
         "message": "Great product $100",
         "replyList": null
      },
      {
         "commenter": "Kevin McMillan",
         "message": "I like the combination of advertising with solving a problem we all face. $100",
         "replyList": null
      },
      {
         "commenter": "troy smith",
         "message": "i believe in importance of inovationshown by this company $100",
         "replyList": null
      },
      {
         "commenter": "Sherry Lee",
         "message": "The idea of being able to re-charge from anywhere is very appealing and useful. $100",
         "replyList": null
      },
      {
         "commenter": "kim nurss",
         "message": "I want to be part of entrepreneurship in America. $200",
         "replyList": null
      },
      {
         "commenter": "Buddy Aiken",
         "message": "it's true most everyone I know there phone dies at least once a day. Have a portable charger would be great. $250",
         "replyList": null
      },
      {
         "commenter": "Christopher Felton",
         "message": "There is great potential in your service. $110",
         "replyList": null
      },
      {
         "commenter": "Boris Curwen",
         "message": "I travel quite a bit for work and had my phone died too many times while i am on the road. I am investing in the solution to my problem $1,000",
         "replyList": null
      },
      {
         "commenter": "Darryl Wahkor",
         "message": "I believe it is needed in today world $100",
         "replyList": null
      },
      {
         "commenter": "Jethro Ekuta",
         "message": "This innovation fills an important unmet need in society $200",
         "replyList": null
      },
      {
         "commenter": "George Monson",
         "message": "Sounds like a good product and good service. $500",
         "replyList": null
      },
      {
         "commenter": "Mary Neely",
         "message": "I want to help my family and others $250",
         "replyList": null
      },
      {
         "commenter": "Monica Graves",
         "message": "I invested because I believe in the service and concept of the company. Great idea. $100",
         "replyList": null
      },
      {
         "commenter": "Darrell Sigmon",
         "message": "I think this would be great for any cell phone user $150",
         "replyList": null
      },
      {
         "commenter": "Anthony Holloway",
         "message": "I believe a product like this is needed. I would definitely use it. $400",
         "replyList": null
      },
      {
         "commenter": "Patricia Derochie",
         "message": "I invested because, I think they have a great product. $100",
         "replyList": null
      },
      {
         "commenter": "Donald Currier",
         "message": "I think this is a good idea have had problems keeping my phone charged $100",
         "replyList": null
      },
      {
         "commenter": "GODWIN OGEDEGBE",
         "message": "Providing a solution for charging batteries on the go while providing an advertising opportunity is a good idea. $300",
         "replyList": null
      },
      {
         "commenter": "Michelle Fung",
         "message": "In today's market, I believe there is certain demand for battery charger for cell phones, ipads, and laptop computers. $500",
         "replyList": null
      },
      {
         "commenter": "William Kelley",
         "message": "I want the opportunity to make money. $100",
         "replyList": null
      },
      {
         "commenter": "Julie Norton",
         "message": "Retirement financial fun money as well as significant financial donation capability........make it happen boys.....GO CHRGR $300",
         "replyList": null
      },
      {
         "commenter": "Benny Rodriguez",
         "message": "I believe in what the company is trying to achieve. $500",
         "replyList": null
      },
      {
         "commenter": "Albert Magana",
         "message": "Sounds like it has lots of potential $100",
         "replyList": null
      },
      {
         "commenter": "Henrietta Abrigo",
         "message": "I love not having to worry if my phone is dead where can I charge it. I love the instant charge. $100",
         "replyList": null
      },
      {
         "commenter": "michael underwood",
         "message": "Obvious need for product, better battery technology, sensible business plan, large number of potential users. $300",
         "replyList": null
      },
      {
         "commenter": "Thomas Barron",
         "message": "I believe it's a smart company with a big need and a big market. I like the partnerships they have alligned themselves with. $100",
         "replyList": null
      },
      {
         "commenter": "Sebastien Hayoz",
         "message": "Address demand $100",
         "replyList": null
      },
      {
         "commenter": "Rhonda Carroll",
         "message": "I believe this is a great idea $100",
         "replyList": null
      },
      {
         "commenter": "Dale Kirk",
         "message": "I think this technology will go far in today with all the device that need power my phone is all ways need power. $100",
         "replyList": null
      },
      {
         "commenter": "Robert Codoni",
         "message": "It solves a problem and this device appears to have at least short term possibilities. $1,000",
         "replyList": null
      },
      {
         "commenter": "Kile Kinney",
         "message": "to try angle investing $100",
         "replyList": null
      },
      {
         "commenter": "david kroll",
         "message": "I believe what they are doing is heading in the right direction and i wanted to be involved in this forward momentum $110",
         "replyList": null
      },
      {
         "commenter": "kristopher worley",
         "message": "I believe this is a useful product $100",
         "replyList": null
      },
      {
         "commenter": "Don Lutz",
         "message": "I watched your interview with Neil Patel and decided to invest. I am new to this and starting with a smart amount. $100",
         "replyList": null
      },
      {
         "commenter": "Chris Edwards",
         "message": "no risk no rewards $100",
         "replyList": null
      },
      {
         "commenter": "Herbert Fichman",
         "message": "I want to make money $100",
         "replyList": null
      },
      {
         "commenter": "Charlotte Parker",
         "message": "I really feel that they are fulfilling a need and I believe this is going to do very well $100",
         "replyList": null
      },
      {
         "commenter": "Casey Kliphon",
         "message": "Advertising through needed technology is part of the future $500",
         "replyList": null
      },
      {
         "commenter": "Leslie Kuriki",
         "message": "Good Business Investment for the wave of today's technology use and growing with advanced technology into the future. $100",
         "replyList": null
      },
      {
         "commenter": "Barry Seims",
         "message": "I liked the idea of a free app for millennials to charge phones $100",
         "replyList": null
      },
      {
         "commenter": "Jim McLallen",
         "message": "Just invested my first $1,000 to CHRGR! I feel this company has legs to run! $1,000",
         "replyList": null
      },
      {
         "commenter": "Zelda Rembert",
         "message": "I invested because there is always a need for batteries. Cell phones, tablets and laptops need charging. This is an incredible market. $100",
         "replyList": null
      },
      {
         "commenter": "Shawn Savage",
         "message": "I firmly believe this is the future, and CHRGR has everything in place. $150",
         "replyList": null
      },
      {
         "commenter": "Chris Spence",
         "message": "I FEEL LIKE THIS IS A MUCH NEEDED SERVICE. GREAT GROWTH POTENTIAL! $200",
         "replyList": null
      },
      {
         "commenter": "Jeffrey MacKenzie",
         "message": "Recommended by Angel and Entrpreneurs $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Redlich",
         "message": "I believe in the product and the management team in place $100",
         "replyList": null
      },
      {
         "commenter": "Chuck Crabb",
         "message": "i think it is a great concept, $200",
         "replyList": null
      },
      {
         "commenter": "John Nethero",
         "message": "Potential $250",
         "replyList": null
      },
      {
         "commenter": "Gene Gray",
         "message": "I believe there is a need for this $100",
         "replyList": null
      },
      {
         "commenter": "robert vingo",
         "message": "I feel your company is going places and I am willing to take a chance that this will be an exciting venture! $100",
         "replyList": null
      },
      {
         "commenter": "frank toepp",
         "message": "I believe this technology will go wild within a year or two $200",
         "replyList": null
      },
      {
         "commenter": "Hyacinth McFarlane",
         "message": "I think this is a great solution to a big problem. $100",
         "replyList": null
      },
      {
         "commenter": "Glenda Malone",
         "message": "I invested because I can see the need for the service and equipment provided to the end user. $100",
         "replyList": null
      },
      {
         "commenter": "Kenneth Onuorah",
         "message": "I invested because I believe CHRGR has the right idea, mission and goal for explosive growth into a multi billion dollar company. $500",
         "replyList": null
      },
      {
         "commenter": "john zajac",
         "message": "I believe that CHRGR has very good potential. My decision was also based on Neil Patel's mentoring. If Patel likes it, I like it too. $100",
         "replyList": null
      },
      {
         "commenter": "Chris Montowski",
         "message": "I believe that there will continue to be an increase in portable devices and an accessible portable power supply will always be needed $100",
         "replyList": null
      },
      {
         "commenter": "Billy LeBrun",
         "message": "I can see where this is really needed. Would love to see it in the Kansas City market. $500",
         "replyList": null
      },
      {
         "commenter": "jessica brown",
         "message": "i believe in the technology and it is the way of the future.also i believe it will be very successful with the public. $200",
         "replyList": null
      },
      {
         "commenter": "kenneth osadiaye",
         "message": "I want to be a part of this $100",
         "replyList": null
      },
      {
         "commenter": "andres higuera",
         "message": "I believe we all need charge $100",
         "replyList": null
      },
      {
         "commenter": "Eugene Fortes",
         "message": "I believe there is a problem with cell phones dying when you need them the most. CHRGR could be the solution to this world wide concern. $200",
         "replyList": null
      },
      {
         "commenter": "Jesulito Sadangsal",
         "message": "Unlimited Potential, global future, huge expansion potential. $200",
         "replyList": null
      },
      {
         "commenter": "zahid shah",
         "message": "I like the potential $100.00 $100",
         "replyList": null
      },
      {
         "commenter": "John Jay",
         "message": "Think it’s a smart move $100",
         "replyList": null
      },
      {
         "commenter": "Adam Avne",
         "message": "Recommended. $200",
         "replyList": null
      },
      {
         "commenter": "Vanessa Fedrick",
         "message": "I am confident that this is a product that will be in high demand and I see the utilization potential. $250",
         "replyList": null
      },
      {
         "commenter": "Catherine Lehman",
         "message": "It appears to be what is needed and sounds like a good investment $100",
         "replyList": null
      },
      {
         "commenter": "Linda Baumgarten",
         "message": "Because I believe in CHRGR, I feel as though there right on the money when it comes to batteries. This is our future $200",
         "replyList": null
      },
      {
         "commenter": "DAVIE HODGE",
         "message": "I have taken a good look at this company and I like what I see $100",
         "replyList": null
      },
      {
         "commenter": "Maria Brandon",
         "message": "It looks like a company that is helping to solve problems we all have with cell phone batteries. $100",
         "replyList": null
      },
      {
         "commenter": "Eric Kimbrough",
         "message": "Makes sense, they already have revenue, they have strong partnerships/customers Lyft, Audi, Nike etc. $100",
         "replyList": null
      },
      {
         "commenter": "Constance McCaffery",
         "message": "I think CHRGR is a fantastic invention. And it is going to soar... I'm so happy to invest in your Co. Thank You! $100",
         "replyList": null
      },
      {
         "commenter": "Patricia Cunningham",
         "message": "I believe that this Company will be very successful $100",
         "replyList": null
      },
      {
         "commenter": "Carolyn Wiley",
         "message": "I am new to investing and CHRGR ticked all the correct boxes for me to feel comfortable doing so in this new experience. $200",
         "replyList": null
      },
      {
         "commenter": "raul rodriguez",
         "message": "this is the present and the future. Such a good idea. $100",
         "replyList": null
      },
      {
         "commenter": "Deirdre Wynne",
         "message": "I believe this product will serve the world and my phone is dying as i write this.. I'm at 5% and i need to ho home.. $100",
         "replyList": null
      },
      {
         "commenter": "Christel Roeder",
         "message": "I believe in your product to be a better battery ,then it is in the cell phones,I thing it can truly help people on the go. $100",
         "replyList": null
      },
      {
         "commenter": "Guy Wallman",
         "message": "We definitely need better battery technology. $1,000",
         "replyList": null
      },
      {
         "commenter": "Jon Hunt",
         "message": "we are interested in helping our country grow with new ways to make our lives a little easier and more productive $100",
         "replyList": null
      },
      {
         "commenter": "Ray Laurenza",
         "message": "Believe it is a good product $100",
         "replyList": null
      },
      {
         "commenter": "Mikolaj oeper",
         "message": "Wish you all the best. $100",
         "replyList": null
      },
      {
         "commenter": "Mark Sharfner",
         "message": "I invested because I believe that there is a market and you will be solving a problem. $150",
         "replyList": null
      },
      {
         "commenter": "Mary Baltich",
         "message": "Battery technology is the future and a growing product! $100",
         "replyList": null
      },
      {
         "commenter": "Jennifer Liu",
         "message": "Happy to support a good idea. $120",
         "replyList": null
      },
      {
         "commenter": "Damon Phares",
         "message": "Because I believe in the product $100",
         "replyList": null
      },
      {
         "commenter": "Walter Smith",
         "message": "make it work it will work with hard work and persistence $200",
         "replyList": null
      },
      {
         "commenter": "Donald Albrecht",
         "message": "I'm excited with their concept. $200",
         "replyList": null
      },
      {
         "commenter": "Gloria Williams",
         "message": "Product offering satisfies need of many. $100",
         "replyList": null
      },
      {
         "commenter": "Jim carlisle",
         "message": "Really smart and useful product that will benefit many people $100",
         "replyList": null
      },
      {
         "commenter": "Herb Whitman",
         "message": "Who doesn't need emergency battery charging from time to time? $100",
         "replyList": null
      },
      {
         "commenter": "Patrick Harvey",
         "message": "Great idea to get a companies name in a consumers hands. $200",
         "replyList": null
      },
      {
         "commenter": "GARY ONOMURA",
         "message": "I invested in chrgr because I feel everyone has a cell phone so there should be a need for there service. $200",
         "replyList": null
      },
      {
         "commenter": "Scott Power",
         "message": "Great idea everyone knows how often phones die $100",
         "replyList": null
      },
      {
         "commenter": "Keith Saunders",
         "message": "I like the space $200",
         "replyList": null
      },
      {
         "commenter": "Ron Junge",
         "message": "love the concept $100",
         "replyList": null
      },
      {
         "commenter": "Benjamin Eddy",
         "message": "I believe in their vision and agree there is and will be a growing need for their product and advertising skills. $200",
         "replyList": null
      },
      {
         "commenter": "Jim Roberts",
         "message": "Recommendation and sounds like potential upward $300",
         "replyList": null
      },
      {
         "commenter": "Jeffrey Swisher",
         "message": "People always need batteries and a way to charge them... $300",
         "replyList": null
      },
      {
         "commenter": "Mark Montagano",
         "message": "I love the concept...it happens to all of us. I hope you move forward in the direction of the battery technology. $200",
         "replyList": null
      },
      {
         "commenter": "Glen deWolf",
         "message": "I like the concept and believe it's something people need and will use! $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Johnson",
         "message": "I believe in the potential that the product has. $107",
         "replyList": null
      },
      {
         "commenter": "Randy Ceaser",
         "message": "Looking for revenue for retirement - My phone also dies at in opportune times $100",
         "replyList": null
      },
      {
         "commenter": "Vincent Bridge",
         "message": "I feel that charging of batteries in cellphones will be even more important than it is now when 5G comes along. $100",
         "replyList": null
      },
      {
         "commenter": "Sabrina Reese",
         "message": "I believe there is a need. $100",
         "replyList": null
      },
      {
         "commenter": "Robert Tourres",
         "message": "I like the idea of getting a charger to use. Everyone runs low on there batteries $100",
         "replyList": null
      },
      {
         "commenter": "Simeon Raine",
         "message": "I invested because better battery charging system is overdue and CHRGR is doing it the right way $500",
         "replyList": null
      },
      {
         "commenter": "Que English",
         "message": "besides the fact that my phone is always dying, I believe It is the wave of the future, Battery Technology. $100",
         "replyList": null
      },
      {
         "commenter": "STANISLAO DERRICO",
         "message": "It solves a real problem $500",
         "replyList": null
      },
      {
         "commenter": "Ron Zagaja",
         "message": "speculative $500 $500",
         "replyList": null
      },
      {
         "commenter": "Richard Harmon",
         "message": "Mobile battery operated device will continue to become more popular and you have a winning niche. $100",
         "replyList": null
      },
      {
         "commenter": "Pene Eva",
         "message": "Trying to make money $200",
         "replyList": null
      },
      {
         "commenter": "Michael Wais",
         "message": "This is a very common problem that this company may have a good solution for. $100",
         "replyList": null
      },
      {
         "commenter": "Steven Carroll",
         "message": "Sounds like s great product that will fulfill s huge need! $350",
         "replyList": null
      },
      {
         "commenter": "Michael Williams",
         "message": "because you supply a much needed demand $100",
         "replyList": null
      },
      {
         "commenter": "Betty A Rygiel",
         "message": "Just testing thewater. $150",
         "replyList": null
      },
      {
         "commenter": "David Barry",
         "message": "The company seems to be in a good spot and on the way to being successful. $100",
         "replyList": null
      },
      {
         "commenter": "Tricia Sattar",
         "message": "I've experienced being in a location with my phone almost dead or my phone has died and I had no way of charging it. $200",
         "replyList": null
      },
      {
         "commenter": "Raymond Bondie",
         "message": "This will help keep devices functional when out for extended periods of time. $100",
         "replyList": null
      },
      {
         "commenter": "andrew bycoffe",
         "message": "I invested because I believe in the company and it's vision $100",
         "replyList": null
      },
      {
         "commenter": "Patricia Stephens",
         "message": "This is my first angel investment. CHRGR interests me. A great idea. It fulfills the 8 tips that Neil Patel recommends for an investment $100",
         "replyList": null
      },
      {
         "commenter": "angela hawkins",
         "message": "Your marketing is fantastic, and you are correct that lithium is in the past. $100",
         "replyList": null
      },
      {
         "commenter": "Clifton Jackson",
         "message": "I invested in Chrgr because I have a phone that loses power too fast. I invested 500.00 $500",
         "replyList": null
      },
      {
         "commenter": "Chima Agbam",
         "message": "i have trust in where the company is heading $100",
         "replyList": null
      },
      {
         "commenter": "Heidi Walt",
         "message": "I believe that this company will do well with technology today and in the future. $150",
         "replyList": null
      },
      {
         "commenter": "Inhwan Rhee",
         "message": "I appreciate the business model of new type advertising very highly. $500",
         "replyList": null
      },
      {
         "commenter": "Darrell Phillips",
         "message": "I recently joined angels + entrepreneurs network and liked the review that was given there. $500",
         "replyList": null
      },
      {
         "commenter": "Titus Polichnia",
         "message": "There's a big demand for battery tech. Many opportunities, not just in advertising, but also in so many different areas. Huge potential. $150",
         "replyList": null
      },
      {
         "commenter": "Lynn Michael",
         "message": "The big problem they have to solve and the repeat big names seeking their solution. $300",
         "replyList": null
      },
      {
         "commenter": "tim weiand",
         "message": "potential for explosive growth $300",
         "replyList": null
      },
      {
         "commenter": "NANCY OUTLAW",
         "message": "Looks like an idea whose time has come. $100",
         "replyList": null
      },
      {
         "commenter": "Michael Morosko",
         "message": "I believe it is a great opportunity $100 $100",
         "replyList": null
      },
      {
         "commenter": "Mary Richards",
         "message": "I think its a good idea a lot of people phones seem to die all at the wrong time and not everyone carries around a charger with them $500",
         "replyList": null
      },
      {
         "commenter": "Lisa TILLERY",
         "message": "I see this as a universal need and feel this will expand. $200",
         "replyList": null
      },
      {
         "commenter": "Deborah Stone",
         "message": "I invested because I believe that this is a intuitive company and the idea is limitless! $100",
         "replyList": null
      },
      {
         "commenter": "Kent Mansfield",
         "message": "Herjavec Group small Visionaries' The concept appears headed north..!. $110",
         "replyList": null
      },
      {
         "commenter": "Brian Spath",
         "message": "I want to make a ton of money. No other reason. $100",
         "replyList": null
      },
      {
         "commenter": "Shawn Gore",
         "message": "Batteries are indeed our future! $500",
         "replyList": null
      },
      {
         "commenter": "Sandy Chan",
         "message": "I believe in their technology & want to be part of the solution. $100",
         "replyList": null
      },
      {
         "commenter": "Frederick Wick",
         "message": "I would like to get in on the Angel investing process and experience the ride to becoming an avid investor in the future. $200",
         "replyList": null
      },
      {
         "commenter": "Susanne Chiasson",
         "message": "Seems like a good plan $200",
         "replyList": null
      },
      {
         "commenter": "Corena Curtis",
         "message": "I believe there is a need for this product in the market $100",
         "replyList": null
      },
      {
         "commenter": "kenneth Conter",
         "message": "they have a great method to do ads and the battery is great. $100",
         "replyList": null
      },
      {
         "commenter": "MATT PHILLIPS",
         "message": "I like the concept. $500",
         "replyList": null
      },
      {
         "commenter": "Travis Silman",
         "message": "I believe in the company and the items of value that it's trying to launch or will launch... $100",
         "replyList": null
      },
      {
         "commenter": "Mike Kramer",
         "message": "makes sense $100",
         "replyList": null
      },
      {
         "commenter": "Ralph Horton",
         "message": "It sounds like a good concept without much competition.. $100",
         "replyList": null
      },
      {
         "commenter": "Lula Blake",
         "message": "I believe this is an excellent product that will serve the needs of those utilizing twenty-first century innovations. $100",
         "replyList": null
      },
      {
         "commenter": "Wayne Bone",
         "message": "Potential profit $500",
         "replyList": null
      },
      {
         "commenter": "Robert Winfield",
         "message": "This concept could spread like wildfire $200",
         "replyList": null
      },
      {
         "commenter": "Debra Nicholson",
         "message": "The company is providing a useful tool, and the R&D and patenting of results should mean a continuing product over many years. $100",
         "replyList": null
      },
      {
         "commenter": "Michael Mills",
         "message": "I like the story and potential future of the company $100",
         "replyList": null
      },
      {
         "commenter": "Anita Combs",
         "message": "I think this business is a way of the future. $100",
         "replyList": null
      },
      {
         "commenter": "Zubin Sanjana",
         "message": "I believe CHRGR has potential to solve a big problem for larger consumer community $200",
         "replyList": null
      },
      {
         "commenter": "John Franks",
         "message": "The need to recharge phone batteries seems endemic. CHRGR has a solution. $200",
         "replyList": null
      },
      {
         "commenter": "Bruce Harrison",
         "message": "Future possablities look good $100",
         "replyList": null
      },
      {
         "commenter": "Scott Bacon",
         "message": "CHRGR seems like a great idea and a win-win for everyone using their services $200",
         "replyList": null
      },
      {
         "commenter": "Laurence Pesek",
         "message": "I think it will make me a profit some day. $100",
         "replyList": null
      },
      {
         "commenter": "kevena domingos",
         "message": "i'm investing because i need a colosal amount of benefits in return $100",
         "replyList": null
      },
      {
         "commenter": "Danny Doyle Sr",
         "message": "I think it's a great way to keep CELLPHONE CHARGED . $100",
         "replyList": null
      },
      {
         "commenter": "Nathan Turner",
         "message": "I believe in it $100",
         "replyList": null
      },
      {
         "commenter": "Mark Dorothy",
         "message": "I am looking to invest in good companies with a bright future. $300",
         "replyList": null
      },
      {
         "commenter": "ray grisham",
         "message": "I invested based on the info provided to help make an informed decision about CHARGR, go CHARGR. $100",
         "replyList": null
      },
      {
         "commenter": "robert lucy",
         "message": "I believe in the concept $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Goldberg",
         "message": "We feel there is a great need for this product. $100",
         "replyList": null
      },
      {
         "commenter": "Lavearne Phillips",
         "message": "I invested because this idea solves a problem and I wanted to back the team. $100",
         "replyList": null
      },
      {
         "commenter": "William Watson",
         "message": "I invested because I like the idea of not being caught with a low battery when i need my devices the most. $300",
         "replyList": null
      },
      {
         "commenter": "William Smith",
         "message": "I invested $100.00 because I can see this as a very handy tool! $100",
         "replyList": null
      },
      {
         "commenter": "Martin Angell",
         "message": "Solid info on the Angels & Entrepreneurs Deal Package $200",
         "replyList": null
      },
      {
         "commenter": "William Roark",
         "message": "I am investing to eventually supplement retirement. I can see a need for your product in this world of on the go devices. $125",
         "replyList": null
      },
      {
         "commenter": "Sam Seward",
         "message": "Like most people my battery dies throughout the day and recharging isn't always accessible. $100",
         "replyList": null
      },
      {
         "commenter": "JOE VECCHIARELLI",
         "message": "I invested because i trusted the team we are working with and the future long term growth of the comapny. $100",
         "replyList": null
      },
      {
         "commenter": "Alex Barrera",
         "message": "I believe in this new invention $100",
         "replyList": null
      },
      {
         "commenter": "Carey Wright",
         "message": "I invested because this service solves a huge problem. $100",
         "replyList": null
      },
      {
         "commenter": "Richard Garanson",
         "message": "The business concept sounds like a great idea, and from the information provided, it seems like it will be successful. $125",
         "replyList": null
      },
      {
         "commenter": "Marty Berg",
         "message": "I believe this program works! $100",
         "replyList": null
      },
      {
         "commenter": "Thomas Voegtle",
         "message": "Recommended by friend $100",
         "replyList": null
      },
      {
         "commenter": "David Lorenson",
         "message": "This makes sense. Big market. A convenience problem. Great advertising option. $100",
         "replyList": null
      },
      {
         "commenter": "Alberta Hempel",
         "message": "Raise money for retirement $100",
         "replyList": null
      },
      {
         "commenter": "Roger McNeal",
         "message": "I think this concept is good for so many reasons. I know my phone dies all the time. I think they are on the right path for success. $100",
         "replyList": null
      },
      {
         "commenter": "Louise Smith",
         "message": "This is absolutely a marvelous idea! Battery when needed at the same time advertising unique brands to consumers! $100",
         "replyList": null
      },
      {
         "commenter": "Dale Standen",
         "message": "My cell phone for need extra battery need better technology in better batterys $100",
         "replyList": null
      },
      {
         "commenter": "Matthew Jones",
         "message": "I see the need for this product. A creative ideal that will keep you talking a long time. A stroke of genius. $100",
         "replyList": null
      },
      {
         "commenter": "Larry Gurley",
         "message": "The premise is a promising one that I believe will become more popular as the word gets out and the cellular community expands $500",
         "replyList": null
      },
      {
         "commenter": "Rodrick Doss",
         "message": "I wanted to add Angel investing to my overall portfolio of / Bitcoin and Cannabis stocks $100",
         "replyList": null
      },
      {
         "commenter": "Fred Fredricks",
         "message": "The CHRGR initiative has the potential to span beyond it's current boundary. It is nice to know the company is already taking in revenue. $120",
         "replyList": null
      },
      {
         "commenter": "Neale Trenouth",
         "message": "I believe in this $100",
         "replyList": null
      },
      {
         "commenter": "Mitchell Sternard",
         "message": "I invested because I'm familiar and like the other companies that CHRGR works with now....a winning combination....!!! $200",
         "replyList": null
      },
      {
         "commenter": "David Rowh",
         "message": "I think this idea has great potential. $100",
         "replyList": null
      },
      {
         "commenter": "Charles E Gould",
         "message": "I am 81 and looking forward to this new investment process. I love the potential upside and risk taking. This is my first investment. $100",
         "replyList": null
      },
      {
         "commenter": "William Stewart",
         "message": "I see the need for this product. I hear almost every day\"My phone is almost dead\". I have invested 100 dollars. $100",
         "replyList": null
      },
      {
         "commenter": "Ken Doty",
         "message": "Need money for retirement and Company is very interesting. $100.00 $100",
         "replyList": null
      },
      {
         "commenter": "Arlene Andrews-Jefferson",
         "message": "To have money for grandchildren. And a cushion for me. $100",
         "replyList": null
      },
      {
         "commenter": "James Jaubert",
         "message": "I believe in this product because of seeing my daughter all the time with her phone not being charged $100",
         "replyList": null
      },
      {
         "commenter": "Carmen Skrine",
         "message": "As more people go mobile the need for alternative chargers become a necessity. $100",
         "replyList": null
      },
      {
         "commenter": "Eric E Larson",
         "message": "I new direction in battery technology would be huge! $100",
         "replyList": null
      },
      {
         "commenter": "Richard Miller",
         "message": "The possibility for greater return than stocks $100",
         "replyList": null
      },
      {
         "commenter": "syed azam",
         "message": "I invested because I want to be an investor. $100.00 $100",
         "replyList": null
      },
      {
         "commenter": "Craig Johnson",
         "message": "I have faith in this wonderful opportunity $100",
         "replyList": null
      },
      {
         "commenter": "Albert L'Homme",
         "message": "Looks like a great investment as this is solving a key need. $500",
         "replyList": null
      },
      {
         "commenter": "Charles Randel",
         "message": "A needed product and an intelligent way to increase . I believe this company will continue to grow $100",
         "replyList": null
      },
      {
         "commenter": "ROBERT PEISER JR",
         "message": "Batteries are continuously dying and, CHARGR seems to have the RIGHT SOLUTION!! $100",
         "replyList": null
      },
      {
         "commenter": "FRANK JONES",
         "message": "I think it has a compelling use case that solves a very large problem. $1,000",
         "replyList": null
      },
      {
         "commenter": "Derek Strickland",
         "message": "I invested because it seem like this is a smart company solving a big problem who is already linked up with big time companies $100",
         "replyList": null
      },
      {
         "commenter": "Farida Mistry",
         "message": "I believe in the product. My investment was akin to a lottery ticket. Hopefully it will turn into a powerball. $100",
         "replyList": null
      },
      {
         "commenter": "Charles Ala",
         "message": "We invested because we believe in this company and what they are doing. $100",
         "replyList": null
      },
      {
         "commenter": "james dorsey",
         "message": "I think that this company is going to do well in a much needed arena. I'm excited! $100",
         "replyList": null
      },
      {
         "commenter": "Gary Yacavino",
         "message": "I invested because I believe in what they are doing and feel there is a good market for the product $500",
         "replyList": null
      },
      {
         "commenter": "Ida Richard",
         "message": "I've been investing in stocks for years. Just decided to get in earlier. $500",
         "replyList": null
      },
      {
         "commenter": "Russell Anderson",
         "message": "I believe in this product $200",
         "replyList": null
      },
      {
         "commenter": "Paul Kari",
         "message": "I believe your charger will help millions and some bigger company might want to buy this company out! $100",
         "replyList": null
      },
      {
         "commenter": "allan payne",
         "message": "these people look to have a real vison for the future $100",
         "replyList": null
      },
      {
         "commenter": "Lisa Lee",
         "message": "Solid Plan, Highly Recommended, Long-term potential on return $100",
         "replyList": null
      },
      {
         "commenter": "Sabitra Bajgai",
         "message": "I believe in new startups. $125",
         "replyList": null
      },
      {
         "commenter": "Lynn Barrington",
         "message": "I invested because this has begun to move very quickly and it's marketing based with a big problem that is being solved in a simple way. $200",
         "replyList": null
      },
      {
         "commenter": "Aubrey Massias",
         "message": "Love the concept and the potential for growth. $1,000",
         "replyList": null
      },
      {
         "commenter": "Thomas Waller",
         "message": "invest in companies that offer potential gains $100",
         "replyList": null
      },
      {
         "commenter": "Brian Mayes",
         "message": "I love the idea of not worrying about my phone dying. $100",
         "replyList": null
      },
      {
         "commenter": "Barbara Hanes",
         "message": "I believe in technology and this is a useful tool that can be used anywhere, anytime $100",
         "replyList": null
      },
      {
         "commenter": "Robert Wilson",
         "message": "I believe in the future of this company. $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Dickerson",
         "message": "Appears to be a good company. $200",
         "replyList": null
      },
      {
         "commenter": "Dorothy Parkins",
         "message": "Based on Neil Patel due diligence and my intuition, I strongly believe that this startup company is going to do extremely well. $200",
         "replyList": null
      },
      {
         "commenter": "Jason Holman",
         "message": "Tech the wave of the future. Battery life for devices is always a need. $200",
         "replyList": null
      },
      {
         "commenter": "Travis Blake",
         "message": "I like the current relationships between CHRGE and customers, value to customers and possible growth around battery technology. $100",
         "replyList": null
      },
      {
         "commenter": "Mortimer Mazor",
         "message": "I believe this is a viable idea that can succeed. $100",
         "replyList": null
      },
      {
         "commenter": "Johansen Ah Sing",
         "message": "Following their development I could see that the marketing strategy they employ for their clients works. Very Smart. $100",
         "replyList": null
      },
      {
         "commenter": "Bernard Anyanwu",
         "message": "Good Marketing Potential at Events. $100",
         "replyList": null
      },
      {
         "commenter": "Don Heath",
         "message": "I believe this can really grow with events and ride share involvement $1,000",
         "replyList": null
      },
      {
         "commenter": "Loren Schaeffer",
         "message": "Rechargeable batteries are the future $100",
         "replyList": null
      },
      {
         "commenter": "Dennis Freedman",
         "message": "good idea. $100",
         "replyList": null
      },
      {
         "commenter": "Heather Smith",
         "message": "Had problems with phones dying on us. This sounds like a good solution $100",
         "replyList": null
      },
      {
         "commenter": "Harry Bookser",
         "message": "Because this solves a problem and they’re going global and they have a good track record $1,000",
         "replyList": null
      },
      {
         "commenter": "Lolita Guarin",
         "message": "I love helping startups! And batteries like that is the future! $100",
         "replyList": null
      },
      {
         "commenter": "Tonja Jenkins",
         "message": "I invested because I believe every great idea deserves a chance. $100",
         "replyList": null
      },
      {
         "commenter": "Jonathan James",
         "message": "I believe the concept meets a logistical need with a smart marketing $100",
         "replyList": null
      },
      {
         "commenter": "Kimberly Blade",
         "message": "I invested because I believe this product will be like Apple $100",
         "replyList": null
      },
      {
         "commenter": "Kasim Gaziyani",
         "message": "I love the concept of marketing. $500",
         "replyList": null
      },
      {
         "commenter": "Estee KHOR",
         "message": "I want to get returns for my investment $100",
         "replyList": null
      },
      {
         "commenter": "Olusegun Oseni",
         "message": "I like the potentials and technology $150",
         "replyList": null
      },
      {
         "commenter": "john enriquez",
         "message": "This is my first investment, I like what CHRGR has to offer the public, and I want to be a part of it. $125",
         "replyList": null
      },
      {
         "commenter": "Mikel Munro",
         "message": "I think this company will make it. $100",
         "replyList": null
      },
      {
         "commenter": "Telesphor Kamgaing",
         "message": "I like the company's vision of enabling easy access to power and at low cost for the end user. $200",
         "replyList": null
      },
      {
         "commenter": "Rhonda Heckman",
         "message": "Good review by Angels & Entrepreneurs, LLC $100",
         "replyList": null
      },
      {
         "commenter": "paul mitchell",
         "message": "I believe in the concept $100",
         "replyList": null
      },
      {
         "commenter": "LONDEL O'Neal",
         "message": "i believe in its direction to solve a problem with helping people staying connected. $100",
         "replyList": null
      },
      {
         "commenter": "Robbie Perkins",
         "message": "Everyone needs to be CHRGR $100",
         "replyList": null
      },
      {
         "commenter": "Ivy Taylor",
         "message": "I believe the product is something that will become very popular over a short period once production and distribution begins. $100",
         "replyList": null
      },
      {
         "commenter": "Ron Miller",
         "message": "On the advise of Neil Patel after joining Angels & Entrepreneurs Network. $100",
         "replyList": null
      },
      {
         "commenter": "Elizabeth Butikofer",
         "message": "I believe you have a good product that will be HUGE in the next year. My investment, however small, indicates my belief in your process! $100",
         "replyList": null
      },
      {
         "commenter": "Paul Castro",
         "message": "I'm trying to diversify my portfolio , I have stable investments as well as real estate. Now I'm trying more risky funds with high returns. $300",
         "replyList": null
      },
      {
         "commenter": "Donna Brown",
         "message": "So far, they seem to be ahead in this type of market, and also will improve hardware in the future. $100",
         "replyList": null
      },
      {
         "commenter": "Alison Muir",
         "message": "To enjoy the future after surviving breast cancer, I am going to live life. $200",
         "replyList": null
      },
      {
         "commenter": "Charles Devoy",
         "message": "Reviewed the data and believe battery technology growth a giant opportunity $100",
         "replyList": null
      },
      {
         "commenter": "Perry Hardee",
         "message": "I invested because I have a unit (from a different company as a gift from one of my advisers) and find it a life saver at times. $100",
         "replyList": null
      },
      {
         "commenter": "Diane Mosby",
         "message": "I invested because there is a must need for that type of service $100",
         "replyList": null
      },
      {
         "commenter": "albert childers",
         "message": "i think it will be world wide,and very usable. $200",
         "replyList": null
      },
      {
         "commenter": "SUSAN KUSHLIN",
         "message": "CHRGR has found a brilliant & innovative solution to solving an ever growing problem with cell phone battery life. Great idea $100",
         "replyList": null
      },
      {
         "commenter": "Glen Fraser",
         "message": "This Company has very good potential especially in bars, venues stores, etc. could go far. $300",
         "replyList": null
      },
      {
         "commenter": "Angela Reis",
         "message": "Love the concept. $200",
         "replyList": null
      },
      {
         "commenter": "Robert LeVeck",
         "message": "I invested because of the CEO's experience. $100",
         "replyList": null
      },
      {
         "commenter": "Robert Schellenbarg",
         "message": "I am sold on this product. I think this will grow world wide. $100",
         "replyList": null
      },
      {
         "commenter": "Bigaha Trad",
         "message": "I am hoping to earn money for my retirement. $100",
         "replyList": null
      },
      {
         "commenter": "Kenneth Brown",
         "message": "Generation wealth creation. $100",
         "replyList": null
      },
      {
         "commenter": "Mark Lindley",
         "message": "Very good idea and covers a direct need. $500",
         "replyList": null
      },
      {
         "commenter": "Veronica L Mason",
         "message": "I have always wanted to invest and this seemed like a good opportunity. There was a lot of information via Angels & Entrepreneurs. $300",
         "replyList": null
      },
      {
         "commenter": "Matias Quimno",
         "message": "Reliable and doable. $100",
         "replyList": null
      },
      {
         "commenter": "Eveline OBrien",
         "message": "I invested because I believe this type of product is the wave of the future for sure. $100",
         "replyList": null
      },
      {
         "commenter": "David Blanco",
         "message": "I can see the demand for this service and I myself had the need on multiple occasions to want access to this kind of benefit. $500",
         "replyList": null
      },
      {
         "commenter": "Neil Fraser",
         "message": "Advertising revenue from businesses, free or very low cost to client, reuse of battery rechargers, revenue growth $100",
         "replyList": null
      },
      {
         "commenter": "Dennis Kohler",
         "message": "For the future of my family! $200",
         "replyList": null
      },
      {
         "commenter": "David OHara",
         "message": "international, year over year growth $100",
         "replyList": null
      },
      {
         "commenter": "william leitch",
         "message": "sounds like a great future $100",
         "replyList": null
      },
      {
         "commenter": "Richard Stoy",
         "message": "I invested because I would like to be involved in starting companies and see this as a good opportunity. $200",
         "replyList": null
      },
      {
         "commenter": "Richard Price",
         "message": "I like the marketing aspect of the program. $100",
         "replyList": null
      },
      {
         "commenter": "Susie Strunk",
         "message": "Angels and Entrepreneurs $200",
         "replyList": null
      },
      {
         "commenter": "Tina Almonte",
         "message": "i see the need for CHRGR $100",
         "replyList": null
      },
      {
         "commenter": "brian schlesinger",
         "message": "believe in your product $1,000",
         "replyList": null
      },
      {
         "commenter": "Robin Ramos",
         "message": "I love the pitch, the product and the and the populations in which the CHRGR will reach $100",
         "replyList": null
      },
      {
         "commenter": "Troy Dixon",
         "message": "Like the business model and management team $1,500",
         "replyList": null
      },
      {
         "commenter": "David Dilday",
         "message": "Needed technology, hopefully they improve battery life. $100",
         "replyList": null
      },
      {
         "commenter": "Junie Weeks",
         "message": "I'm interested in your product. $100",
         "replyList": null
      },
      {
         "commenter": "Cheryl Haufler",
         "message": "I invested because technology is the way of the future. $100",
         "replyList": null
      },
      {
         "commenter": "Richard Pieropan",
         "message": "Technology!! $100",
         "replyList": null
      },
      {
         "commenter": "Lisette Victor",
         "message": "I invested because I believe technology is the way of the future and there is great potential for growth. $100",
         "replyList": null
      },
      {
         "commenter": "Arthur Clark",
         "message": "Highly scalable, global appeal, advertisers will love this! $150",
         "replyList": null
      },
      {
         "commenter": "LOREN ZUERCHER",
         "message": "I believe it is worthwhile product and service.....!! $100",
         "replyList": null
      },
      {
         "commenter": "olubunmi Aluko",
         "message": "I need money to continue to sponsor a school in my village in Africa after I retire in a couple of years. $200",
         "replyList": null
      },
      {
         "commenter": "Renee Liske",
         "message": "I invested because technology and convenience is everything to people today. $200",
         "replyList": null
      },
      {
         "commenter": "Jerri McCurtain",
         "message": "I’m taking a small risk. Believe that technology is a good risk. $100",
         "replyList": null
      },
      {
         "commenter": "Seth Jones",
         "message": "the company is thinking outside the box, they got ahead of the game and hopefully they continue to grow to make us a little money $100",
         "replyList": null
      },
      {
         "commenter": "Virgil Null",
         "message": "I believe it is a much needed service. $100",
         "replyList": null
      },
      {
         "commenter": "Antonio Gonzalez",
         "message": "I believe that it will keep developing like uber did. $500",
         "replyList": null
      },
      {
         "commenter": "Richard Coleman",
         "message": "I believe in the company and it’s a great idea. I’ve had my share of dead batteries and it’s no fun. $100",
         "replyList": null
      },
      {
         "commenter": "Timothy Beach",
         "message": "it is a good idea $100",
         "replyList": null
      },
      {
         "commenter": "ROBERT CONNOLLY",
         "message": "Like the promotional aspect.....continuous opportunities $300",
         "replyList": null
      },
      {
         "commenter": "Scot Hoffman",
         "message": "I invested because I like the ideals of the company and target. $100",
         "replyList": null
      },
      {
         "commenter": "SOL GERSH",
         "message": "JUST TESTING STILL LOOKING FOR 1,000 X DEAL $100",
         "replyList": null
      },
      {
         "commenter": "John Pagonis",
         "message": "Potential growth $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Gajowski",
         "message": "I think this devise is needed and will be a seller. $100",
         "replyList": null
      },
      {
         "commenter": "Kathleen Kraft",
         "message": "I believe you have a great product that is needed by many people! Looking forward to seeing CHRGR's growth!! $100",
         "replyList": null
      },
      {
         "commenter": "Robert Hamilton",
         "message": "I think its a perfect idea $100",
         "replyList": null
      },
      {
         "commenter": "Sandy Christensen",
         "message": "Innovative product that has great potential $500",
         "replyList": null
      },
      {
         "commenter": "Sundeep Singh",
         "message": "Looks promising. $100",
         "replyList": null
      },
      {
         "commenter": "Walt Dodson",
         "message": "I need a mobile charger that follows me everywhere! $100",
         "replyList": null
      },
      {
         "commenter": "Jeffery Bush",
         "message": "I believe as long as there are phones there will be a need for chargers. This charger is special. $2,500",
         "replyList": null
      },
      {
         "commenter": "Jamal Burton",
         "message": "I think this company will do well. I like the current business model & strategic partnerships. $550",
         "replyList": null
      },
      {
         "commenter": "Steve Burskey",
         "message": "Logical idea, I see this gaining traction and becoming huge $200",
         "replyList": null
      },
      {
         "commenter": "Gary Benjamin",
         "message": "Recommended by Neil Patel $600",
         "replyList": null
      },
      {
         "commenter": "Carl Davis",
         "message": "it's has lots of potential; smart marketing $100",
         "replyList": null
      },
      {
         "commenter": "Jane Landseadel",
         "message": "100.00 $100",
         "replyList": null
      },
      {
         "commenter": "Mark Nilsen",
         "message": "Loved the idea and have seen the charging stations and thought it was so smart. $100",
         "replyList": null
      },
      {
         "commenter": "john watkins",
         "message": "i invested because this looks like something i would use. i also believe millions of other people would use too. $100",
         "replyList": null
      },
      {
         "commenter": "Winsome Martin",
         "message": "Technology is the future every kid has a cell phone now unique way of charging your phone $100",
         "replyList": null
      },
      {
         "commenter": "James Mullins",
         "message": "Like the product and the marketing approach to the hospitably industry $100",
         "replyList": null
      },
      {
         "commenter": "Jose J Cortez",
         "message": "Investments in the future of this earth, hopefully bring this world closer in compassion for one another. $100",
         "replyList": null
      },
      {
         "commenter": "Donald Pohler",
         "message": "I invested because of past successes of the company and the boundless opportunities ahead. $100",
         "replyList": null
      },
      {
         "commenter": "William Evans",
         "message": "I believe it’s a great marketing concept and will become very profitable. $100",
         "replyList": null
      },
      {
         "commenter": "Noah Roane",
         "message": "Angels and Entrepreneurs network has provided me with the information I needed to make an investment into this company $100",
         "replyList": null
      },
      {
         "commenter": "Ethel Rucker",
         "message": "I believe this is very helpful and needed since we are a tech society $100",
         "replyList": null
      },
      {
         "commenter": "Clarence Laney",
         "message": "Looks like a ideal that is needed. $500",
         "replyList": null
      },
      {
         "commenter": "Anthony Yee",
         "message": "It serves a need of all phone users $200",
         "replyList": null
      },
      {
         "commenter": "Orin Mangar",
         "message": "I invested $100.00 because I believe CHRGR to be a good investment $100",
         "replyList": null
      },
      {
         "commenter": "joesph peterson",
         "message": "hi my joseph I believe what yall guy are doing is fantastic. this something that need wish it was year ago. $100 $100",
         "replyList": null
      },
      {
         "commenter": "Bernetta Bobbitt",
         "message": "I think this company has all the correct components to be successful $500",
         "replyList": null
      },
      {
         "commenter": "Vito Dragonetti",
         "message": "Sounds like a good idea for advertisers and something that people will need and use regularly. $500",
         "replyList": null
      },
      {
         "commenter": "Valerie Stevens",
         "message": "It's needed in the way that our future is headed. $250",
         "replyList": null
      },
      {
         "commenter": "Frances Young",
         "message": "CHRGR satisfies a big need. I've been there, battery dead, can't take that last photo. Sh?t $100",
         "replyList": null
      },
      {
         "commenter": "Barry Wussow",
         "message": "A highly needed product/service in today’s society. $100",
         "replyList": null
      },
      {
         "commenter": "Dvir Gefen",
         "message": "I am a member of Neil Patel's Angel investors network, and invested in CHRGR following Neil's recommendation and my own due diligence. $500",
         "replyList": null
      },
      {
         "commenter": "Kevin Rood",
         "message": "I can see this product going in many directions Thank you for letting me be a part of this awesome company $100",
         "replyList": null
      },
      {
         "commenter": "Pamela Florence",
         "message": "I believe this will be the way of the future. $100",
         "replyList": null
      },
      {
         "commenter": "Jeffrey Mugge",
         "message": "I believe there is a great need for this product and excited to see where it views. $100",
         "replyList": null
      },
      {
         "commenter": "CLINTON FOSTER, SR",
         "message": "THIS IS A PRODUCT THAT WILL BE VALUED BY THE CONSUMERS. THE POTENTIAL TO IMPROVE MY INVESTMENTS. $100",
         "replyList": null
      },
      {
         "commenter": "Dolores Tiangco",
         "message": "Help support the founders $100",
         "replyList": null
      },
      {
         "commenter": "Linda Carter",
         "message": "Looks like it’s on the wave of what the future is demanding. $100",
         "replyList": null
      },
      {
         "commenter": "Pedro Nunez",
         "message": "I like the company. $100",
         "replyList": null
      },
      {
         "commenter": "bernard nalepka",
         "message": "want to make money $500",
         "replyList": null
      },
      {
         "commenter": "Jean Volmy",
         "message": "I invested because Volatility , and making a difference for the future $100",
         "replyList": null
      },
      {
         "commenter": "Kerry Bryant",
         "message": "I invested because I believe in the product and that it is of use to everyone that has a cellular or electronic device. $125",
         "replyList": null
      },
      {
         "commenter": "Mildred Rivers",
         "message": "I can see the younger generation using this technology. $100",
         "replyList": null
      },
      {
         "commenter": "Michelle Dion",
         "message": "I impressed by this product. $100",
         "replyList": null
      },
      {
         "commenter": "jeff hall",
         "message": "I believe $100",
         "replyList": null
      },
      {
         "commenter": "Joe Lange",
         "message": "To be a part in the changing future. $200",
         "replyList": null
      },
      {
         "commenter": "Cathy Heavner",
         "message": "I am a company owner in constant use of my phone $150",
         "replyList": null
      },
      {
         "commenter": "Wanda Davis",
         "message": "For my future $100",
         "replyList": null
      },
      {
         "commenter": "Mir Shuttari",
         "message": "I notice a real growth potential. $500",
         "replyList": null
      },
      {
         "commenter": "Vivek Mehta",
         "message": "I believe in this idea. $75",
         "replyList": null
      },
      {
         "commenter": "Julie Rohr",
         "message": "I like the idea... $100",
         "replyList": null
      },
      {
         "commenter": "Alice Conklin",
         "message": "This is a much needed product for all the cell phone users in the world. A great idea. $100",
         "replyList": null
      },
      {
         "commenter": "Randolph Wright",
         "message": "Little competition and very convenient in a time of power shortage 👍 $100",
         "replyList": null
      },
      {
         "commenter": "PET MUOH",
         "message": "I invested because I want to be counted part of the CHRGR success story with good returns for my investment. $500",
         "replyList": null
      },
      {
         "commenter": "David Hubler",
         "message": "In my opinion...CHRGR simply makes sense. I like the concept and think they have a real chance of making it a success. $100",
         "replyList": null
      },
      {
         "commenter": "Cedric Chance",
         "message": "I invested because I see a great future and need for your services. $100",
         "replyList": null
      },
      {
         "commenter": "Kevin Spratley",
         "message": "My goal is to become a philanthropist. $200",
         "replyList": null
      },
      {
         "commenter": "Karen Carter",
         "message": "working for retirement $500",
         "replyList": null
      },
      {
         "commenter": "Joseph Goodmann",
         "message": "it has so many large companies already on board. $100",
         "replyList": null
      },
      {
         "commenter": "Claire Elstun Coffel",
         "message": "popular demand $100",
         "replyList": null
      },
      {
         "commenter": "Gregory Symins",
         "message": "I believe in the product $100",
         "replyList": null
      },
      {
         "commenter": "Marianne Cannon",
         "message": "I love the simplicity of the idea, it's brilliant! $100",
         "replyList": null
      },
      {
         "commenter": "Marlena Thomson",
         "message": "I am tired of being poor, and I would love to invest in other people’s lives. $125",
         "replyList": null
      },
      {
         "commenter": "Hermon Robinson",
         "message": "I believe that this company will revolutionize batteries for phones $50",
         "replyList": null
      },
      {
         "commenter": "Sandra Ziegler",
         "message": "This is something that has been needed for a long time. Great vision. $100",
         "replyList": null
      },
      {
         "commenter": "Nicholas Cram",
         "message": "I invested because this provides a better rate of return than IPO and as a company in the tech sector this company makes sense. $500",
         "replyList": null
      },
      {
         "commenter": "Paul Shuster",
         "message": "I like the concept and they have some big-name clients already. I see a lot of potential $100",
         "replyList": null
      },
      {
         "commenter": "TONI WALKER",
         "message": "I BELIEVE IN WHAT THE COMPANY IS DOING. $100",
         "replyList": null
      },
      {
         "commenter": "Randy Rowley",
         "message": "Need multiple streams of investments $100",
         "replyList": null
      },
      {
         "commenter": "Widson Charles",
         "message": "I invested $100 in CHRGR because I really believe it will make a change in the world of technology that we live in $100",
         "replyList": null
      },
      {
         "commenter": "Larry Hayworth",
         "message": "I think the product is needed for solving the problem of low batteries in your cell phone. I know mine is always low when I need it most. $100",
         "replyList": null
      },
      {
         "commenter": "John Buckley",
         "message": "I very much like the concept and feel Chrgr has great potential. $500",
         "replyList": null
      },
      {
         "commenter": "Kenneth Strong",
         "message": "Everyone use batteries in this generation and that is the need for chargers. I think this is a really good investment opportunity $100",
         "replyList": null
      },
      {
         "commenter": "Mark Feller",
         "message": "Its a need $500",
         "replyList": null
      },
      {
         "commenter": "Michael Light",
         "message": "I like the concept $500",
         "replyList": null
      },
      {
         "commenter": "Harvey Harrison",
         "message": "I invested $100 in CHRGR because it solves a fundamental problem with battery operated devices. $100",
         "replyList": null
      },
      {
         "commenter": "Nathan Lett",
         "message": "Advised by Neil Patel $100",
         "replyList": null
      },
      {
         "commenter": "Hector Mukemu",
         "message": "The service the company would be providing widely accepted. $500",
         "replyList": null
      },
      {
         "commenter": "katherine vu",
         "message": "I think company will do well $100",
         "replyList": null
      },
      {
         "commenter": "Eric Day",
         "message": "You have a lot of relationships already established which makes you less risky for me. Plus phones are everything to people now $200",
         "replyList": null
      },
      {
         "commenter": "Cathy Villalobos",
         "message": "someone recommended and I like the idea :) $100",
         "replyList": null
      },
      {
         "commenter": "Michael Gerlach",
         "message": "A perfect idea with such room to expand. Keep up the good work. $100",
         "replyList": null
      },
      {
         "commenter": "Wari Isaac",
         "message": "There is a market opportunity here and I believe in CHRGR to dominate this market. $300",
         "replyList": null
      },
      {
         "commenter": "Roseline Chery",
         "message": "Roseline Chery $100.00 I invested because I believe this company will do a great service to manmind. $100",
         "replyList": null
      },
      {
         "commenter": "Prasad Matti Rao",
         "message": "I invested because I like the idea. $500",
         "replyList": null
      },
      {
         "commenter": "Leo Fauteux",
         "message": "The future is batteries $200",
         "replyList": null
      },
      {
         "commenter": "Robert Dorchak",
         "message": "I love innovation and a business that solves problems. This does both. Look forward to the future. $100",
         "replyList": null
      },
      {
         "commenter": "Virginia Madison",
         "message": "I believe in the company $100",
         "replyList": null
      },
      {
         "commenter": "Edward Soblotne",
         "message": "Because woman will buy anything. I think it is a good investment and I hope you do well. $200",
         "replyList": null
      },
      {
         "commenter": "Bryan Shaw",
         "message": "I believe in the business plan $500",
         "replyList": null
      },
      {
         "commenter": "Stephen Reese JR.",
         "message": "I think this company can do well and I'm confident they will succeed and I as well $200",
         "replyList": null
      },
      {
         "commenter": "Gerald Bouthner",
         "message": "Like the concept $100",
         "replyList": null
      },
      {
         "commenter": "Kevin Hutchinson",
         "message": "I invested because I think you're a solid winner and I would like to be a part of your amazing success. $100",
         "replyList": null
      },
      {
         "commenter": "Louise Martin",
         "message": "I do believe it is a great product and look forward to seeing how far they will go in their quest, and I have invested $100 $100",
         "replyList": null
      },
      {
         "commenter": "Bonnie Knoll",
         "message": "I invested because it solves a huge problem and is a creative way to advertise. This business model just makes sense. $100",
         "replyList": null
      },
      {
         "commenter": "Nathanial Streich",
         "message": "I have used their product and it was seamless and great! $100",
         "replyList": null
      },
      {
         "commenter": "Charles Jenkins",
         "message": "Make money $100",
         "replyList": null
      },
      {
         "commenter": "Elizabeth Harris",
         "message": "I believe this will go far! $100",
         "replyList": null
      },
      {
         "commenter": "Patrick Morrissey",
         "message": "I want to be wealthy and I believe your product and the success of your company may help be a means to that end. $100",
         "replyList": null
      },
      {
         "commenter": "Michael Tucker",
         "message": "I wanted too $150",
         "replyList": null
      },
      {
         "commenter": "Rolf Suckut",
         "message": "It sounds like a good deal. I can see the need for this type of service. $500",
         "replyList": null
      },
      {
         "commenter": "Delmas Hyppolite",
         "message": "I invest $100 but I need to invest more I cannot. Please let me know how to invest more. $100",
         "replyList": null
      },
      {
         "commenter": "SCOTT WILSON",
         "message": "Try some thing new $100",
         "replyList": null
      },
      {
         "commenter": "Kevin Barrett",
         "message": "I want to be part of something that will grow and produce some money for myself. $100",
         "replyList": null
      },
      {
         "commenter": "Inez Spencer",
         "message": "100.00 $100",
         "replyList": null
      },
      {
         "commenter": "Christopher Ming",
         "message": "I invested because I am trying to become financially independent and I believe in battery power and going green for the whole world. $250",
         "replyList": null
      },
      {
         "commenter": "Ryan Hall",
         "message": "I invested because I see the potential to build a much bigger technology to patent and licence!! $1,000",
         "replyList": null
      },
      {
         "commenter": "Sean Tan",
         "message": "It has great partners like Nike, an honest founder $100",
         "replyList": null
      },
      {
         "commenter": "Michael Long",
         "message": "Sounded good $500",
         "replyList": null
      },
      {
         "commenter": "james hagan",
         "message": "I liked it $100",
         "replyList": null
      },
      {
         "commenter": "Margaret Hale-Gray",
         "message": "good business plan--- needed product---advertising for business that customers will like. $200",
         "replyList": null
      },
      {
         "commenter": "John Alexanderowicz",
         "message": "Interesting concept to a real life problem $100",
         "replyList": null
      },
      {
         "commenter": "Virginia Kelly",
         "message": "I invest because I believe in the product. $100",
         "replyList": null
      },
      {
         "commenter": "Sandra Wellington",
         "message": "I invested because I think that CHRGR has great potential to be extremely successful. $100",
         "replyList": null
      },
      {
         "commenter": "Caryn Dinet",
         "message": "I have been stuck without a charger or battery backup, so I can see the value in this. $100",
         "replyList": null
      },
      {
         "commenter": "Daniel Bebee",
         "message": "Great Idea. $100",
         "replyList": null
      },
      {
         "commenter": "Edward Gardner",
         "message": "Felt CHRGR was a good economic investment for my $1000 investment $1,000",
         "replyList": null
      },
      {
         "commenter": "Gerald Henrikson",
         "message": "They are filling a need, that should give us all a good return $100",
         "replyList": null
      },
      {
         "commenter": "Paul Anthony",
         "message": "the service will work $100",
         "replyList": null
      },
      {
         "commenter": "Eva Gay Pike",
         "message": "$100 so far $100",
         "replyList": null
      },
      {
         "commenter": "Earl Brown",
         "message": "Awesome product needed throughout the world and it coincides with any business $200",
         "replyList": null
      },
      {
         "commenter": "JAMES Young",
         "message": "I belive that you might be on to building a better battery and people would pay greatly for a longer battery $200",
         "replyList": null
      },
      {
         "commenter": "Gary Miessner",
         "message": "I believe in the product $100",
         "replyList": null
      },
      {
         "commenter": "Britney Chacon",
         "message": "To make money. Duh $100",
         "replyList": null
      },
      {
         "commenter": "Nancy Wolff",
         "message": "I invested 100 dollars because the product sounded like it had a lot of potential to solve a major problem. $100",
         "replyList": null
      },
      {
         "commenter": "Jose Otero",
         "message": "innovation & re-use of battery sources $150",
         "replyList": null
      },
      {
         "commenter": "Joseph Smith",
         "message": "I want to help the business succeed and make alot of money! $100",
         "replyList": null
      },
      {
         "commenter": "Ken Battistella",
         "message": "I believe this product will make life easier thousands! $100",
         "replyList": null
      },
      {
         "commenter": "Andrew Neely Sr",
         "message": "I believe this is a great ideal $100",
         "replyList": null
      },
      {
         "commenter": "MohamedSabir Yusuf Siyaji",
         "message": "I invested with the hope that the company become successful and investors gets the benefits. $100",
         "replyList": null
      },
      {
         "commenter": "Christy Gray",
         "message": "I believe in the Company $200",
         "replyList": null
      },
      {
         "commenter": "kelvin watts",
         "message": "I invested because the startup product interest me. $200",
         "replyList": null
      },
      {
         "commenter": "jason bledsoe",
         "message": "Taking a chance $100",
         "replyList": null
      },
      {
         "commenter": "Jeffrey Rees",
         "message": "I believe this can be a benefit to all $100",
         "replyList": null
      },
      {
         "commenter": "Harry Balish",
         "message": "Looks to be a great product $100",
         "replyList": null
      },
      {
         "commenter": "Robert Lasher",
         "message": "I Believe $100.00 $100",
         "replyList": null
      },
      {
         "commenter": "Yulin Wright",
         "message": "I believe in this start up! $500",
         "replyList": null
      },
      {
         "commenter": "Okwudili Amaechi",
         "message": "Excellent idea. Amount is private",
         "replyList": null
      },
      {
         "commenter": "James West",
         "message": "I believe Amount is private",
         "replyList": null
      },
      {
         "commenter": "Rick Vela",
         "message": "All the reasons stated in the Pitch sync with my own personal thoughts. Amount is private",
         "replyList": null
      },
      {
         "commenter": "ascanio leone",
         "message": "i trust him Amount is private",
         "replyList": null
      },
      {
         "commenter": "Doyle Foxx",
         "message": "Seems to be an item that everyone needs. Amount is private",
         "replyList": null
      },
      {
         "commenter": "Robert Timmons",
         "message": "My cell phone with all the apps running dies faster and this is definitely something I could gain access to help me stay charged. Amount is private",
         "replyList": null
      },
      {
         "commenter": "jack mydlarz",
         "message": "I see the concept that the company markets as viable and needed by all people using battery powered portable devises. Amount is private",
         "replyList": null
      }
   ],
   "content": "Deal Highlights \nRepeat success with major clients, including Lyft, Heineken, Fanatics, CLIF, Red Bull, Instagram, American Express, Nike, Audi, First Republic Bank, and Mack Weldon and many more.\n3x year-over-year growth since 2016 with $700K in revenue in 2018 \n70% customer retention rate with repeat customers ordering 40% more\nProviding end users what they really want, a free battery to use and take home\nStrong distribution partners including Uber, Lyft, Cargo, Blade, Jetsmarter, Aspen, Live Nation, and a roster of hotels, gyms and nightlife venues\n\nThe problem\nThe need for back-up power continues to be a problem for everyone\nCustomers are always running low at their favorite venue or event; and at this moment, they’ll do anything for power. Charging their device only means tethering to an outlet or leaving their device unattended.\nSlow phones or dead batteries means fewer uploads to Instagram, selfies shared, and moments captured with friends. No one wants a low battery to ruin their experience.\nAmongst a range of solutions CHRGR has emerged as being one of the most consumer-friendly and revenue positive.\nFree battery power everywhere\n\nAdvertiser sponsored batteries to get \"brands in the hands\" of customers.  Pre-charged and ready to go supporting iPhone, Android and USB C. \nFor customers, there’s no tethering, no waiting for an outlet, no app download or leaving their device unattended. Supports both iPhone and Android to get immediate power. Recharge and reuse via USB.\nFor advertisers, we provide a more innovative physical and digital ad experience, with a more competitive CPM. We also generate tracking data, including real-time campaign analytics, user information and geo targeting, to measure campaign effectiveness and targeting.\nFor venues, we provide a free utility with no strings attached or wires to plug in. Simply give your patrons a CHRGR when they ask for power.\nCHRGR is providing advertisers with a direct way to reach customers through a utility where and when they it need the most.\nHow it works\n\nBatteries are distributed through our national venue network of hotels, bars, clubs, music festivals, ride shares, gyms and resorts.\nAdvertiser sponsored devices (with an offer or incentive included) are provided to venues and distributed to end users as free and theirs to keep. 10,000+ venues and growing.\n\nPress\n\n\n\n\nTraction\n70% of our customers have come back to order more units. On average re-orders were 40% larger than initial orders.\nOur network is growing \nWe’ve connected advertisers with 10,000+ hotels, bars, clubs, music festivals, ride shares, gyms and resorts to distribute their branded batteries. And we’re expanding our network to enhance our advertising experience and reach more markets.\nSales are booming\nAs our network grows, so does our revenue. In 2018, CHRGR tripled it’s annual revenue from 2017 to $700,000.00\nTechnology + data\nWith the addition of patent-pending NFC and RFID, the CHRGR also serves as a hotel key card, and smart pass for ski resorts, festivals and theme parks. The full potential is then an all-access, all-inclusive pass (and utility) for festivals, events, and venues.\n\nCustomers\nCHRGR is powering major brands.\nStrong distribution partners including Uber, Lyft, Cargo, Blade, Jetsmarter, Aspen, Live Nation, and a roster of hotels, gyms and nightlife venues. Clients that keep coming back include Nike, Heineken, Audi, First Republic Bank, Mack Weldon, Fanatics\n\nSatisfied clients\nReturn on investment was close to $1.2M in new sales for Lyft from a media campaign buy of $90,000 with CHRGR.\nCHRGR provided 10,000 batteries to 500 NYC venues - Lyft branded with $20 ride credits and acquired 1000 end users that converted to new customers with an average spend of $100 per month since 2017.\nBusiness model \nLarge profit margins \n63% margins at 10k units (~$100k revenue)\n72% margins at 100K (~$1M revenue)\nWith higher quantities, manufacturing costs decrease and profit margins go up.\nScale makes profit margins even larger\nManufacturing costs shift from 29% → 22% of revenue\nMarket opportunity\nIn 2019 mobile phone users will reach 4.68 billion and surpass 5 billion by 2020.\n\nWe're first to market and doing it right\nCHRGR is the first to distribute free-to-keep units. Unlike the competition, there's no app required, no tethering, and no other barriers of entry to charge a customer device. We're taking a big step away from the lockers, the rental fees, and the “get the app” model to instead offer advertisers an easy and simple way to get into the hands of consumers.\nCompetitive advantages\nEstablished network and locked deals with distribution partners\nSolid relationships with satisfied brand sponsors \nProven, simple model with diverse recurring revenue streams\nInsights into logistics, consumer needs and partner incentives\n2-year head-start in product development and prototyping\nA team with decades of experience in Ad Tech, Innovation, and Marketing\n\n\nRaised $543k to date\nCHRGR has raised over $543,000 in its initial seed round with another CF platform. Close to 500 accredited and non-accredited investors supported CHRGR in 2017. \nNow CHRGR is looking to raise another 500k on Republic.\nThis is a timely opportunity to invest in a start-up with a dominant position at the intersection of mobile technology, branded utility and digital advertising. With secure client relationships, solid revenues and an inspired plan for future growth, CHRGR is headed towards even greater success.\n\nWhat's next\nSupercharged CHRGR network\nOur goal is to create a deeper connection between brands and customers by developing smart batteries that activate end users devices with engaging and free custom content. We have a 6 month strategy to deployment with version 2.0 batteries that will automatically connect brands to customers using CHRGR SaaS. Additionally, a new super-capacitor upgrade will allow for 8-10 minute recharging,\n\n\nFounders & Team\nJohn Mullin\nFounder & CEO\nPast: Twitter, Beats Music (Apple), Nike, R/GA\n\n\nLucas Hearl\nCo-Founder & CCO \nPast: Google, Jet Blue, Nike, R/GA \n\n\n\nEvan Madden-Peister\nCFO & Operations\nPast: Birch Coffee, Delhcioso, MP:Consulting\n\n\n\nDavid Chapman\nEVP Event Operations\nPast: Glaceau (Coca Cola), Verizon, Switch Marketing\n\n\nAdvisors\nJon Hackett, Publicis | SVP Emerging Technology\nGareth Kay, Neil Robinson, Chapter | Founder Team\nRussel Reiger, Magna Entertainment\nCraig Kornblau, Google Ventures, Universal Pictures, The Walt Disney CompanyWhy others invested\nSee all reviews (763)\nSince the beginning of humanity, there has been a drive and pursuit of more and more energy. Earlier than as firewood and coal, today more than ever as electricity. CHRGR - An amazing idea, implementation + advertising - for an important human need.\nArwed K.\n3 months ago\nThe intersection between hardware innovation, digital innovation, and advertising placement has become increasingly important in this day and age, in what’s already a saturated field. Sometimes the simplest ideas succeed, and CHRGR has a good one.\nKenneth B.\n3 months ago\nVery Innovative Advertisement and Customer Acquisition Solution for Brands, for very common battery power requirements by end consumers!! Loved it.\nAkash S.\n3 months agoAbout CHRGR\nLegal Name\nCHRGR, Inc.\nFounded\nMay 2016\nForm\nNew York Corporation\nEmployees\n4\nWebsite\nhttps://www.chrgr.com/\nSocial Media\nHeadquarters\n142 West 57th Street , New York, NYCHRGR Team\nJohn Mullin\nFounder and CEO\nLucas Hearl\nCo-Founder and CCOFAQ\nHow do I earn a return?\nHow do I earn a return?\nWe are using Republic's Crowd SAFE security. Learn how this translates into a return on investment here.\nStill have questions? Check the discussion section.Risks\nWe rely on other companies to provide components and services for our products.\nWe depend on suppliers and subcontractors to meet our contractual obligations to our customers and conduct our operations. Our ability to meet our obligations to our customers may be adversely affected if suppliers or subcontractors do not provide the agreed-upon supplies or perform the agreed-upon services in compliance with customer requirements and in a timely and cost-effective manner. Likewise, the quality of our products may be adversely impacted if companies to whom we delegate manufacture of major components or subsystems for our products, or from whom we acquire such items, do not provide components which meet required specifications and perform to our and our customers’ expectations. Our suppliers may be unable to quickly recover from natural disasters and other events beyond their control and may be subject to additional risks such as financial problems that limit their ability to conduct their operations. The risk of these adverse effects may be greater in circumstances where we rely on only one or two subcontractors or suppliers for a particular component. Additionally the cost of lithium and our technical components could be affected by trade or tariff negotiations. Our products may utilize custom components available from only one source. Continued availability of those components at acceptable prices, or at all, may be affected for any number of reasons, including if those suppliers decide to concentrate on the production of common components instead of components customized to meet our requirements. The supply of components for a new or existing product could be delayed or constrained, or a key manufacturing vendor could delay shipments of completed products to us adversely affecting our business and results of operations.\nWe depend on a few major customers for a substantial portion of our net sales.\nWe rely on various intellectual property rights, including licenses in order to operate our business.\nThe Company is not subject to Sarbanes-Oxley regulations and may lack the financial controls and procedures of public companies.\nDamage to our reputation could negatively impact our business, financial condition and results of operations.\nShow all Risks"
}