{
   "name": "BookMain",
   "url": "https://republic.co/bookandmain",
   "dealTerms": [
      {
         "Valuation cap": "$6,000,000"
      },
      {
         "Discount": "20%"
      },
      {
         "Minimum investment": "$100"
      },
      {
         "Type of security": "Crowd SAFE · Learn more"
      },
      {
         "Funding goal": "$25,000 – $1,070,000"
      },
      {
         "Deadline": "August 31, 2019 at 3:59 AM (EDT)"
      }
   ],
   "discussion": [
      {
         "commenter": "Erik Van de Water",
         "message": "Can you provide your historical numbers on number of users (authors and readers) and revenue?",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@erik-van-de-water Hi Erik, for revenue, please reference the deal page and Form C. Regarding our user base, There are currently 48k registered users on Book+Main Bites, with over 3,500 published authors. The number of registered users is growing organically at an average of 1k each month.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Erik Van de Water",
         "message": "Thank you for sharing your company with us! The website is beautiful and beautifully simple. Could you discuss more on your competitive advantage with readers? If I go to goodreads.com/list/tag/romance I can find (what I consider) quite specific romance categories, and if I visit a link to any of those books on Amazon I would expect to find a \"Look Inside\" option which will include the initial section of the book to read.",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@erik-van-de-water Thank you for your question, Erik. We appreciate your compliment as we’ve put great focus on making our website and apps beautiful with an intuitive, efficient and effective user experience. The answer to this question is lengthy and best conveyed in a conversation. However, I will try to answer as succinctly as possible.\n\nCurated Content\n\nThe example you've shared is typical of what a romance reader currently experiences outside of Book+Main. You search for \"romance\" and get lists upon lists of thousands of books to wade through. From the link in your comment, there are 30 lists to a page, with more than 186 pages of lists and anywhere from 14 books on a list to almost 9K—on ONE list alone. From these lists, the reader must then click book after book, read a blurb {oftentimes NOT written by the author}, read reviews {with potential spoilers}, then head to the retailer. The entire process is extremely tedious with very little assurance the reader will find what they’re seeking.\n\nIt's also very important to note that authors are not the curators of the content/lists on Goodreads. Anyone can add anything, and many times that information is incorrect. On Book+Main, all of the content is added by the authors themselves.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "Bites vs Samples\n\nConsider the following example: a reader wants a second-chance romance with a strong female lead set in Manhattan. She just finished another book like that and wants more. This is VERY typical as many romance readers are mood readers. On Book+Main, they can search for these tropes altogether and any Bites that exist with those keywords {chosen BY the author}, either alone or in combination, will populate in the reader's results. Then, they can scroll through their search results and see the five keywords for each Bite to get a quick overview of the book's focus. When a Bite catches their eye, they can click through and read the Bite {excerpt} that the author has chosen to share with them. At the end, if they want more, they can click through and buy from their favorite retailer or click \"See Related Bites\" to experience more of the book.\n\nIn today's day and age, we are all so busy and have limited time to actually partake of our chosen hobbies. For a reader, let's say they've set aside one hour to read. Nobody wants to spend forty-five minutes looking for a book and the next 15 realizing they don't connect to the writing, because they made their decision based on a blurb instead of the author's writing. Bites give the reader a better way of finding EXACTLY what they're in the mood for and an effficient way of determining if that book is for them.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "Regarding samples that are available from retailers, we like to consider the analogy of a movie trailer. If I were to suggest you go see a new movie, I'd never say, \"Hey, Erik! This movie was awesome! Go watch the first three minutes and see what you think!\" I'd send you the trailer. That way, you'd get to experience the pacing, the cinematography, the acting—all while being drawn into the story, so that you need to know what happens next. That's what Bites do. They allow a reader to experience high-level scenes of the author's choosing—not the first few pages—to really get a sense of the writing and connect on a deeper level with the characters.\n\nWe also contend that Bites are the reason that our affiliate conversion is 3.5x that of an average author's affiliate conversion on Amazon. Authors are only sharing covers and blurbs with their links. On Book+Main, authors connect with the reader through Bites.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "Bites Give Books Longevity\n\nLastly, I should also mention that if a reader were searching for a \"second-chance romance with a strong female lead set in Manhattan\" on Amazon or any other retailer, their search results would be populated by books that have those words in the title. And more than likely, books that were 1-3 months old, even if the perfect book for them is, let's say, six years old. On Book+Main, the most important thing in a search is that the Bite matches what the reader is looking for—not popularity, not book sales, not an author's name, and not when it was released.\n\nWe built Book+Main because the way that readers find books today is broken and we believe that Bites, attached to a robust search engine, are the best way for a reader to find a book with the greatest amount of certainty that they're going to love it before they press that purchase button.\n\nI hope that helps answer your question.",
               "replyList": null
            },
            {
               "commenter": "Erik Van de Water",
               "message": "@tracey-suppo Thank you for your very thorough reply!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jennifer Behm",
         "message": "I like that you said you would include more genre's down the road!",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@jennifer-behm Hi, Jennifer! After we establish a solid foundation in the Romance genre, we will explore the possibility of expanding into other genres and which ones best fit our model. We have seen a lot of interest in Young Adult, specifically.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Anthony Akeman",
         "message": "Hope this isn't an odd question. How will this work with ereaders? I just didn't see or hear any mentions of them. And in your video you were reading hard copy book. Thanks",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@anthony-akeman Hi Anthony, we have a \"How It Works\" section that explains how readers discover and purchase books as well as a video walking you through the process above. Through our platform, readers can buy ebooks or audiobooks from their favorite retailers, including Amazon, Apple Books, B&N or Kobo. We do have a paperback in the video, but our readers can purchase paperbacks through the retailers that carry them if that's their preference. Additionally, in our video, we also show us using the app on my phone. Hope that's helpful in explaining the platform further.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Dohan Ventures Corp.",
         "message": "Hi, will it be your goal to pay your investors dividends?\n- Jeremy",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@dohan-ventures-corp Hi, Jeremy. We are an early stage venture looking to devote capital and resources to growth. As these are long-term securities, consideration should be given to appreciation of investments over time, rather than recurring payments based off of profits.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "juliano fernandes",
         "message": "Congrats on hitting your goal",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@juliano-fernandes Thanks, Juliano! We've hit our first two milestones {$25k and $50k}, but we're still raising! Once we hit $300k, we have an offline investor committed at $100k. Looking forward to hitting that next goal!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Zach Noland",
         "message": "Congrats, this looks like an interesting opportunity.\n\nWhat are you seeing for DAU, MAU and DAU/MAU (stickiness)?",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@zach-noland Hi Zach, thanks for the great questions!\n\nPlease note that the following information is pulled from Google Analytics and Firebase. While we are currently collecting the raw data needed for user session-based analytics, we are still in the process of building the tools and queries necessary to glean insight from that data.\n\nLooking at the trailing 6 months, which we feel provides a meaningful representation of user engagement, we're seeing an average of 10,215 MAU for Web and iOS/Android combined, approximately 24% of registered users. Over the same period of time, we're seeing an average of 1,165 DAU, putting the DAU/MAU at 11.4%.\n\nIt is important to understand our user behavior when considering these metrics. Currently, the strongest features on our platform are our Bites and the ability for our readers to discover the stories they're seeking. For this reason, the majority of our users come to Book+Main when they're looking for a new book to read. There are many that come for exclusives and serials as well, but the majority are coming to find new reads. Given the fact that 46% of romance readers read more than one book per week, that bodes well for us. However, if a reader discovers a new-to-them author on Book+Main and then proceeds to read their entire backlist after getting hooked on their first book {which could literally be dozens of books}, it could be some time before that user returns.\n\nFurthering this point, looking at user behavior over the last six months in Google Analytics, we can see that there were 618 sessions and more than 2,800 page views that occurred 121-364 \"Days Since Last Session.\" Additionally, 1,587 session and 6,954 page views from 61-120 \"Days Since Last Session.\" It's important to understand these behaviors, because it tells us that Bites are effective in connecting readers to new authors, but it also tells us that we have a great deal of room to grow with new functionality.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "Being lifelong romance readers, we understand this community and are keenly aware {both as individuals and with the aide of our author, blogger and reader focus groups} of the needs of this community. We have an extensive product roadmap full of unique features that we believe will serve this community in a way that no other platform does. We are very confident that as we complete this raise and roll out these new features, our MAU, DAU and stickiness will increase considerably.",
               "replyList": null
            },
            {
               "commenter": "Zach Noland",
               "message": "@tracey-suppo I really appreciate the time you put into this response. All very helpful information. Your explanation for DAU/MAU makes sense. The metric probably isn't that useful for capturing the value you're providing. Especially since getting users off the platform to read your recommendations is actually the goal. It's great to see your team is looking at this. Thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Belinda Masse-Rainwater",
         "message": "Are you hiring? I am an avid book lover-reader! Will you be expanding to the New Age/Self-Help genres at some point?",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@belinda-masse-rainwater Hi Belinda, thanks so much for the interest, but we're not hiring at this time. As for expanding into other genres, after we establish a solid foundation in the Romance genre, we will explore the possibility of expanding into other genres and which ones best fit our model. We will certainly consider New Age/Self Help at that time.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Luke Sandler",
         "message": "There is a lot of opportunity in this space, so very keen to see this succeed. Can you give some more details on:\n\n1) How you expect your revenue projections to break down between the three channels - is this primarily a marketing tool for distributors, publishers or authors?\n\n2) What metrics are you seeing around engagement of the current community? e.g. how many users who read at least 3 bites go on to purchase a book? How many of those purchase a second book discovered through B+M?\n\n3) Can you clarify how B+M will compete with Goodreads for community hours? Amazon has the capacity to spend a great deal on Goodreads which already has a large community; what will make the B+M experience better for those members?",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@luke-sandler Hi Luke, thanks for the great questions!\n\n1. Book+Main Bites is primarily a marketing tool for authors and, in the future, publishers and other industry professionals. The breakdown of revenue projections is as follows: Advertising is 72%, Subscriptions are 22%, and Affiliate is 6%.\n\n2. While we are collecting the raw data needed for user session-based analytics, we are still in the process of building the tools and queries necessary to glean insight from this data. It's also important to note that once a reader has discovered an author on Book+Main Bites, the likelihood is that they will simply head to their favorite retailer for future purchases from that author.\n\nHowever, the metrics are proving that Bites sell books. We have just surpassed 1M Bite views on our platform. From these Bite views, there have been over 90k retail affiliate clicks. We are then seeing an average monthly conversion rate of 7% from affiliate link click-to-book purchases, more than 3.5X the industry standard for a typical author affiliate account {which averages 2% per our conversations with hundreds of authors}.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "3. There is no question that Amazon, and therefore Goodreads, has deep pockets. Goodreads is great at what they do for the book world at large. However, having been deeply entrenched in the romance book world for many years, Goodreads simply doesn't have the custom functionality that this community needs.\n\nAll functionality on Goodreads serves all genres, but the romance reader has very different reading habits and behaviors. As you likely know, 46% of romance readers read more than one book per week, while the typical American has read four books in the past twelve months. The reason this is so important is that romance readers are forever searching for new books and authors. The data on Goodreads is driven by the reader. On Book+Main, the content—and most important, the associated keywords—is driven by the author. This inherently builds a database that has greater accuracy and is more reliable.\n\nGiven our focus on romance, we are able to pivot and respond to the ever-changing romance industry. This is something Goodreads simply cannot respond to in the same way that we are able to. Raising this round will give us the capital to build more of the functionality we know this community wants and needs, and simply isn't available on any other platform.\n\nWe are also highly committed to the user experience. Per Romance Writers of America's annual survey, content is listed as a more important purchase influence than recommendations. Our platform is centered around content with our Bites. Goodreads' focus is on blurbs and reviews, not content. We believe this provides a much richer, and ultimately, more fruitful experience for the romance reader.",
               "replyList": null
            },
            {
               "commenter": "Luke Sandler",
               "message": "@tracey-suppo - thanks so much for the detailed response. Very helpful information.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jim DeLamater",
         "message": "It seems Books+Main could easily fold in additional genres. Numerous adult and children’s/youth/young adult Fiction genres and Self-Help/How-To. Surely there would be a plan to expand the market as Romance builds a solid foundation. Yes?",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@jim-delamater Hi, Jim. Thanks for the question! Absolutely. After we establish a solid foundation in the Romance genre, we will explore the possibility of expanding into other genres and which ones best fit our model. We have seen a lot of interest in Young Adult, specifically.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Brian Bain",
         "message": "This is a compelling idea, congratulations on launching your company. Can you share more info on monthly user growth numbers? You currently have 45k users and project to have 450k in 2020. I'm curious how you see you accomplishing that 10x growth in a year. I'm not questioning the possibility, but would like more info to help my investing decision. Thank you in advance.",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@brian-bain Hi Brian, I'm thrilled to answer this question as user growth is one of our primary focuses. Thank you for asking! Currently, new registrations average 1.4k per month. The 45k+ users currently registered on our platform have found us primarily through organic reach and word of mouth, as we've spent less than $3.5k in advertising since our launch in November '17.\n\nAs career-long marketers and experts in Google Adwords and digital advertising {since early 2000s}, Melissa and I are extremely confident in our ability to reach romance readers and convert them to Book+Main users.\n\nAccording to industry experts, 90% of romance readers are not a part of the \"romance book world\" on social media. They are on social media, but not involved in the romance community at large. Our goal is to introduce these readers to the Book+Main Bites platform and all it has to offer. However, it is more expensive and will take greater resources to effectively reach these readers than our current outreach program. Once we complete this round, we will roll out a full marketing campaign, allocating a significant portion of our raise to marketing and customer acquisition.\n\nWith 10% of romance readers already a part of the romance book world on social media, we have only begun to scratch the surface. We intend to continue building functionality that doesn't exist on any other platform, which will continue to draw those users to Book+Main. Given our experience in reaching this community, it's important to note that our marketing and customer acquisition dollars spent here will have even greater conversion.\n\nCombining our marketing expertise with marketing dollars from this raise, in addition to our unique value proposition for romance readers and authors, we strongly believe in our ability to capture an additional 400k users {0.5% of 75M romance readers in the US alone} within one year of being fully funded.",
               "replyList": null
            },
            {
               "commenter": "Brian Bain",
               "message": "@tracey-suppo Thanks for the quick and thorough reply, this is great and very helpful.\n\nA separate question, what does \"Book+Main\" mean? I feel foolish for asking as it's probably right in front of me somewhere but I can't find anything on the site or this page.\n\nThanks.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "@brian-bain Hi Brian, it's not a foolish question in the least! Our intention behind Book+Main is to evoke the days when readers used to go to their independent bookstore on Main Street to find new books, get recommendations, meet authors on tour, meet other readers and come for all things book related. Being a tech platform, we love the idea of having that same sense of connection for our readers and authors, hence the plus sign instead of an 'and' or ampersand, even if it's not face-to-face. See you at the corner of Book+Main! ;)",
               "replyList": null
            },
            {
               "commenter": "Brian Bain",
               "message": "@tracey-suppo Very cool! I like that.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "Are you focusing only on the romance genre? I'm interested and I will read romance novels on occasion especially if there are elements of science fiction or techno thriller in them. What's your exit plan?",
         "replyList": [
            {
               "commenter": "Tracey Suppo",
               "message": "@baron-huntington Hi, Baron, and thanks for the questions! Yes, given its substantial market size and the voraciousness of the romance reader, we are concentrating solely on the romance genre at this time. With our deep romance industry knowledge and connections, we are uniquely positioned to serve this community.\n\nRegarding an exit plan, our primary focus is on realizing the value and potential of this business. To do so, we must concentrate on three key objectives:\n\n1. Building a strong community of authors and readers\n2. Developing functionality that doesn't exist on any other book platform\n3. Generating the revenue necessary to support our continued growth\n\nGiven the strength of this market and our ability to build a platform and community to serve it well, we believe that could make us a prime candidate for an IPO or acquisition. Should we be approached for an acquisition, working with the right partner is of the utmost importance. We are building a community by readers, for readers. It is our belief that providing this community with what it deserves and needs is what will continue to make our company strong. It is important to us that any company interested in acquiring us shares this mission.\n\nLastly, we're thrilled that you read romance! If you join Book+Main Bites, you can search for Bites tagged with Sci-Fi, Spies or Thriller. Hope you find some new authors and books to connect with!",
               "replyList": null
            },
            {
               "commenter": "Baron Huntington",
               "message": "@tracey-suppo Okay, I'm in, but I do hope that you will strongly consider adding science fiction and thrillers. There's a few authors that I know of that write romance and sci fi under different aliases.",
               "replyList": null
            },
            {
               "commenter": "Tracey Suppo",
               "message": "@baron-huntington Hi, Baron! We're thrilled you're joining us in this campaign. We are certainly open to adding genres in the future and will definitely keep your request in mind.",
               "replyList": null
            }
         ]
      }
   ],
   "updates": [
      {
         "title": "2 Interviews and Over 200 Investors!",
         "description": "Such an exciting week! Two feature interviews went live AND we just exceeded 200 investors in Book+Main through the Republic campaign!\nFirst up, a feature on Republic's Superhero blog. Check it out here.\nSecond, an interview with my Alma Mater, Boston University, which you can check out here.\nOnly a short time remains to get in on the ground floor and become and investor in the platform where Big Data Meets Romance. We'd greatly appreciate you sharing this opportunity with friends, family and colleagues.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Book+Main launches Bitecamp!",
         "description": "This past week, we launched Bitecamp—a four-week self-guided training to improve authors' discoverability, increase traction on their Bites and help them get the most out of Book+Main. The program includes weekly emails, challenges and checklists for an author to complete. In less than one week, more than 120 authors have enrolled in the program because they see the potential of the platform and want to maximize their Book+Main experience to its fullest!\nPrior to launching Bitecamp, analytics were made forward-facing for authors so they can gauge the efficacy of their time spent at Book+Main. While paid ads on social media in the romance book world are considered successful with a 5% conversion, the average conversion rate of Bites to retail clickthroughs is double that at 10%. With over 1M Bites views and more than 100,000 retail clickthroughs, it's clear that Bites Sell Books.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Romance: Big Data Meets Big Business",
         "description": "We were thrilled to join Scott Kitun of Technori on WGN Radio for their Startup Showcase this past Saturday. We had an incredible chat and talked about everything from our revenue model to our ability to use data and searches to predict trends in the industry—and yes, even 80's hair bands! Here's a small outtake: \nScott: Your setup, based on what you just said for analytics and for data, I'm assuming it's a very heavy data play, correct?Tracey: \"Yes, back-end for us as well in terms of knowledge and information for authors, beyond just the metrics of what they're seeing. There's a lot of data in terms of trends, what readers are searching for—that's a big play...There are trends, right? We can see those coming.\"\nTo listen to the entire interview, click here.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Book+Main Featured on Chicago Inno!",
         "description": "We're thrilled to be featured on Chicago Inno, a digital news and events company covering Chicago startups and technology. Check out the article here.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Book+Main Named to iLab Pitch Contest's Qualifier Round",
         "description": "We're thrilled to announce that we were just named to iLab Pitch Contest's Qualifier Round. This round features 10 Midwest or Canadian companies that are women-led or women-owned and have a retail product, service, technology, or payment start up. \nThree finalists from this group will be chosen to compete at their Chicago Community Day on June 26. The winner will be invited to their Flagship Community Day in NYC on September 19, as a part of their Innovation Lab featuring new solutions and pilots for retail and direct-to-consumer companies looking at the future of business.\nSupporters of this initiative include 1871, PayPal, OSF Commerce, Salesforce, Capgemini, and Streetfight.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 200% 🔥",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Book+Main at Book Lovers Con in NOLA!",
         "description": "Melissa and I had an exceptional time at Book Lovers Con this past week in New Orleans. We moderated a panel for New York Times bestselling authors Kristen Proby and Kristen Ashley, presented a panel, \"Social Media and the Romance World,\" and hosted one-on-ones with numerous authors.\nWe met new romance authors looking to connect with more readers who either onboarded onsite or are onboarding this week. We also got to meet up with other industry professionals, readers, and authors we've known for years. \nBook Lovers Con 2019 featured over 215 Attending Authors, and sponsors included Harlequin, Macmillan, Penguin Random House, Hachette Book Group, 1001 Dark Nights, and Sourcebooks, amongst others.\nPS. Beignets were a requirement!",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 100% 💥",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 90% 🏁",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 50% 🍹",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 30% 🎂",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Launched on Republic 🚀",
         "description": null,
         "comments": null,
         "updateDate": null
      }
   ],
   "reviews": [
      {
         "commenter": "Tracey Jerald",
         "message": "Book+Main connects authors and readers in a way no other social forum can; using their own words. Without fear of being blocked or banned, as an author I am able to share content with readers to give them more. $100",
         "replyList": null
      },
      {
         "commenter": "lois Xenakis",
         "message": "I love the idea that two women are behind this company. They are opening the door for many stories and authors to be discovered. I myself and a writer and that is a plus. $150",
         "replyList": null
      },
      {
         "commenter": "Georgina Penney",
         "message": "I really love the idea of a positive space to share my books with readers. $1,000",
         "replyList": null
      },
      {
         "commenter": "Ankur Gupta",
         "message": "Book+Main has that rare combination of an exceptional platform and a top notch organizational leadership. I am thrilled to support Book+Main and to share in their amazing story... $5,000",
         "replyList": null
      },
      {
         "commenter": "Kali Brixton",
         "message": "I am a future author in want to invest in my community. Also, I plan to use the author subscription when I publish to expand more audience 💋 As a reader, I love the idea of a more focused book recommendation platform 💖 $100",
         "replyList": null
      },
      {
         "commenter": "Arwed Kubisch",
         "message": "For centuries and a little longer exist love stories.. tragic, very sad and incredibly beautiful ones. Book+Main is the perfect place to look for such tales, because they give you the opportunity to discover completely new directions for topic Nr. 1. $100",
         "replyList": null
      },
      {
         "commenter": "Karen Hulseman",
         "message": "I believe in the platform and the direction to improve visibility to romance readers. $100",
         "replyList": null
      },
      {
         "commenter": "Mark Riashi",
         "message": "App capabilities and positive acceptance in the market to date. $1,000",
         "replyList": null
      },
      {
         "commenter": "Jamie Migdal",
         "message": "Tracy's vision is exciting and I love a strong female entrepreneur! $100",
         "replyList": null
      },
      {
         "commenter": "Guy Levy",
         "message": "Excellent company. Excellent leadership. $1,800",
         "replyList": null
      },
      {
         "commenter": "Girish Manchanda",
         "message": "I believe in the concept. $100",
         "replyList": null
      },
      {
         "commenter": "Samuel Oppong",
         "message": "I invested because I believe in this company!! $100",
         "replyList": null
      },
      {
         "commenter": "Alyse Benjamin",
         "message": "I love reading and anything that promotes happiness. $100",
         "replyList": null
      },
      {
         "commenter": "Yudhi Arief",
         "message": "I need more money $2,200",
         "replyList": null
      },
      {
         "commenter": "Derrik Oates",
         "message": "I like ensuring people aren't always tethered to a digital device and appreciates the value of books. Also like supporting female businesses $100",
         "replyList": null
      },
      {
         "commenter": "Derek Talley",
         "message": "I invested cause this has a lot of potential across all genres other than romance. $100",
         "replyList": null
      },
      {
         "commenter": "Bethany Lopez",
         "message": "I believe in the company $100",
         "replyList": null
      },
      {
         "commenter": "Kimberly Willison",
         "message": "A Perfect Marriage ! Kim W. $100",
         "replyList": null
      },
      {
         "commenter": "Michael Gaslowitz",
         "message": "It usually pays off to hang around smart people with good ideas. Amount is private",
         "replyList": null
      },
      {
         "commenter": "Monica Murphy",
         "message": "I believe in the people that have created this company. I also feel that the “Bites” have been, and will continue to be a great tool for romance readers and authors - without the issues that plague social media outlets. $100",
         "replyList": null
      },
      {
         "commenter": "Natasha King",
         "message": "Love this company and the concept it brings to readers $200",
         "replyList": null
      },
      {
         "commenter": "Tina Horkey",
         "message": "Making my sisters dream come true $100",
         "replyList": null
      },
      {
         "commenter": "Marlon Lane",
         "message": "My sister enjoys writing about romance. Maybe this could give her the platform grow. I’d love to see her excel along wit the company! $100",
         "replyList": null
      },
      {
         "commenter": "Ja Le",
         "message": "Personally an avid reader and professionally looking to support more female founders. $100",
         "replyList": null
      },
      {
         "commenter": "Terry Sager",
         "message": "This is my Daughters business. $300.00 $300",
         "replyList": null
      },
      {
         "commenter": "Jessica Adams",
         "message": "I think Tracey is a Dynamo and I am looking forward to seeing where she takes Book + Main. $200",
         "replyList": null
      },
      {
         "commenter": "Nancy White",
         "message": "I believe in this company and what it can do to bring authors and readers together without barriers. $1,000",
         "replyList": null
      },
      {
         "commenter": "Thomas Burroughs",
         "message": "my wife is a published Historical Romance author $100",
         "replyList": null
      },
      {
         "commenter": "Sandra Rusch",
         "message": "I am a romance reader and I liked female entrepreneurs! And the concept! $100",
         "replyList": null
      },
      {
         "commenter": "Elizabeth OBum",
         "message": "Just to show my support. $100",
         "replyList": null
      },
      {
         "commenter": "Timothy Cronin",
         "message": "This has great potential especially if they expand into other genres. $100",
         "replyList": null
      },
      {
         "commenter": "James Findlay",
         "message": "investment $100",
         "replyList": null
      },
      {
         "commenter": "Natalie Marion",
         "message": "I love the concept and the fact that I am supporting a female CEO. $100",
         "replyList": null
      },
      {
         "commenter": "Frances Cross",
         "message": "I'm a romance author and book+main rocks! Any investment in romance is worthwhile. :) $100",
         "replyList": null
      },
      {
         "commenter": "Deatres Bagby",
         "message": "A space for readers to find titles and authors is something worth investing in and make grow. $2,000",
         "replyList": null
      },
      {
         "commenter": "michael hetchler",
         "message": "My wife reads those kinds of books, and i honestly believe it influences our love life! keep em communing....... $100",
         "replyList": null
      },
      {
         "commenter": "Lon Levy",
         "message": "An impressive business model. Amount is private",
         "replyList": null
      }
   ],
   "content": "Deal highlights \nMarketplace pairing romance authors & readers through 'Bites'—excerpts specifically chosen by the author—including exclusive sneak peeks, serials and bonus scenes\nRomance is the #1 best-selling genre in the U.S. at $1.4B+ annually\nOver 45,000 registered users on the platform, including more than 3,400 authors \nReaders from 150+ countries on Book+Main\n$20K+ in advertising and affiliate revenue \nPublishing is a $40B industry in the U.S. alone \nRomance novels are #1 in book sales \nRomance is the highest grossing genre representing almost one-third of all fiction sold. Over 75M Americans (estimated at 2-3x globally) read romance novels each year, with 46% reading more than one novel per week. As the romance genre lends itself towards self publishing, authors are turning to online platforms to help them promote their publications and are willing to pay a premium to display their work. There is a huge market not only for those interested in buying and reading romance novels, but also for the authors who’d like a place to share their work in a space dedicated to romance readers.\n\nVisibility & Discoverability\nIn an extremely competitive, over-saturated market, authors spend too much time and too much money marketing their books to the wrong readers. Readers waste inordinate amounts of time and money trying to find their next read, because the way they find books today is broken. Currently, readers are only presented with book covers and ‘blurbs,’ synopses oftentimes not written by the author, but also mismatched categories and searches that are weighed down by a retailer’s algorithms. \nBook+Main gives readers a search tool that uses a vast array of keywords that connect them directly to an author’s words, while also giving authors the tools they need to immediately connect their work to readers in search of what they’re writing.\n\nBook+Main: literary matchmaker for readers and authors \nBook+Main provides a sales and marketing tool hosted on a platform comprised of an all-romance audience. Authors upload Bites—excerpts or bonus content from their novels—that are searchable with more than 350 genre-specific keywords. This creates interest in their work, allows the reader to immediately get immersed in the story, and prevents their novel from getting lost. For our authors, Bites not only introduce them to new readers, they have also proven to be a powerful tool in exposing old and new readers alike to their entire catalog of books, not only new releases. And, Bites have no shelf life. If an author posts a Bite today and a reader searches for related keywords, that Bite will be served up for years to come. Bites posted over a year ago still sell books today.  \nReaders search the 350+ genre-specific keywords to find Bites that match exactly what they’re looking for. Bites have proven to be an accurate and efficient way for a reader to find and experience a book before they buy. Readers agree that Bites are better than samples because they are curated by the author to show the highlights of the book. \nFinally, Book+Main builds a community of romance enthusiasts, by incorporating social media components (like, comment, share, etc.), to help create discussions around the books readers love, while also giving more exposure to an author’s work. Book+Main has a social media feel, but is a discovery tool first and foremost.  \n\n\n \n\nThree revenue sources\n1. Affiliate Fees: Book+Main earns an affiliate fee on books sold from each of the retailers available on the platform—Amazon, Apple Books, Kobo, Barnes & Noble and Audible.\n2. Advertising: In a niche market, the right balance between advertising and engagement is critical. At Book+Main, we are developing three forms of advertising that give the author exceptional access to the RIGHT readers—those seeking what they're writing, who do not already follow them— while ensuring that a reader is served up advertising content that truly speaks to them. This will allow for greater reader engagement and increased author interest based upon its efficacy.\n3. Author Subscriptions: We have been transparent since day one that Book+Main Bites will be a paid platform for authors. Once subscriptions go into effect, authors will enjoy a 30-day trial with a guided experience to ensure they make the most of their trial period. Standard subscriptions will be $9/month or $99/year. Premium subscriptions will be introduced later in the year. Only published romance authors are eligible for author accounts. This ensures authors are not competing with non-published authors and increases the value of establishing an author account on Book+Main. Reader accounts are free.\n\nEngaging a global audience\nSince launch, Book+Main has engaged over 45,000 registered users, including 3,400+ authors, in more than 150 countries. \nAuthors on the platform range from debut authors to New York Times bestsellers. Of the 3,400 authors on Book+Main Bites:\nAmazon updates author rankings every hour based on sales. These numbers are based on rankings from March 12, 2019 @ 8 PM.\n\nOur financial models predict the following growth trajectories over the next three years. These financial projections are contingent upon raising at least $600K in 2019 from this and possibly subsequent offerings. \nPlease note, Book+Main has a limited history upon which an estimation of the Company's future performance can be made. The Company’s proposed operations are subject to all business risks associated with new enterprises.  The likelihood of the Company’s success must be considered in light of the problems, expenses, difficulties, complications, and delays frequently encountered in connection with the expansion of a business, operation in a competitive industry, and the continued development of advertising, promotions and a corresponding customer base.  There is a possibility that the Company could sustain losses in the future.  There can be no assurances that we will operate profitably.\nAs seen in:\n\nRakuten Kobo features interviews with bestselling authors and industry experts. who share practical advice you can use to improve your writing and sell more books.\nKobo interviewed our CMO, Melissa Saneholtz, about her journey in this industry and the important role a virtual assistant can play. Having worked one-on-one with a New York Times bestselling author as a virtual assistant {as well as 150+ other authors in a variety of roles}, she was able to shed light on the career path one can take and the knowledge one can gain working your way up through this industry. You can listen to the podcast here.\n\nBook+Main is a go-to platform for romance enthusiasts\nBook+Main is loved by both authors and readers alike. For authors, Book+Main provides a platform for their work to be discovered and purchased from both current and new readers. This gives readers direct access to their favorite authors and opportunities to explore and discover other great reads and authors in the genre.\n\nThe perfect mix of discoverability and community—because one without the other is not enough\nIt is also important to note that many platforms censor content, not only images, but words as well. While we do not allow nudity, we are an 18+ site and we do allow risqué imagery. We do not censor explicit language. We believe an author should have the freedom to connect with their readers without those restrictions, and readers should have the right to read and see what they deem appropriate. All Bites are given a \"flame rating\" by the author to denote how \"hot\" the Bite is. Readers can then select their Max Flame Rating preference to ensure they see what they want and what they don't. The power to choose is in the reader's hands.\n\nGrowing our readership and platform\nIn addition to bootstrapping the first twelve months, Book+Main has raised over $300K from Angels and Friends & Family. With funds raised in this round, Book+Main plans to expand the platform and team as well as dedicate marketing dollars to customer acquisition. We will also provide more resources to readers, including a more robust algorithm for recommendations based on their preferences and activity. We will also develop new, proprietary functionality to connect authors and readers that doesn't exist on any other platform, and flesh out opportunities for Book+Main to be integrated into third-party sites and platforms.\n\nFall in love with Book+Main!\nTogether, we can change the romance industry to better connect authors with readers, save them both time and money, and give this massive market a place to call home.Why others invested\nSee all reviews (38)\nBook+Main has that rare combination of an exceptional platform and a top notch organizational leadership. I am thrilled to support Book+Main and to share in their amazing story...\nAnkur G.\n4 months ago\nBook+Main connects authors and readers in a way no other social forum can; using their own words. Without fear of being blocked or banned, as an author I am able to share content with readers to give them more.\nTracey J.\n3 months ago\nI am a future author in want to invest in my community. Also, I plan to use the author subscription when I publish to expand more audience 💋 As a reader, I love the idea of a more focused book recommendation platform 💖\nKali B.\n3 months agoAbout Book+Main\nLegal Name\nBook+Main, Inc.\nFounded\nMar 2017\nForm\nDelaware Corporation\nEmployees\n0\nWebsite\nhttp://bookandmain.com\nSocial Media\nHeadquarters\n222 West Merchandise Mart Plaza , Chicago, ILBook+Main Team\nTracey Suppo\nFounder & CEO\nTracey’s 25-year marketing career includes fashion, cosmetics, live entertainment & real estate. Her most recent role was VP, Marketing at a national commercial RE firm. A lifelong reader, she owns a romance blog/group with 20k+ readers & authors.\nMelissa Saneholtz\nPartner & CMO\n10+ years in sales and marketing. 4 years in the publishing industry. Melissa has built a strong network within romance. Under her marketing guidance, many authors have achieved USA Today, New York Times, and countless Amazon bestseller titles.\nKyle Backer\nCOO\nWith over 15 years of experience optimizing business operations, Kyle effectively increases efficiency through software design and technology management. He directs company operations and product management for Book+Main.\nToni McCarty\nCFO\n20+ years of experience in business finance and accounting. Toni has experience in developing accounting systems, overseeing accounting departments and is responsible for financial reporting and forecast modeling.\nRobert 'Bo' Davis\nActing CTO\n15 yrs software development experience. Has overseen technical direction of products supporting millions of users. *Acting: engaged in that capacity, but not formally appointed to the position by the Company and its Directors\nKristy Lapidus\nChief Culture Officer\nKristy Lapidus has spent the last 16 years consulting with senior leaders on complex digital business projects. She focuses on building high performing teams, optimizing organization design, and guiding the delivery of delightful software, fast.\nBob Cramer\nAdvisor\nBeth Cranford\nCustomer Service\nAllie Curry\nAndroid Developer\nMatt Evanoff\nFront-End Developer\nJess Fadden\nPromotions Manager\nMike Halerz\nDigital Media\nDave Henke\nTechnical Advisor\nJulie Laszczak\nSocial Media Strategist\nBrendan Murphy\nJunior Full Stack Developer\nMilo Schuman\nSenior Full Stack Developer\nJessica Wynne\nUI/UX DesignerFAQ\nHow do I earn a return?\nHow do I earn a return?\nWe are using Republic's Crowd SAFE security. Learn how this translates into a return on investment here.\nStill have questions? Check the discussion section.Risks\nWe have a limited operating history upon which you can evaluate our performance, and accordingly, our prospects must be considered in light of the risks that any new company encounters.\nThe Company is still in an early phase and is just beginning to implement its business plan. There can be no assurance that it will ever operate profitably. The likelihood of its success should be considered in light of the problems, expenses, difficulties, complications and delays usually encountered by companies in their early stages of development. The Company may not be successful in attaining the objectives necessary for it to overcome these risks and uncertainties.\nThe amount of capital the Company is attempting to raise in this Offering may not be enough to sustain the Company’s current business plan.\nWe rely on other companies to provide components and services for our products.\nThe Company is not subject to Sarbanes-Oxley regulations and may lack the financial controls and procedures of public companies.\nWe may implement new lines of business or offer new products and services within existing lines of business.\nShow all Risks"
}