{
   "name": "BlueWorldVoyages",
   "url": "https://republic.co/blue-world-voyages",
   "dealTerms": [
      {
         "Valuation cap": "$60,000,000"
      },
      {
         "Discount": "10%"
      },
      {
         "Minimum investment": "$250"
      },
      {
         "Type of security": "Crowd SAFE · Learn more"
      },
      {
         "Funding goal": "$25,000 – $245,000"
      },
      {
         "Deadline": "February 2, 2020 at 2:59 AM (EST)"
      }
   ],
   "discussion": [
      {
         "commenter": "Rosie Fitz",
         "message": "Quick questions, I understand there is no destinations advertised but I can't seem to find a duration or a price for the planed cruises either. I would like some ball park for 2 reason. One, would I take this cruise myself and two, do I think its worth investing in this cruise line. Would there be option like 5, 7 and 14 day cruise ? basically how that will work.",
         "replyList": [
            {
               "commenter": "Clarice MacGarvey",
               "message": "@rosie-flynn Hi Rosie. Thanks so much for your interest in Blue World Voyages, and for your question. For our first season, we are planning 7-day voyages. The ship will roam, visiting different ports. A week's cruise in one of our standard suites (roughly 2x the size of the standard suite/cabin on other vessels) will be priced from around $ 3,500 per person, plus port charges (airfare not included). The price does include all meals in any of our four specialty dining venues; complementary house wines/beer with lunch/dinner; wi-fi, laundry service, many shore excursions, signature events ashore on each cruise, and more. Thank you again, Rosie. We look forward to welcoming you onboard! Clarice MacGarvey, Blue World Voyages",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Brian Belley",
         "message": "John - can you please talk about what you have accomplished since your last raise on WeFunder, and what those funds went towards?\n\nThe concept and business are interesting, but I'd like to better understand how big of a hurdle there is to getting your first ship on the market.\n\nBesides this campaign and the Owners Residence buyers, how much additional capital do you expect to need in order to hit your 2021 sail date?",
         "replyList": [
            {
               "commenter": "Gene Meehan",
               "message": "@brian-belley\nHello Brian,\nMuch has developed since our WeFunder raise.\n\nA well established NYC investment bank which specializes in capital formation for Maritime projects, has just the week rolled out our final Series A round. We expect this to go very well and be completed within the next 6-8 weeks.\n\nWe have also received a better than expected response towards the purchase of our Owners Residences. As you know we are offering 40 one and two bedroom units. To date we have over 250 interested buyers. It's this part of our business model that brings the most capital to our project. ($105M after expenses). We have started to contact these parties and to our surprise, many of them want to purchase a residence and invest in our Series A round. We are soon to start putting deposits into escrow.\n\nAs to where funds are being spent; engineering, designs and renderings, PR legal,travel etc. We have all the normal expenses that you would expect of a start-up cruise line.\n\nBrian, our primary goal of crowdfunding was never to raise enough capital to start the line, this would be impossible. Instead we are doing this to create a 500 member 'VIP Founders Club'. Similar to a frequent flyers club for an airline. We would like to have 500 Founders who we can treat royally when they come aboard, but also who we hope will become brand ambassadors for us. This is our goal. And we hope to get there with this raise.\n\nBrian, thanks for your question.\n\nGene",
               "replyList": null
            },
            {
               "commenter": "Brian Belley",
               "message": "@gene-meehan **Gene - first off, my sincere apologies; I'm not sure where I got John from!\n\nThank you for the quick response. It indeed seemed that the crowdfunding raise wouldn't make much of a dent in the capital that is required, so thank you for clarifying the purpose of this campaign.\n\nAnd congratulations on what sounds like a lot of progress in a short amount of time.\n\nThank you again for your timely and thoughtful reply.",
               "replyList": null
            },
            {
               "commenter": "Brian Belley",
               "message": "@gene-meehan Gene - I realize that in addressing John, I was mistakenly thinking of the former Co-Founder/CEO.\n\nCan you please comment on the change in leadership? When that occurred, anything you are able to say about reasons for the change, etc.? Has that resulted in any changes in the vision of the company?",
               "replyList": null
            },
            {
               "commenter": "Gene Meehan",
               "message": "@brian-belley\n\nBrian, If you are talking about John Richards here's what I can tell you. John is a great guy, but based on his very sucessful background, he has all kinds of offers, all the time. As you see, this has taken us more time than we thought, so regretfully John has moved on. However, we are being approached by several cruise industry leaders, simply because we are doing something unique and different. We are finding that many of the the the top people in the industry are unhappy that the revenue model has changed. Cruising used to be a more interesting and romantic travel opportunity, now it's all about on-board revenues now with the ship as the destination. We are assembling a team of roll-up your sleeves start up folks who believe in our concept and will work night and day to make it happen.\n\nIt's exciting, and we are happy to be breaking the mold!!\n\nGene",
               "replyList": null
            },
            {
               "commenter": "Brian Belley",
               "message": "@gene-meehan\nThank you, Gene. I appreciate your honest responses. It sounds like you and your team are already shaking things up in the industry, and I'm excited to see where it leads (especially being an avid cruiser, as well as extremely health-conscious consumer myself!).",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "Blue World Voyages was a Kingscrowd Top Deal last year.",
         "replyList": []
      },
      {
         "commenter": "Baron Huntington",
         "message": "For those interested Blue World Voyages did a raise last year on Wefunder.\nDetails of wefunder.com/blue.world.voyages",
         "replyList": []
      }
   ],
   "updates": [
      {
         "title": "Blue World Voyages Co-Founder/CEO Fredy Dellis Interviewed by BBC",
         "description": "Our cofounder and acting CEO, Fredy Dellis, was interviewed by the BBC News on Monday, August 19. Fredy, a seasoned business executive and the former President/CEO  of the World of ResidenSea did an excellent job of defining the Blue World Voyages concept for BBC audiences worldwide. Click the link below to launch the interview:\nhttps://www.executiveinterviews.com/delivery/v1/mini/defaultrwd.asp?CI=Y&order=UK08650a&fbclid=IwAR3AmRSeoq0Jq9hZ1yM_xsIkWgqdW2oQ94ZC1_gnNSQdCs9ZmrScAou6f84",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Launched on Republic 🚀",
         "description": null,
         "comments": null,
         "updateDate": null
      }
   ],
   "reviews": [
      {
         "commenter": "Carl Zelman",
         "message": "I invested because I believe that the concept of rest, relaxation and keeping healthy is a perfect path to success. $50",
         "replyList": null
      },
      {
         "commenter": "Clifford Foster",
         "message": "I think this is a very interesting concept, I believe in a healthy life style and what better way to enjoy a vacation than in a health conscious environment on a cruise ship. $250",
         "replyList": null
      },
      {
         "commenter": "Walter Fyler",
         "message": "I think this is the kind of cruise that the next generation will seek...a menagerie of social activities to keep the soul active and healthy as one ventures from one destination adventure to the next...no emphasis on a sedentary lounge lifestyle! $250",
         "replyList": null
      },
      {
         "commenter": "Thomas Waller",
         "message": "interesting concept for cruises $100",
         "replyList": null
      }
   ],
   "content": "Deal highlights \nIn addition to their Crowd SAFE units, investors of $500 or more will receive credit (in the amount of their investment) towards their first cruise and become members of 500-member VIP Founders Club\nBlue World currently has 250+ interested buyers for the 40 luxury Owners Residences for sale on our ship. These sales would provide for over 70% of overall project funding\nOur ship will feature all 5-star cabins roughly 2x the size of industry standards, plus the largest spa and fitness facility per passenger in the industry\nStrategic partnerships with leading U.S. sports and media companies now provide direct access to over 40 million active adults. European partners are being added to this list. Prior to launch, Blue World will have access to over 80 million active adults worldwide\n10,000+ followers on US website in just the past six months\nUnlike traditional cruise ships, each week, Blue World sails with all like-minded passengers: people who are already fit and healthy, or those looking to become fit and healthy\nBoard, executive team, and advisors have all held C-Level positions with leading spa, hospitality, cruise, and fitness brands\n\nUntil now, a healthy cruise vacation did not exist \nThe big ships have far too many people onboard and feel like floating amusement parks. The smaller luxury vessels tend to have older and more sedentary passengers. Vacations are very important “me” time. Now there’s cruise that matches your lifestyle.\n\n\nShip to shore, a radically different cruise experience\nNo water slides or slot machines? What kind of cruise ship is this? The kind that 41 million healthy, active adults have been waiting for. It’s designed for the next generation of health-conscious professionals, sports & fitness enthusiasts, and those in search of personal discoveries. Welcome to Active Lifestyle Cruising.\nA sample of our ship's amenities*\n*All renderings, plans, and amenities shown are proposed and conceptual only, and are based upon preliminary development plans which are subject to revisions and other changes.\nAn entire deck devoted to sports and fitness. Spacious functional training gym, bike fitting station, batting cages, golf, soccer and hockey simulators; spinning and TRX studios, an onboard Hank Haney Golf School, and more (including a sea-water lap pool). Plus, another entire deck dedicated to a state-of-art spa and wellness facilities. You’ll also discover farm-to-table cuisine, educational programs, guest lecturers, evening entertainment, and much more.\n\n\nUnique sea-water lap pool and swim platform\n\n\n\n\n\n\nThe largest functional training center at sea\n\n\n\n\n\nBike-fitting station, yoga studio, juice bar, sports simulators and Hank Haney Golf School\n\n\n\n\nThe Aft Therapy Pool\n\n\n\n\n\n\nLuxurious one and two bedroom Owners Residences \n\n\n\n\n\n\n\nOur mid-ship pool deck includes Bali-beds where you can watch a movie and then sleep under the stars\n\n\n\n\n\nThe Solarium\n\n\n\n\n\n\n\n\nFarm to Table Dining (one of 4 on-board speciality restaurants--all included in fare)\n\n\n\n\n\n\nBeautiful, spacious guest suites\n\n\n\n\nThe Blue World shoreside experience \nAs a smaller vessel, we take you to places big ships can't go - so you'll see and experience things they can't show you. And we provide the latest, highest-quality equipment and expert guides for the sports you love, whether you bike, hike, snorkel, scuba, surf, kayak, paddle board, play golf or practice yoga and meditation.\n\nTraction \nIn January 2018, we closed our seed-round for a total of $450K. There are currently three ships on the market that fit our design needs and size. All are immediately available. Both the seller and shipyard have offered financing. Our refit costs have been established by one of the leading industry designers.  Most of our ship's renderings and virtual tours are now in place.\nOur media partners are onboard with additional partners joining us soon. The combined following of targeted media and strategic partners exceeds 20M people. We expect to add an additional 20M in Europe as well.\nNow we're looking to sell out our 500 member Founder's Club. When successful, we expect this effort to raise $1M--a portion of this capital will be used as a deposit on the ship. \n\nIn the news \n\nStrategic partnerships \nThese companies give us direct access to over 30 million active adults. \nBusiness model \nWe intend to offer for sale 40 Owners Residences on the ship. We project the net revenue generated by these sales will be up to $105M. The company has initiated a registration campaign to attract interested buyers of these units. To date, we have 171 interested buyers for these 40 units. We expect this number to increase to over 300 within the next 3 months. The sale of our 40 Owners Residences is an important portion of our overall funding plan, and early market feedback is extremely positive. The revenue from these sales provides over 70% of funds needed to launch this product. The concept of a hybrid ship (both owners and passengers) will be a trademark of our company, when repeated on additional ships, will provide significant capital to grow our fleet with minimal to no dilution to early stage investors. Our current mailing lists and full-ship charters will ensure we meet 1st year occupancy goals. Passenger revenue from each sailing (at 80% occupancy) generates approximately $1M per week for 50 weeks per year. Our goal is to expand our fleet to three ships within 5 years.\n\nAll investors of $500 or more become members of our Founders Club\nAll investors of $500 or more immediately become members of the Blue World Voyages Founders Club, an exclusive group of passengers helping to design the perfect cruise experience tailored to their own active lifestyles.\n\nWe sail in 2021 \nWe are currently screening interested Owners Residence buyers. Once the ship is secured with a deposit and a firm delivery date established, we will place 40 of the interested buyers under contract along with an initial 25% deposit which will go into escrow. Our current discussions with the seller calls for delivery of the vessel in January of 2021. After a 120-day refit period, we estimate a launch date in the 2nd quarter of 2021, in the Mediterranean. Exact itineraries will be announced at a later date.\n\nThree ships in five years--that's our goal\nYear one occupancy is projected at 80%. \nThis will generate $49M in sales and put us well on our way towards a 2nd and then 3rd ship. That will bring us to a $400M+ market cap.\n\nMessage from our founder \nDear Investors, \nWithin the last few years, I have presented Blue World to thousands of people. So often I hear the same reply, “You know Gene, my husband (or wife) and I are not cruisers, but this, we would do.\" And I can tell you, I never get tired of hearing it!\nWe’re not setting out to ‘disrupt’ the cruise industry, in fact, the industry couldn’t be stronger. What we are doing, however, is creating a new and much-needed cruise product – one for active, healthy travelers.\nLittle by little, we have put together an amazing executive team. These very talented folks have grown major brands including Four Seasons, The World at ResidenSea, Hertz Rental Car, Burger King, Cunard and Seabourn Cruises, Canyon Ranch, and Apple. Everyone on my team has been drawn not to me, but to the concept, because they all personally ‘walk the walk’... they all lead active lives and see the great potential for this product. I am honored to work with such a talented group of people.\nWe've got great opportunities ahead. Our select media partners have a following of over 30M highly targeted consumers, and they are all anxious to help us grow our brand.\nWe have agents in beautiful European ports excited about breaking the traditional cruise excursion mold to serve a more active crowd. And we have available ships of the perfect size for Blue World coming on to the market just as we need them, in time to expand our fleet.\nThis is going to be an exciting voyage!\nWith your investment of $500 or more, you become a member of our 'Founders Club.' We will ask for your help in  choosing itineraries, selecting menus and planning shore excursions. You become part of our community. And together we explore the world, stay active and healthy, learn and do new things, and get to help others along the way.\nWe sincerely hope you will join us!\nGene Meehan\nFounder   \n\nThe team \nExecutive and development management \nGene Meehan - Founder & Chairman \nGene has been a leader in the spa and fitness industry for over 30 years. As an owner/operator of various award-winning clubs, he has designed facilities to be on the leading edge of industry trends. Experience extends from small gym operations to large multi-sport facilities and resort spa operations. A decision maker with the ability to motivate others, and to spot future trends in new markets. 30+ years of successful business operations and capital formation. An enthusiastic public speaker, with a strong personal interest in active lifestyles and good health. A competitive masters level rower, avid golfer and climber. An elected commissioner of town planning and recreation authorities, and an active fund raiser for various charities.\n\nFredy Dellis - Co-Founder & Acting CEO\nSenior international executive with expertise in P&L management, operations, business development, M&A, marketing and sales, and start-up ventures. A decision maker with strong corporate, start-up, turnaround and growth record. A leader who has successfully led large multinational organizations and built start-up operations. A planner, organizer and motivator who develops organizations for profitable growth. An experienced marketer and seller to high net worth individuals. A tenacious achiever who has successfully implemented new concepts amidst various challenges.\n\nMike Carrol - Vice President, Planning & Development\nA veteran compliance and development leader with over 32 years of experience with U.S. foreign policy agencies, including Acting Inspector General at the U.S. Agency for International Development and Director of Operations at the U.S. Information Agency focusing primarily on activities in the former Soviet Union and the Middle East; extensive experience in development and humanitarian assistance programs in developing countries and post-conflict societies; numerous high-level contacts with international development agencies, development banks (World Bank, Inter-American Development Bank, etc.)\n\nBrian O'Neill - Creative Director \nBrian has won virtually every international creative award, including numerous Cannes Lions and Clios. He has appeared as guest marketing consultant on CNBC, MSNBC, The Oprah Show, and featured in the WSJ and USA Today. Brian has lectured on branding/advertising at U.C. Berkeley, Stanford and professional conferences nationwide. He is a member of Master’s Hub, a collective of 18 distinguished marketing professionals around the world providing branding solutions to Chinese companies. \n\nDiane Trieste - Vice President, Wellness\nMy professional purpose is to lead and support the creation of partnerships and branding to optimize human health, lifestyle enhancements and a profitable business performance. As an experienced professional with a diverse portfolio of brand and product development, operations management, programming and training in the wellness and hospitality industry, I look to lead an organization in expanding opportunities for brand & financial success by vetting & capitalizing on the intersections between people, organizational culture and a sustainable environment. \n\nHal Gassenheimer - Chief Financial Officer \nConfidence-inspiring Finance Executive with 25+ years of experience growing entrepreneurial ventures. First class financial management: analysis, budgeting, reliable reporting, cost and cash management, assesses the keys to successful performance and establishes metrics/ KPIs, brings oversight and professionalism to financial operations to enable better business decisions, transparency, and financial controls in growing or struggling companies. Trusted advisor to the CEO and the Board on financial management, M&A, financing, restructuring and turnaround. Sets corporate objectives consistent with the strategy and solves complex business problems. Hands on leader of finance, treasury, accounting and other management teams. \n\nAdvisory board\nJoyce Landry - Advisory Committee, Groups & Charters, Blue World Voyages\nAs founder & CEO of Landry & King, the largest cruise ship charterer in the U.S., Joyce is one of the most influential women in the cruise industry. She was inducted into the \"Cruise Industry Hall of Fame\" in 2006.\n\n\n\n\nTim Andriola - Executive Chef, Blue World Voyages \nTim has trained and worked in some of the most prestigious kitchens in the U.S., including Chez Panisse, Charlie Trotter's, and Tra Vigne. He specializes in farm to table cuisine.About Blue World Voyages\nLegal Name\nBlue World Voyages, LLC\nFounded\nApr 2016\nForm\nFlorida LLC\nEmployees\n0\nWebsite\nhttp://www.blueworldvoyages.com\nSocial Media\nHeadquarters\n142 Sans Souci Drive , Coral Gables, FLBlue World Voyages Team\nGene Meehan\nFounder & Chairman\nHealth, fitness, and spa entrepreneur for over 30 years\nFredy Dellis\nCo-Founder & Acting CEO\nFormer President & CEO, The World at ResidenSea, President International, Burger King Corporation, President International, The Hertz Corporation\nHal Gassenheimer\nCFO\nHarvard MBA, Former Treasurer of Carnival Cruise Line, CFO Seabourn Cruise Line\nDiane Trieste\nVP Wellness\nMike Carrol\nVP Planning & Development\nJoyce Landry\nAdvisory Committee, Groups & Charters\nTim Andriola\nExecutive Chef\nBrian O'Neill\nCreative Director\nRick Atwood\nDesign DirectorFAQ\nHow do I earn a return?\nHow do I earn a return?\nWe are using Republic's Crowd SAFE security. Learn how this translates into a return on investment here.\nWhat is the planned name of the ship?\nDo you have an idea when the ship will be revealed?\nWho is handling the engineering, technical design, and project management for the refit?\nWhen will the refit of the vessel begin?\n\nShow all FAQRisks\nWe have a limited operating history upon which you can evaluate our performance, and accordingly, our prospects must be considered in light of the risks that any new company encounters.\nThe Company is still in an early phase and is just beginning to implement its business plan. There can be no assurance that it will ever operate profitably. The likelihood of its success should be considered in light of the problems, expenses, difficulties, complications and delays usually encountered by companies in their early stages of development. The Company may not be successful in attaining the objectives necessary for it to overcome these risks and uncertainties.\nThe amount of capital the Company is attempting to raise in this Offering will not be enough to fulfill the Company’s current business plan.\nWe rely on other companies to provide components and services for our products.\nAdverse world events impacting the ability or desire of people to travel may lead to a decline in demand for cruises.\nIncidents concerning our ships, guests or the cruise vacation industry as well as adverse weather conditions and other natural disasters may impact the satisfaction of our guests and crew and lead to reputational damage.\nShow all Risks"
}