{
   "name": "Bounty0x",
   "url": "https://republic.co/bounty0x",
   "dealTerms": [
      {
         "Valuation cap": "$5,000,000"
      },
      {
         "Discount": "20%"
      },
      {
         "Minimum investment": "$100"
      },
      {
         "Type of security": "Crowd SAFE · Learn more"
      },
      {
         "Funding goal": "$25,000 – $1,070,000"
      },
      {
         "Deadline": "January 1, 2020 at 2:59 AM (EST)"
      }
   ],
   "discussion": [
      {
         "commenter": "Maynard Wellman",
         "message": "This is a great idea. Ahead of their time since implementing this visionary approach. Opens up to an entirely new market. I do think many potential investors do not fully understand this concept. I read the pitch a few times and the light bulb finally came on for me. This is more exciting than just investing in crypto’s. Hope it is opened up to simple fiat as well. The larger the audience, the better in my opinion.",
         "replyList": []
      },
      {
         "commenter": "Andrew Bushnell",
         "message": "During campaigns I find that many companies are happy to keep potential investors informed and then go dark /silent soon after the campaign closes. The bi-weekly updates are great, but do you intent to maintain this update pace? What frequency have you been updating your previous investors at? thanks.",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@andrew-bushnell Transparency has always been at the core of our culture.\n\nIn addition to the bi-weekly company updates that we are currently publishing for our Republic campaign, we have also been publishing regular updates on our blog for our userbase for the past two years: blog.bounty0x.io\n\nOur investors can definitely expect updates to continue even after the campaign, both on our company blog and on social media (mainly Twitter).",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Andrew Bushnell",
         "message": "I anticipate that at some point crypto will be burdened with far more regulation (from both local, and federal, as well as international governments) than it currently has, what is your plan to mitigate this risk and pivot if needed? What are some mistakes you've made so far and how do you plan to minimize mistakes going forward?",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@andrew-bushnell Hey Andrew, thank you for your questions. Compliance is our top priority and we seek legal advice from industry professionals to make sure that Bounty0x is always fully compliant.\n\nA recent measure we took to ensure compliance was to implement a full identity verification system for our users, with the help of our partner Bloom.co.\n\nWe have made many mistakes since launching Bounty0x, but it's realizing those mistakes that helped us continue pushing Bounty0x forward.\n\nOne of the main mistakes I have personally identified was our exclusive focus on Initial Coin Offerings (ICOs) when we initially launched the platform. This significantly reduced the scope of Bounty0x. We are now in the process of restructuring the platform to make it more inclusive for other clients as well.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "juliano fernandes",
         "message": "Seems like a cool concept",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@juliano-fernandes Thank you!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Fabric DL",
         "message": "1) Could you share more detail on equity metrics? How many shares will be issued?\n\n2) How many shares issued to public and how many are for team? Is there any locking period?\n\n3) will shares be tradable?\n\n4) Can you elaborate $5M valuation cap? How funding goal $1.07M and valuation cap are related?\n\n5) What if max cap is not met? Will it affect valuation?\n\nThanks",
         "replyList": [
            {
               "commenter": "angelo adam",
               "message": "@fabric-dl See below for responses to your questions:\n\n1) Investors using the Crowd SAFE get a financial stake in the company, but are not immediately holders of stock--so we cannot say at this point how many shares will be issued. Investments are converted to equity if certain “trigger events” occur, such as the company’s acquisition or IPO. You can read up more on the Crowd SAFE and how it works here: republic.co/learn/investors/crowdsafe.\n\n2) See above\n\n3) There are no shares at this point. You can learn about transfer restrictions here:\n\n4) As for the $1.07M cap, this is the most a company can raise in a year according to SEC crowdfunding regulations. We didn't want to sell ourselves short, so we are shooting for the maximum. The funding goal here and our valuation cap are not connected.\n\n5) No, it won't. The valuation cap specifies the maximum valuation at which the investment converts into equity shares or cash. This means that investors, when a trigger event occurs, receive equity shares or cash at the valuation cap price—no matter the valuation at which the company sells. Therefore, the higher the valuation of the company at the time of sale, the greater the investor’s return.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "juliano fernandes",
         "message": "I love the product",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@juliano-fernandes Thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Stanislav Nikolaev",
         "message": "I have a lot of questions.\n1) Why are you using SAFE and not a DPA token?\n2) You conducted an ICO in 2017 with a minimum goal of $ 7 million and did not reach it. At the same time, ETH reached $ 1,300, and you should have had enough commission to sell.\n3) reviews and discussions on bitcointalk are terrible.\n4) Why need your platform if generosity and air drops are transmitted directly through ETH wallets?\n5)Is your offer legal for USA citizens?",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@stanislav-nikolaev Hello Stanislav, thank you for your questions.\n\n1) Our legal team advised that a Crowd SAFE round is the most favorable approach in our situation.\n2) Our minimum goal was, in fact, $1.75m and the token sale was oversubscribed and reached the goal almost immediately.\n3) Some of the reviews on Bitcointalk or elsewhere are not a collective outlook from our large user base we have onboard and although we aim to not have any negative feedback, its not always possible due to misunderstandings. If there is any particular point that you would like me to address, I will be more than happy to do so.\n4) We are not purely focused on airdrops. Before Bounty0x, the only option for a beginner to get involved in the cryptocurrency space was to risk his savings and buy cryptocurrency. We are offering an alternative by enabling anyone to earn it instead.\n5) Yes, it is.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Josue Flores",
         "message": "It seems that those from the United States of America are excluded from collecting BTNY within BountyOx from a lot of the posted bounties. Can you elaborate on why? How you plan to expand within that market and how do you plan to compete in a market that is mostly excluded?",
         "replyList": [
            {
               "commenter": "angelo adam",
               "message": "@josue-flores US users can join bounties paid in eth or stablecoin, but not participate in various bounties rewarding erc-20 tokens. We are working on features which will increase the number of jobs posted on the platform which are paying users in stablecoins and eth., and US users will be able to join those jobs.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Arturo Acevedo",
         "message": "You need to add a credit card payment option. A lot of investors use a credit card to pay as a secure way. I want to invest in your company, but only thru this method.\nYou have a good product congrats!\nThanks",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@arturo-acevedo Thanks for the feedback. We are in talks with our bank and hope to offer credit card payments ASAP.",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@arturo-acevedo Credit card payments are now accepted. Just wanted to let you know since you expressed interest in using credit card to invest. Thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jack Vinijtrongjit",
         "message": "Are your customers mainly in crypto space? I didn't see any clients that are rewarding in fiat, which I would think would also be a good option for companies that don't want to have anything to do with cryptocurrency? Any reason why you limit yourself to such small market? Most companies need social media presence even though they don't do anything with crypto.",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@jack-vinijtrongjit Hey Jack, thanks for your question. We started out in the cryptocurrency space because we believe it to be a high growth sector for the coming years and we want to establish ourselves early. Fiat reward payments are on our development roadmap but not the highest priority at the moment.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jean Luc PACIFICI",
         "message": "Credit card payment is always unavailable for Bounty OX !\nI asked it a month ago :((",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@jean-luc-pacifici Hey Jean, I am really sorry that this situation is not resolved yet. We are in touch with our Bank to get this issue resolved asap.",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@jean-luc-pacifici Credit card payments are now accepted. Just wanted to let you know since you expressed interest in using credit card to invest. Thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "James-Anthony Giorlando",
         "message": "I really love the concerpt of Bounty0x. Although I am not directly related, I do partake in the Publish0x ambassadors program for which I am very proud. All my experiences with you service have been great, and the rewards are a bonus.",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@james-anthony-giorlando Thanks for the kind words!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jared Busby",
         "message": "I want to know will I receive Bounty0x tokens for this or equity in the Bounty0x business?",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@jared-busby Hey Jared, in this fundraiser investors are purchasing equity in Bounty0x only.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Thomas S.",
         "message": "I have seen the BNTY Token not doing very well on CoinmarketCap (994) with a 24-Volume of only 1800$. The token price is -10x from the ico time in 2017 and I’ve read some concerns (FUD) about the team and development of the Project. Could you comment on those issues, please? Maybe also provide some Github metrics, progress, active partnerships...?",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@thomas-sowa Hello Thomas, thanks for your question.\n\nHere are some usage stats of our token:\n\n1.1M BNTY are currently staked by Bounty Hunters\n49.7K BNTY are currently staked by Bounty Sheriffs\n469.8K BNTY have been tipped on Publish0x\n\nOur platform is still in Beta, so we have decided not to open source our code yet for security reasons.\n\nYou mentioned you have read some concerns about the team and development. If you mention what those are, I will be happy to address them one by one.",
               "replyList": null
            },
            {
               "commenter": "Thomas S.",
               "message": "@pascal-thellmann\nHello Pascal,\nthanks for the prompt response.\n\nThe concerns were about some shady team member, but I don’t know the story. It was a year ago I think, then I lost track as there seemed not much news from or about your project. Even today, compared to other projects, there are not many respectable YouTube or other reviews, but maybe I just didn’t search right, and hope you can prove me wrong.\n\nSo, I guess the bad press from 2018 and the lack of reviews and closed source, gave me the impression of transparency avoidance.\n\nDon’t get me wrong. I liked the idea and project from the beginning in 2017, so hope you can provide some informative links with reviews like Hacked, HackerNoon, Crypto Lark or the like to provide some prove of activity and development throughout 2018 to ease my mind.\n\nI’d really like you to succeed and potentially invest here too.\n\nBTW, with this little volume on KuCoin, I’m surprised they didn’t delist you, like Trinity recently.",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@thomas-sowa @thomas-sowa See below for some Github metrics:\n\nHere (imgur.com/i51RLx8) is one screenshot of two repos we actively work on day to day.\n\nAlso Deniz's profile showing contributions to Bounty0x:\ngithub.com/dnzdlklc\n\nI’ll get Thomas to make it public too but he’s gone offline at the moment.\n\nThis is the link to our repo has some public repos:\nThis is a link to our Escrow contract to show we’re actively paying out hunters (users) on the platform:\nThis is a link to our Staking contract showing amount of BNTY staked by both hunters and sheriffs:",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jens Rothenborg",
         "message": "A little curious why you have the 0x in your name. Is the platform based on the 0x infrastructure?\nThanks",
         "replyList": [
            {
               "commenter": "Deniz Dalkilic",
               "message": "Hey @jens-rothenborg \"0x\" was added to our brand name due to couple factors. Initially when we started the platform was built and oriented around Ethereum blockchain. Given Ethereum addresses start with \"0x\" we thought it would be appropriate. Since then we have grown to be blockchain and token agnostic thus the \"0x\" has become a legacy. The second factor was Bounty0x was born as an idea/proposal on the District0x governance project. As such we carried over the tradition of \"0x\" from them and applied it to our branding as well.",
               "replyList": null
            },
            {
               "commenter": "Zailie Azri",
               "message": "@deniz-dalkilic good answer",
               "replyList": null
            },
            {
               "commenter": "Jean Luc PACIFICI",
               "message": "@deniz-dalkilic Credit card payment is always unavailable for Bounty OX !\nI asked it a month ago :((",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@jean-luc-pacifici Credit card payments are now accepted. Just wanted to let you know since you expressed interest in using credit card to invest. Thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Jean Luc PACIFICI",
         "message": "Hello,\nCard payment is not available four bountyX ??!!\nOnly US account or Wire are available .. why until other invest on Republic allow card payment ?",
         "replyList": [
            {
               "commenter": "Deniz Dalkilic",
               "message": "@jean-luc-pacifici thanks for reporting this. We will be in touch with Republic to see if we can come to a solution.",
               "replyList": null
            },
            {
               "commenter": "Jean Luc PACIFICI",
               "message": "@deniz-dalkilic thks! Waitting for your return so :)",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@jean-luc-pacifici Credit card payment should be supported shortly. Will let you know once we have added that.",
               "replyList": null
            },
            {
               "commenter": "Jean Luc PACIFICI",
               "message": "@angelo-adam Thank you ... I hope. since Republik answered me that \"\n\njeu. 9 mai 23:58 (il y a 19 heures)\nÀ moi\nThe offering is currently not accepting credit card payments.\n--\nMaxwell Rich\nChief Compliance Officer, Republic\"",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@jean-luc-pacifici We are awaiting approval, then once that is completed it should be activated.",
               "replyList": null
            },
            {
               "commenter": "Jean Luc PACIFICI",
               "message": "@angelo-adam Hello, somme news for credit card payments approval ?",
               "replyList": null
            },
            {
               "commenter": "Jean Luc PACIFICI",
               "message": "@deniz-dalkilic Hi, somme news for credit card payments approval ?",
               "replyList": null
            },
            {
               "commenter": "Jean Luc PACIFICI",
               "message": "@angelo-adam Hello, somme news for credit card payments approval ?",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@jean-luc-pacifici Credit card payments are now accepted. Just wanted to let you know since you expressed interest in using credit card to invest. Thanks!",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Ashok Sanghavi",
         "message": "Don't Really understand this company's video.\nIs it for software issues or any kind of issues?\nHard for someone to understand the video if the person is not US origin",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "At Bounty0x we make it easy for anyone to earn crypto. Although you are right that this includes software tasks, it is currently mostly centered around simple content, social media, and creative tasks.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Pavel Asanov",
         "message": "Can you please elaborate: The Merkle Hash Oct 23, 2017 and coin offering in December 2018 vs Founded Jan 2019? What happened before the incorporation date?",
         "replyList": [
            {
               "commenter": "angelo adam",
               "message": "@pavel-asanov We have the Bounty0x Cayman Entity which was founded in September of 18. We recently founded the Delaware entity in January, and it owns a portion of the Cayman Entity.",
               "replyList": null
            },
            {
               "commenter": "Pavel Asanov",
               "message": "@angelo-adam Thank you for answer, but it raises even more questions: 1. where will capital go to Cayman Islands or Delaware? 2. What % of Cayman Iland actualy own by Delaware 2. what will be delution as $5m cap currently looks not acurate concidering Cayman Islans entity. 3. Now it is clear that revenue metrics shown is not for Delaware entity what plans for Delaware entity besides rasing capital.",
               "replyList": null
            },
            {
               "commenter": "angelo adam",
               "message": "@pavel-asanov I would refer you to the of Proceeds section of the Form C (page 19). This raise is a part of a round of funding that will provide a 3-year runway for Bounty0x to build a marketing team and increase the development resources necessary to add features to the new business growth platform and the existing bounty web application. The additional features include pre-funded bounties, automated distributions, templates, Bounty Hunter Pro subscription model, new mobile application, platform redesign, integrated reward exchange, additional BNTY token use cases, and support for additional blockchains. The Company, as a 50% equity owner of Bounty0x, will use the proceeds to invest in Bounty0x, so that Bounty0x may accomplish its goals. 2. We are raising at $10M valuation but it's divided in half because of the Delaware's 50% ownership of the Cayman entity. Let me know if that clarifies your questions.",
               "replyList": null
            },
            {
               "commenter": "Pavel Asanov",
               "message": "@angelo-adam thanks, will maka a bet",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "Need an option to search for bounties by banned/non banned countries.",
         "replyList": [
            {
               "commenter": "Deniz Dalkilic",
               "message": "@baron-huntington its being released next week sometime :) We will send out notification on our Telegram group for our users.",
               "replyList": null
            },
            {
               "commenter": "Deniz Dalkilic",
               "message": "@baron-huntington as promised this feature is now live. If you hard-refresh you should see the new filter on the left.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Baron Huntington",
         "message": "What's your endgame?",
         "replyList": [
            {
               "commenter": "Pascal Thellmann",
               "message": "@baron-huntington Currently, the only way for a regular individual to get involved in crypto is by *buying* cryptocurrencies.\n\nThis creates several challenges and comes with risks that many people are not willing to take.\n\nAt Bounty0x we solve this problem by offering an alternative: instead of having to buy crypto, we enable anyone to get some coins by earning them.",
               "replyList": null
            },
            {
               "commenter": "Baron Huntington",
               "message": "@pascal-thellmann Are you planning to be acquired or possibly an ipo?",
               "replyList": null
            },
            {
               "commenter": "Pascal Thellmann",
               "message": "@baron-huntington We are still at a very early stage and want to grow Bounty0x further before starting any acquisition or IPO discussions . That said, it's not an option that we are opposed to.",
               "replyList": null
            }
         ]
      }
   ],
   "updates": [
      {
         "title": "Bounty0x Company Update —July 25, 2019",
         "description": "As part of our fifth company update since launching our Republic campaign, we are proud to announce that we recently crossed 64K active Bounty Hunters on our platform!\nFor the past several weeks we have been laying out a plan on how to increase the scope of our platform beyond just simple bounty tasks. \nOur development team started work on these new functionalities this week and we hope to share some insights into what is going on behind the scenes by the next bi-weekly update.\nWith that said, let’s dive into what happened at Bounty0x since the last company update.\n🏗 Product updates\nNew bounty host sign-up flow\nIn an effort to streamline the onboarding process of companies to our platform, we created a new host sign-up flow.\nNew bounty creation flow\nTo ensure that new bounties can be created and reviewed as fast as possible, we also created a new flow for the creation of bounties and the subsequent review by an admin of new bounties.\nAPI work\nWe created an API integration to allow pre-funding of bounties during or after their creation and the ability for admins to check and confirm any deposits on various blockchains. We also introduced cache on various endpoints to serve quicker with less constraint on the API.\nNew sorting filter\nTo make it easier for Bounty Hunters to find pre-funded bounties, we created a new sorting filter on our platform that enables browsing for this bounties type.\nBug fixes\nFinally, we also did multiple bug fixes to enhance and speed up process time of large datasets such as approval of thousands of submissions with uploading of CSVs, exporting of submissions and more.\n💰 Latest premium clients\nGaimin: view bounties\nArtPro Platform: view bounties\nIncent Loyalty: view bounties\nLunchMoney: view bounties\n💬 Media and other announcements\nAs always, since our last company update, we also published a reward distribution report on our blog to ensure transparency to our users.\nWeekly Distribution Report - July 23rd\nHere’s to another 2 productive weeks at Bounty0x!\nLooking forward to any questions you may have.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Bi-Weekly Bounty0x Update —July 9, 2019",
         "description": "Before diving into the company update, we would like to give a big thank you to our 41 amazing investors.\nIt’s now been almost 2 months since we started our fundraiser and we are happy to share that we just surpassed our minimum funding target!\nWith still almost 6 months left for our fundraiser to conclude, we are amazed by the support we have received so early on.\n🏗 Product updates\nIntegration with Bloom KYC\nAs part of our efforts to increase integrity and trust for all our users, we are fully integrated with Bloom KYC. Hunters can now verify their ID on Bloom and simply scan the QR code on their profile to reflect their KYC status on Bounty0x and partake in bounties that require KYC.\nIntegration with Lightstreams blockchain\nAs part of our mission to be the most complete token/chain agnostic platform within this space we are pleased to announce that we have integrated with yet another promising and upcoming blockchain project; Lightstream. \nWe now have the ability to take on Lightstream blockchain projects and distribute rewards accordingly. The number of blockchain integrations will continue growing as we move forward.\nFoundational changes to bounties and host account states.\nThis again is in-line with our efforts to minimize unpaid bounties and maximize potential profits for our hosts and hunters. We will now only support pre-funded bounties going forward with these changes.\nVarious UX changes\nWe added functionality for Bounty Hosts to provide live token trading links on their profiles. We also removed the ability to post “external bounties”.\n💰 Latest premium client\nBankDex: View bounties\n💬 Media and other announcements\nWe are committed to transparency and communication with our amazing community. Hence, you can expect us to publish at least 2 articles every week on our company blog.\nSince our last company update, we have published the following pieces:\nCOTI Transparency Report\nWeekly Reward Distribution Report - June 26\nSwissBorg Transparency Report\nXCOYNZ Transparency Report\nChimpion Transparency Report\nWeekly Reward Distribution Report - July 3\nBloom KYC Integration Announcement\nHighVibe Transparency Report\nHere’s to another 2 productive weeks!\nLooking forward to all your questions.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 100% 💥",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 90% 🏁",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 50% 🍹",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 30% 🎂",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Bi-Weekly Bounty0x Update —June 21, 2019",
         "description": "The recent rebound of the cryptocurrency market has also seen some increase in our usage stats. \nTo be well positioned for the continued growth and adoption for cryptocurrencies, we have been very hard at work (as always) for the past 2 weeks.\nThis update aims to summarize some of that work that we have completed since the last company update.\n🏗 Product updates\nIndependent Email Service API for better deliverability and reliance. \nWe have noticed the burden of sending out 1000s of emails each via our main API was causing a bottleneck and decided to create an independent email-server micro-service to handle any outgoing emails.\nUpdated Twitter service for more accurate tracking via using timelines API on Twitter. \nWe noticed an issue with Twitter's search API where it will \"sample\" tweets from our Bounty Hunters and this means it may not return specific tweets we're tracking even though they're there. \nThis is due to how Twitter itself handles the sampling of tweets. Thus, we changed to timelines to request all tweets from users timelines instead without any sampling and full-set of tweets.\nJWT generation and validation changes to further tighten security around API. \nWe've adjusted the expiry times and added additional scopes to our JSON-Web Tokens. This will require users to sign in more often than before but allow better security via shorter living token time and scopes added.\nFixes to social monitor API for better tracking users for Telegram auto-approval/rejection bounties. \nTelegram API will periodically fail if the Telegram account associated is either suspended, deleted or marked as \"spam\" on TG in general. Thus, API will check and react to these situations accordingly. It will also reject Bounty Hunters who have been reported as spam multiple times in multiple groups.\nFixes to host's ability to flag and reject hunters submissions. \nHosts were previously able to only mark hunters profile and if a hunter got flagged three times independently then their account will be flagged. The behavior has been adjusted so that they're still flagged but their submission also gets rejected and they get an email as a warning first two strikes.\n💰Latest premium client\nThe Anchor Project: View bounties\n💬 Media and other announcements\nTo increase transparency with our users and community, we have started again doing weekly reward distribution reports.\nOur reward distribution reports give key stats on the largest reward distributions that were recently completed.\nWeekly Distribution Report June 17\nWeekly Distribution Report June 10\nThanks for your amazing support so far! Look forward to more exciting news and updates soon.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Bi-Weekly Bounty0x Update —June 3rd, 2019",
         "description": "One month has already gone by since we started our fundraiser and it feels like it was yesterday. \nThe past 2 weeks were highly productive at Bounty0x and this update aims to summarize some of our progress.\nLet’s dive right in!\n🏗 Product updates\nExplore page\nIn an effort to increase time spent on site and the number of bounties completed by a Hunter per month, we completely re-built the landing page of our platform and re-named it to “Explore”.\nInstead of just showing a list of the latest bounties sorted by the date they were posted, the “Explore” page now turns finding new bounties into an engaging discovery process.\nSome of the sections of the “Explore” page include: Most popular bounty categories, featured Bounty Hosts, top bounties by category, and more.\nIcons for Pre-funded and KYC required bounties\nSome bounties have certain characteristics which make them more or less attractive for certain Hunters. \nTwo of these characteristics are if the rewards in a bounty have been pre-funded and if a bounty requires identity verification (KYC).\nIn order to help our users identify these bounties easier, we implemented two simple icons that make these bounties visually stand out.\nHelp Center article series to increase the quality of submitted work\nIn an effort to increase the work quality submitted from our work, we started writing a series of articles on our Help Center aiming to show hunters how to do great work.\nSome of the latest articles in this series include:\nHow to write a great article\nHow to make a great youtube video\nHow to create a great tweet\nYou can check out our help center at help.bounty0x.io\nFilter by available country\nFor regulatory reasons, some of the bounties on our platform are not available in certain jurisdictions. \nTo make it easier for our hunters to filter these bounties out, users can now filter bounties by “available country” in the advanced search bar.\n💰New clients\nHere are 2 of the latest premium clients that we boarded to our platform:\nStellerro: View bounties here\nVolentix: View bounties here\n💬 Media and other announcements\nBounty0x was mentioned in an excellent piece titled “How cryptocurrency workers are creating a more open economy”.\nThank you for your amazing support and questions so far.\nThis journey has already been very exciting so far and we are just getting started.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Bi-Weekly Bounty0x Update —May 16, 2019",
         "description": "Time flies fast! It’s now been around 2 weeks since we started our fundraiser so we decided that this is a great moment to do our first company update.\nOur updates will always be divided into 3 main sections:\nProduct updates\nNew clients \nMedia about Bounty0x and other major announcements\nWithout further ado, let’s dive right into it!\n🏗 Product updates\nImproved KYC system\nTo stay compliant with US regulations, we implemented an improved KYC system with our partner KABN. Bounty Hunters can now seamlessly complete identity verification to participate in bounties that require participants to do so.\nImproved Ethereum integration and better smart contract event handling\nImproved blockchain micro-service with better recovery handling in case of missed Smart Contract / Blockchain events that rise from reward distributions or BNTY staking activities. SQS queue implemented to handle and serve the main API to update BNTY staking Bounty Sheriff dashboard or payout of rewards on the Bounty Hunters side.\nImproved tracking for Twitter bounties\nFull end to end API integration with Twitter APIs to allow tweets to be tracked and updated in our records every day and once a days to ensure all users work is recorded and fairly compensated at the end of a given campaign.\nImproved and updated API inner working for a faster experience\nOptimized endpoints to allow vertical scaling with growing user base and number of requests coming in per second. Overall up to 35% faster API on all endpoints to improved web-app experience and better browsing for our users.\n💰 New clients\nHere’s a quick outline of some of the latest premium clients that joined our platform:\nMined Block: Bounties on Bounty0x\nFerrum Network: Bounties on Bounty0x\nKamari: Bounties on Bounty0x\n💬 Media and other announcements\nAngelo Adam, our CEO, recently joined an interview on WGN Radio. You can check it out here at minute 11:10.\nWe are happy to share that we recently completed a large bounty reward distribution. 78,000 QNT Tokens were distributed in total to over 1,400 Bounty Hunters. At the time of distribution, the tokens had a total value of approximately $150,000.\nBounty0x was mentioned in this excellent write up by Seth Benton about the Cryptocurrency Gig economy.\nThank you for your amazing support and questions so far. \nDon’t miss our next update exactly 2 weeks from now!",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Launched on Republic 🚀",
         "description": null,
         "comments": null,
         "updateDate": null
      }
   ],
   "reviews": [
      {
         "commenter": "Eric Dexter",
         "message": "I have been using bounty0x for awhile along with publish0x. I could see where they could use some web work on the bounty side to make it search better. would like to be able to recieve bat tokens on publish0x. plenty of room for growth for sure. $100",
         "replyList": null
      },
      {
         "commenter": "Isah Aminu",
         "message": "I invested because I want to grow my money $1,504",
         "replyList": null
      },
      {
         "commenter": "Антон Хлопков",
         "message": "Good project $25,000",
         "replyList": null
      },
      {
         "commenter": "Marvin Carter",
         "message": "Crypto is the Future!!!! $100",
         "replyList": null
      },
      {
         "commenter": "Chad Bilstein",
         "message": "Getting in on the ground floor of a new crypto company is a smart path to boost my retirement income. Now it's up to you guys to take this viral 1000X and make us all very happy. $100",
         "replyList": null
      },
      {
         "commenter": "Daniel Zhang",
         "message": "Cool platform. $100",
         "replyList": null
      },
      {
         "commenter": "ANTONIO RULLO",
         "message": "Great crypto play $100",
         "replyList": null
      },
      {
         "commenter": "Timothy Cronin",
         "message": "Interesting company. Good luck. $100",
         "replyList": null
      },
      {
         "commenter": "Elma Prince",
         "message": "It appeared to solve a problem that is needed. $100",
         "replyList": null
      },
      {
         "commenter": "Fram Gregor",
         "message": "I love u Amount is private",
         "replyList": null
      }
   ],
   "content": "Deal highlights\nDecentralizing the bounty hunting gig economy by creating a global network for businesses, bounty hunters, and sheriffs\n90+ Premium clients\n$7M worth of cryptocurrency bounties posted within 6 months of launch\n$1.5M ICO raise in 2018\nProjected 300% subscription growth in three years with the launch of Business Growth Platform\nBlockchain and token agnostic\nThere's no trusted platform for digital bounties \nBounties are a specialized job format enabling businesses to leverage the crowd in order to complete online software development and marketing tasks. But the current ecosystem is fragmented; businesses and hunters alike need to search across bounty lists, tokens, and platforms to engage freelancers and users. This takes time away from businesses and freelancers getting the rewards they want and is creating an obstacle within the crypto-economy. \nAnd with the growing concern over transparency and fraud, there’s a great need for a single, token agnostic platform to streamline the bounty hunting process and ensure payment for freelance hunters and sheriffs. \n\n\nA global bounty network\nBounty0x streamlines the bounty hunting gig economy by providing a global network for businesses, bounty hunters, and sheriffs to interact and earn cryptocurrency. It simplifies the bounty campaign process, allowing businesses to easily post bounties while also giving freelancers the opportunity to earn tokens directly through the site. \nBounties typically receive thousands of submissions, and a decentralized review system is a critical feature for hosts because without it, hosts would need to spend hours reviewing every submission. Bounty0x is the only platform with a decentralized and automated review system, which allows any user to join as a “sheriff”, stake BNTY tokens, and review bounty submissions made by other bounty hunters.  \nAs a bonus, the new Business Growth Platform provides a way for businesses and influencers to directly engage users in contests, rewards programs, and giveaways. It is becoming the go-to marketplace for all players in the bounty network to interact.\nHow it works\nWhether you are a hunter, host, or sheriff, you can use Bounty0x to find and post bounties, complete tasks, and earn or distribute cryptocurrency and rewards! \n1. Bounty Host posts a campaign\n2. Bounty Hunters complete bounties \n3. Bounty Sheriffs approve or reject work \n4. Cryptocurrency payment is distributed\nBounty categories\nIn 2019, the network will grow to help businesses engage more directly with users for viral contests, competitions, giveaways and more. Similar to the Crypto Platform, the Business Growth Platform will allow companies to:\nPost a campaign\nInvite the community to participate or enter to win a contest/giveaway\nDistribute rewards directly through the platform \nWhen a host creates an account, all of the bounties and campaigns are saved on the user dashboard. Also - as a bonus, hosts can link their Bounty0x account with third party applications to easily complete bounties on other platforms and to track everything in one place. \nBenefits of bounties\nCompanies can use bounties to build and scale their businesses.\n\nPress\nTraction\n90+ premium clients and growing\nSince launch, Bounty0x has been steadily increasing its user base and the value of bounties and ICOs on the platform. It is projected to more than double its profit and growth in 2019.\nOver 60k registered bounty hunters completing thousands of bounties each day. Over the past 8 months, Bounty0x has received over 800 bounty submissions per day on average.\n\n\nBounty0x is becoming the global marketplace for bounty campaigns\nOur users include bounty hosts, hunters, and sheriffs who are completing a variety of bounty campaigns around the world. \nSome of the companies that use our platform include:\nBusiness model\nOn Bounty0x, businesses can subscribe to a specific platform plan to post bounties. \nBounty hosts can purchase a monthly subscription:\nBusiness for $120/month\nPro for $250/month \nEnterprise for $500/month  \nBounty0x doesn't charge hosts any additional platform fee. Instead Bounty0x charges bounty hunters a small fee (10%) on their earnings. Bounty hunters can reduce the platform fee by staking BNTY tokens. \nBounty hunters can select a monthly BNTY staking option (tier 1, 2 and 3), this allows hunters to reduce platform fees by staking BNTY tokens, dispute more submissions, and other added value benefits. \nBounty Sheriffs can unlock the ability to review submissions by staking BNTY tokens. \nThe business reward product we are going to launch will have a monthly subscription option as well.  \nCrypto platform revenue\nWe earn between $15-$35k per month in revenue from 3 main sources\n$1-$5k per month in paid advertising\n$5-20k in marketplace transaction fees \n$10k-$15k monthly subscription fee for Pro Bounty Hosts \nAnd while we have between $15-20K in monthly expenses, we have earned $1.74 million in token sale revenue to date. \nWhat's next? Our Business Growth Platform\nBounty0x is developing its second SAAS business subscription product, which provides a service to both cryptocurrency and regular businesses. This new business growth platform is planned to launch soon. \nThe business growth platform makes it easy for businesses and influencers to engage users with viral contests, competitions, giveaways and more. With Bounty0x rewards platform, companies and influencers can easily hold competitions, reward winners with discounts, trials memberships, free products and other prizes. We’re projecting a 300% growth in subscription revenue in three years from the business growth platform. Here’s how we’ll tier pricing: \nFirst month free subscription plan\n$50/month Business plan\n$125/month Pro plan\n$400/month Enterprise plan\n\n\nBounty hunting is the job of the future \nCrypto is the next big thing. Its user growth is on pace with the early adoption stages of the internet.\nWith more users and projects, bounty hunting is looking to be the job of the future.\nToday, 1 in 3 workers are freelancers and it’s predicted that nearly half of workers in the US will be freelancers by 2020. \nThis gig economy is especially growing within the crypto world, where bounty hunters can contribute their skills - from coding to simple tasks like tweets - and get paid in tokens.\nThe combination of massive user growth and the increasing demand for freelance labor to produce crypto projects leaves tremendous potential for the crypto gig economy to transform the labor market as we know it.\nCompetition\nBounty0x is different from the competition and a market leader in the Bounty marketplace segment. Unlike competitors in the online freelance bounty space, Bounty0x supports security token bounties, and supports rewarding bounty hunters with tokens from more than 5 different blockchains. Unlike competitors, Bounty0x supports third party integrations with applications like Twitter, Telegram, Facebook, with others being added. Bounty0x also supports KYC for regulatory compliant Bounty campaigns, premade bounty templates, and plans to build a mobile application. \nBounty0x is also developing a business growth product to complement the bounty platform. The rewards platform will set itself apart from competitors in the space, by supporting instant rewards, a central reward marketplace, and integrations with unique third party applications. \nHow we are different: Crypto Platform\nHow we are different: Business Growth Platform\n\nInvestors\n$1.2 million ICO raise\nBounty0x raised $1.2 million in an initial coin offering in December 2018. Advisors and investors include:\nUwe Thellmann\nCEO at Conexess Trade Group and Operation Parter at Aurelius Private Equity\n\n\n\nSean Hoge\nManaging Partner at Ventury Coin\nCathy Tao\nChief Investment Officer at Vicuna Fund\n\n\n\nBen Chan\nChief Technology Officer at Bit-Go\n\n\n\nDan Bainbridge\nManaging Partner at Bigbird.vc\n\n\n\nGeorge Li\nCEO and Co-Founder at WeTrust\n\n\n\nWhat's next\nOn track to launch Business Growth Platform in Spring 2019 \nThe Business Growth platform will be a new product enabling companies and social influencers to engage their community and grow their business by making it easy to hold reward programs, viral contests, giveaways, and competitions which reward users who participate. Companies will be able to post campaigns, invite the community to participate, embed campaigns on third party  platforms and directly distribute rewards and prizes to winners and participants via the platform.\n\nTargeting $3 million in investment\nOur Republic campaign is a part of a round of funding that will provide a 3-year runway to build a marketing team and ramp up development to add significant features to the new business growth platform, and existing bounty web application. These features include pre-funded bounty, automated distributions, templates, Bounty Hunter pro subscription model, a new mobile application, platform redesign, an integrated reward exchange, additional BNTY token use cases, and support for additional blockchains.\n\nFounders & team \n\nAngelo Adam, CEO\nAttorney. District0x Community Manager, WeTrust Freelancer. Crowdfunded ethereum. Member of the Digital Ledger Defense Coalition. Equities Trader at a Hedge Fund.\n\nPascal Thellmann, CMO\nPR and Marketing in the crypto world. Contributor at CoinTelegraph. Copywriter. Previously co-founded a successful German e-commerce site.\n\n\nDeniz Dalkilic, CTO\nSoftware Engineer Thomson Reuters. Worked in Applied Innovation team on Blockchain/Ethereum projects. In particular concentrating on public Blockchains and DApp development via extensive use of Java and Smart Contracts.\n\nJoin us in creating a global bounty network! \nTogether we can make it easier for companies and influencers to grow their communities, engage their audiences and increase revenue.  About Bounty0x\nLegal Name\nBounty0x Inc.\nFounded\nJan 2019\nForm\nDelaware Corporation\nEmployees\n0\nWebsite\nhttp://bounty0x.io\nSocial Media\nHeadquarters\n86 Fleet Place , Brooklyn, NYBounty0x Team\nangelo adam\nCEO\nPascal Thellmann\nCMO\nDeniz Dalklic\nCTOFAQ\nHow do I earn a return?\nHow do I earn a return?\nWe are using Republic's Crowd SAFE security. Learn how this translates into a return on investment here.\nStill have questions? Check the discussion section.Risks\nWe have a limited operating history upon which you can evaluate our performance, and accordingly, our prospects must be considered in light of the risks that any new company encounters.\nThe Company and its subsidiary Bounty0x are still in an early phase and just beginning to implement their business plan. There can be no assurance that it will ever operate profitably. The likelihood of its success should be considered in light of the problems, expenses, difficulties, complications and delays usually encountered by companies in their early stages of development. The Company and Bounty0x may not be successful in attaining the objectives necessary for it to overcome these risks and uncertainties.\nThe Company is not subject to Sarbanes-Oxley regulations and may lack the financial controls and procedures of public companies.\nCryptocurrency Risks\nCryptocurrency Risks\nIndirect Interest\nShow all Risks"
}