{
   "name": "Citiesense",
   "url": "https://republic.co/citiesense",
   "dealTerms": [
      {
         "Valuation cap": "$4,000,000"
      },
      {
         "Discount": "20%"
      },
      {
         "Minimum investment": "$100"
      },
      {
         "Type of security": "Crowd SAFE · Learn more"
      },
      {
         "Funding goal": "$25,000 – $107,000"
      },
      {
         "Deadline": "January 1, 2020 at 2:59 AM (EST)"
      }
   ],
   "discussion": [
      {
         "commenter": "Michael Choe",
         "message": "who is the target client or subscriber?",
         "replyList": [
            {
               "commenter": "Starling Childs",
               "message": "@michael-choe Hi Michael- thanks for your question. We’re targeting neighborhood organizations at the moment. This includes Business Improvement Districts, Downtown Development Corporations, Community/Local Development Corporations, Chambers of Commerce, university campus management associations, and other place-based non-profit organizations. These all fall under stage 1 of our business model.\n\nIn stage 2 we work with these neighborhood community groups to help them reach others that need access to accurate information about the places they operate. These include real estate investors, retail business owners, insurance providers, mobility companies, among others. In many ways, stage 2 is about establishing a platform and framework for facilitating public private partnerships that can take a measured approach to improving places in cities (via access to accurate local data) and better serving local stakeholders.\n\nIf you’d like a few example of our target client for stage 1, we’ve listed many of our early adopters our here:\n\n\nAnd I think of all these place-based non profits, Business Improvement Districts are the most unique and well qualified to serve the role we see them providing as local operators in cities. I have a blog post about them here:\n\n\nIt’s a really exciting time to be working on new models for data access, governance and distribution at the local neighborhood level in cities. Big cities like New York, Toronto and London with many different neighborhood organizations are certainly at the forefront of these trends, but the models we’re developing and testing in New York are already scaling to smaller downtowns across the US.",
               "replyList": null
            }
         ]
      },
      {
         "commenter": "Gabriel Jarrosson",
         "message": "What's the revenue to date?",
         "replyList": [
            {
               "commenter": "Starling Childs",
               "message": "@gabriel-jarrosson Hi Gabriel. Thanks for your interest in Citiesense. For 2019 we are currently at $43,345 ytd. This is from our first stage of the business model - Software as a Service (SaaS) fees from early adopters.\n\nWhile these early SaaS fees provide an important metric to prove that there's a real need for the service, our focus for the business is on stage 2 - the marketplace for local data.\n\nStage 2 is focused on launching a membership portal and marketplace for local data about downtowns and busy commercial neighborhoods in cities. This is where we believe the more exciting opportunities in our space are right now, and the revenue we are collecting today is a signal that we're solving a key hurdle and barrier to entry to reaching this bigger opportunity.\n\nThis HuffPost article helps explain some of the complexities of the space and our unique approach to realizing the opportunity by equipping the local stakeholder groups we work with with the right tools for the job - whether they use the free version, which many of them do, or pay SaaS fees to access the more complete set of features, which we're finding many also plan to upgrade to this year.",
               "replyList": null
            },
            {
               "commenter": "Gabriel Jarrosson",
               "message": "@starling-childs Thanks for your answer ! :)",
               "replyList": null
            },
            {
               "commenter": "Starling Childs",
               "message": "@gabriel-jarrosson my pleasure- And please let me know if I can help clarify anything else.",
               "replyList": null
            }
         ]
      }
   ],
   "updates": [
      {
         "title": "Coney Island launches their community’s maps",
         "description": "We’re excited to be working with Coney Island. This unique waterfront community has been a focal point for New York State’s and the City’s community resiliency efforts lately, particularly in the wake of Super Storm Sandy. \n\nToday, Coney Island launched their interactive Development Activity Map, adding to the other two maps the community makes publicly available using Citiesense. Making this information more accessible will continue to support better planning and development for the neighborhood and attract the right partners interested in investing in Coney Island and doing business there. \n\nYou can explore their first three maps including all the development activity underway and available commercial real estate by visiting their website: https://www.allianceforconeyisland.org/do-business-here\n\nOr simply click the links below:\n\nLocal Businesses & Attractions\n\nAvailable Commercial Space\n\nDevelopment Activity\n\n\nConey Island joins several other NYC neighborhoods improving access to local data using Citiesense, such as Long Island City and Downtown Brooklyn, to name a few. And in addition to all of the NYC neighborhood communities adopting Citiesense, we have some exciting new adopters working on publishing maps for their communities outside of New York as well, including the most rapidly developing neighborhood in New England.",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Throwback Thursday // Flashback Friday with URBAN-X",
         "description": "We caught up with our partners at URBAN-X today to update them on a number things, including our work with Republic to launch this campaign. \nCitiesense graduated from URBAN-X in 2017 as part of the second cohort of startups focused on products and services designed to improve cities. We're happy to welcome all of our investors into the URBAN-X family. Here's a look back at our Demo Day presentation from this urban tech accelerator:",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 50% 🍹",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Launching Soon! \"Smart Signage\" in Long Island City",
         "description": "If you find yourself in Long Island City, you will notice more and more of our \"Smart Signage\" on business windows and other locations.\nThe signs help visitors, residents and others discover what's around them, including the vibrant mix of local businesses, events, exhibits, curated tours, and even special perks and discounts throughout the neighborhood.\nHere’s an example of a sign on the window of First Stop Bar & Grill. Go ahead and scan the code with your phone's camera to give the system a try.\n  QR Codes are not a new technology, but this system is the first of its kind. Never before has a neighborhood organization like the Long Island City Partnership deployed physical neighborhood-wide signage coupled with digital technology this way.\n\nHow is it unique from the big apps like Google Maps, Yelp, etc?\nSuper easy to use. Just focus your smartphone’s camera on the QR code displayed on one of the signs and click the link that instantly appears.\nInstant information about what's around you. No apps to download, no typing in searches - just hold up your phone's camera and click the link. \nSmart Signs are being installed in the public realm - on street furniture, building facades and storefronts. Private companies are not typically granted authority to manage public spaces. However this a unique role that organizations like Business Improvement Districts are able to play in cities. \nNeighborhood-wide user analytics. Citiesense provides the community of local business owners with unique map-based analysis of how people are interacting with the signs, displaying where some signs are more active than others.  This insight helps the community improve engagement with the signage by testing better messaging and updating locations. \nFor the neighborhood, by the neighborhood. LIC Local is entirely owned and operated by the local stakeholders and their community organization, the Long Island City Partnership. Citiesense enables them to collectively control all the content and signage. \nIt goes without saying that by using LIC Local you’ll be supporting the local retail shops, network of small businesses, cultural destinations, artists, landmarks, and neighborhood events.  Less obvious is that you'll also be helping the Long Island City community of business owners and property owners analyze data about where people are interacting with the \"Smart Signage\" enabling them to fine tune the experience and increase engagement.  And this is just the beginning... working with the Long Island City Partnership, we have big plans for neighborhood-wide interactivity in LIC.\n\nClick this link to take an early look at the LIC Local app >> liclocal.nyc",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Strong Growth Across NYC",
         "description": "I'm happy to share that our early adopters have already doubled this year, including more than half of the neighborhood communities in New York with Business Improvement Districts (BIDs). \n\nWe’ve grown to more than half of the neighborhoods with Business Improvement Districts (BIDs) across New York City and will continue to expand to other major downtowns in the coming months.\nWould you like to share Citiesense with your local downtown or business district?\nConnect your Community",
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Raised 30% 🎂",
         "description": null,
         "comments": null,
         "updateDate": null
      },
      {
         "title": "Launched on Republic 🚀",
         "description": null,
         "comments": null,
         "updateDate": null
      }
   ],
   "reviews": [
      {
         "commenter": "Nick Polasek",
         "message": "It's obvious times change and at a quick pace. Citisense seems like it would be a hit by what newer generations are drawn to. I plan to add on more $200",
         "replyList": null
      },
      {
         "commenter": "Stephen Jacobs",
         "message": "I am in the construction business being an Engineer Consultant. Citiesense makes sense. $500",
         "replyList": null
      },
      {
         "commenter": "Wendy Dorf",
         "message": "I have been involved with NYC government for fifty years and invested in Citisense because I believe the Citiesense application will enable and strengthen decision making to improve local communities in the City. $100",
         "replyList": null
      },
      {
         "commenter": "Stephen Dickerson",
         "message": "I like the business, Hope it does well $100",
         "replyList": null
      },
      {
         "commenter": "Howard Bennett",
         "message": "Sounds interesting. $100",
         "replyList": null
      },
      {
         "commenter": "Timothy Cronin",
         "message": "Interesting business that can serve a purpose as the world is constantly changing. $100",
         "replyList": null
      }
   ],
   "content": "Deal highlights:\nCollaborative data platform for neighborhood communities that centralizes and maps data to measure and improve commercial activities.  \nLocation intelligence will be a $25B+ industry by 2025 \nSuccessful beta testing in New York City\nURBAN-X alumni\n$150k raised to date\n\nProblem\nCommunities lack access to strong local data\nData is the center of how we apply technology to our daily lives, particularly in commercially active areas in downtowns and cities. There are different types of data about places, but local data is the most difficult to get. Local data provides operational insight about on-the-ground conditions - things we actually use in our daily lives & things that shape how we experience places.\n\nSolution\nCitiesense helps you navigate your neighborhood\n\nBy helping local business communities collaborate and use technology to improve their neighborhood, we solve the complex problem of maintaining accurate, standardized local data, and improve access to information about neighborhoods. Our map-based toolkit creates a hub for data about all properties, public spaces, and neighborhood improvements. \nTrack all the great things your neighborhood has to offer\n\nHow it works\nConnect your data - Create your knowledge-base with data about properties, contacts and streetscapes, in one platform\n\n\n\nUse the Map to Analyze Areas - Citiesense enables you to analyze data about any area, whether district, block or neighborhood scale. \n\n\n\nEngage your community - promote your community’s knowledge-base as the hub for insight about the neighborhood. \n\n\n\n\n\nPress\nAs seen in\n\n\nTraction\nOn track to reach 20 communities this year\nCitiesense has tested its product to track, manage & improve business districts in New York City using local data. We are on track to scale to over 20 communities in New York City by the end of this year, as well as 5 more outside New York.\nWe track streetscape assets and activities, such as street furniture like benches, street trees, food vendors, transit facilities, bicycle infrastructure, street lighting and lamp posts, waste bins, pedestrian activity, and more. \nWe also look at businesses and real estate, from commercial vacancies, a mix of retail business types, number of employees per business, number of tenants per property and building, commercial lease rates, development activity, housing options, etc. \n\nEarly adopters:\n\n\nCustomers\nLaunching in some of the world’s biggest cities\nOur customer is a neighborhood community organization and its members. In New York, we’ve worked with local data about busy downtown areas across the city and helped access data about streetscape assets and commercial real estate information to track, manage, and improve these areas.\nSome of our customers include: \nLong Island City Partnership \nGrand Central Partnership \nThird Avenue BID \nAlliance for Coney Island \nDowntown Brooklyn Partnership\nVillage Alliance\nFlatiron 23rd Street Partnership\nTestimonials:\n“As someone with experience running operations for a number of BIDs across NYC, I know first-hand how complex the neighborhood improvement process is, and how much access to good data supports the process. Citiesense understands this, and they've built a truly unique all-in-one solution for any downtown community that needs to start thinking about using data locally.”\nPaul Lotter | Director of BID Field Operations\nLong Island City Partnership\n___\n“Working with the Alliance for Coney Island, I was able to see first hand how resourceful small teams with limited resources can be when they adopt a toolkit like Citiesense. The systematic platform Citiesense is building revitalizes the way Business Improvement Districts access and analyze data about communities, and enables us to take a data-driven approach to informing local stakeholders of the impact our local organization is having on the neighborhood. It's exciting to be part of it, and I look forward to seeing how the platform evolves.”\nMamta Melwani | N360 Fellow at Alliance for Coney Island\nNYC Department of Small Business Services \n___\n“Citiesense is a terrific company to work with and understands our needs.  The platform Citiesense is building with early adopters like us is revolutionizing how we access and analyze data about our community and use that data to inform local stakeholders and key partners about opportunities to work together toward shared goals for the neighborhood.”\nJeannette R. Rausch | Director of Planning & Development\nLong Island City Partnership\n___\n“Citiesense has revolutionized how our BID analyzes and presents our district’s data and property contacts. The platform has helped bring us into the 21st Century.   We are a small team with limited resources and a toolkit like Citiesense saves our employees valuable time and allows us to demonstrate to our board and community the impact of our organization. Citiesense puts us on an equal playing field in terms of data analysis with organizations that have larger capacities. It is exciting to be part of the evolution of this new product whose potential continues to expand.”\nDaniella LaRocco | Director of Planning & Economic Development\nThe Village Alliance\n\n\nBusiness model\nAccess data through subscriptions, license data through the marketplace\nStage 1 - SaaS \nData management for business district communities. Helping communities access & manage their data. \nAll-in-one - A complete toolkit to maintain the most accurate data about a business district, including tenancy, development activity, vacancy, foot traffic, and streetscape conditions. \nPriced to scale - Citiesense provides three different levels of pricing for the SaaS customer, as well as a free level to get new communities started. The higher levels include additional features and more seats to increase collaboration.\nStage 2 - Local data marketplace (in development)\n Enabling communities to license their data, establishing the platform and source for local information about cities. \nShared maps \nCitiesense takes a percentage of fees set by a Business District community for membership.\nAPI access \nFirst 700 requests per month...Free\nEach additional 100 requests...$5.00\n\nMarket\nLocation intelligence is a $25+ billion market by 2025\nWe expect annual growth of 15% over the next three years as artificial intelligence and smart cities work together with real estate developers and urban tech companies to solve local issues. Location intelligence provides valuable strategic insight into understanding how humans move around and interact with commercial areas in cities, and how cities can be designed to perform better for a wider variety of people. \n\nCompetition\nCitiesense is the only data platform built specifically for neighborhood organizations\nThis includes Business Improvement Districts, Downtown Development Corporations, Community/Local Development Corporations, Chambers of Commerce, campuses, and other place-based non-profit organizations. In our rapidly urbanizing world, these stakeholder groups are realizing they need to adopt technology and data management tools into their workflows in order to keep track of the various assets that make up their neighborhood and ensure that their neighborhood is moving in the best direction for the many different people that live, work and visit the area. \nThe platform’s toolkit is a unique combination of map-based data analysis features, cloud-based data management and productivity tools for neighborhood communities, and membership management services for the organizations managing these communities. This unique suite includes user-friendly forms and QR Codes for managing information as a community of local business owners and property owners, as well as integrations with IoT technologies, government data sources, and popular tools for managing website content and contacts, like Wordpress, Wix, Salesforce, etc. \n\nInvestors\nRaised $150K to date\nCitiesense has raised over $150K to date from SOSV and other investors. We are also a part of the Urban-X accelerator.\n\nWhat's next\nMapping the cities of tomorrow together\nWe plan to use the next year to map and collect data in 20 communities in New York. From there, we plan to grow to 197 communities and enter our commercialization stage. After that, we hope to continue growing in both data collection and revenue. Our current goals are to grow our team and set up pilots in cities across Canada and the US, and we are also currently fostering new markets overseas in Europe, Asia and Australia as well.\n\nFounders and team \nHelp us strengthen your community’s local knowledge! \nTogether, we can help neighborhoods everywhere thrive.About Citiesense\nLegal Name\nCitiesense Inc.\nFounded\nJan 2015\nForm\nDelaware Corporation\nEmployees\n2\nWebsite\nhttps://citiesense.com/\nSocial Media\nHeadquarters\n335 Madison Avenue , New York, NYCitiesense Team\nStarling Childs\nCEO, Co-Founder\nUrban planner, designer, motorcycle enthusiast, bagpiper, who loves cities and constantly learning new things about how people are creating great places.\nVolkan Unsal\nCTO, Co-Founder\nNew York-based software developer with a track record of building great mobile and web software, and a passion for connecting communities.FAQ\nHow do I earn a return?\nHow do I earn a return?\nWe are using Republic's Crowd SAFE security. Learn how this translates into a return on investment here.\nStill have questions? Check the discussion section.Risks\nRisks have not been finalized yet."
}